{"sections":[{"title":"Nikkos Tyris","level":1,"content":[{"type":"paragraph","text":"Nikkos Tyris was a male Anzati who had served the Jedi Order and the Galactic Republic as a Jedi Knight during the final decades of the Republic Classic era. Tyris fell to the dark side of the Force and became one of the founders of the Jensaarai. He was one of Count Dooku's Dark Acolytes during the Clone Wars, and was killed by Nejaa Halcyon during the conflict."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"As a Jedi Knight during the Clone Wars, Tyris and two other Knights fell to the dark side after reading ancient Sith documents and becoming disenfranchised with the Jedi Order. They believed themselves to be following the Saarai, which meant \"True Way\" in ancient Sith. Taking the title of Saarai-kaar, Tyris led his \"Jensaarai\", or \"hidden followers of truth\" in Sith, and the cult grew strong enough to become a concern for the Jedi Council. Tyris was approached by Count Dooku, leader of the Separatists and the alter ego of a Sith Lord known as Darth Tyranus. Dooku gifted Tyris with a Sith holocron favored by former Anzati Jedi Volfe Karkko in exchange for his allegiance."},{"type":"paragraph","text":"A month before the end of the Clone Wars, the Jedi Council dispatched the Knights Nejaa Halcyon, Ylenic It'kla, and Desertwind to remove the Jensaari leadership. Attacking them on Susevfi, the Jedi engaged Tyris, Dustrose, and another loyal follower, in an attempt to remove the Jensaari from the war. Recalled as Nightsweat by Jedi It'kla, the Jedi attempted to turn the Dark Jedi from their path, but were rebuffed. As the battle raged on, the other members of the Saarai-kaar fell to the Jedi leaving Tyris alone with Jedi Halcyon. Taking advantage of Halycon's lack of telekinetic powers, Tyris was able to impale the Human on his azure lightsaber. As Halcyon lay dying, he drained Tyris' weapon of its power, and conjured a \"fist\" of energy. Releasing the energy, Halcyon crushed every bone in the Anzati's body before passing into the Force. The release of dark side energies at the deaths of the three Jensaarai leaders collapsed the structure where the rest of the Jensaarai were dwelling, killing all but four of the apprentices. The survivors included the wife of one of Tyris' apprentices, the woman who would later become the Saarai-kaar of the Jensaarai."}],"images":[]},{"title":"Powers and abilities","level":2,"content":[{"type":"paragraph","text":"Tyris favored the shien variant of lightsaber combat, holding his azure blade pointed toward the ground by the strong side hand, with the off side hand riding loosely on the weapon's pommel. He moved the blade in a triangular pattern that effectively warded the lower two-thirds of his body from attack. With this unique style, he could deliver lightning-fast slashes and ripostes that could easily split an opponent from groin to neck, while also rapidly rotating upwards to block overhead strikes."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"I, Jedi","elements":[]},{"text":"Vision of the Future","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Official Star Wars Fact File 24","elements":[]},{"text":"\"I, Jensaarai\"—Polyhedron 157","elements":[]},{"text":"The Official Star Wars Fact File 116","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Evil Never Dies: The Sith Dynasties on Hyperspace","elements":[]},{"text":"Star Wars Roleplaying Game Saga Edition Core Rulebook","elements":[]},{"text":"Jedi vs. Sith: The Essential Guide to the Force","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}