{"sections":[{"title":"Volfe Karkko","level":1,"content":[{"type":"paragraph","text":"Volfe Karkko was a learned Anzat Jedi Master–turned–Sith magician who lived more than a thousand years before the Invasion of Naboo. Karkko believed himself to be above the natural predatory instincts of his species; however, after casually tasting the \"soup,\" or essence, of several sentient beings—Jedi included—he rapidly developed an addiction which precipitated his fall to the dark side of the Force. The threat posed by Karkko's increasing bloodlust caused the Jedi High Council to rise up in battle against him, a fight which the Anzat ultimately lost. Rather than eliminating Karkko, the Council placed him in stasis on the prison world of Kiffex. For a millennium he remained incarcerated, left in full mental consciousness by the Council so that he might contemplate the error of his ways. Karkko, however, refused to renounce the dark side, and spent his time in isolation plotting his revenge against those who had imprisoned him. He became something of a legend among his kind over the years; other Anzati were drawn to Kiffex by Karkko's mental summons, and through their worship at the feet of the man whom they regarded as the \"Dark Dreamer,\" his prison was transformed into a place of hallowed ground. Karkko in turn fed on the essence of his visitors who, over time, devolved into beastly semblances of their former selves."},{"type":"paragraph","text":"In 30 BBY, Volfe Karkko sensed the arrival on Kiffex of Aayla Secura—an amnesiac Twi'lek Padawan—whom he lured to his prison and tricked into releasing him. Karkko seduced Secura to the dark side and took her as his apprentice, planning to make her his queen upon his escape from Kiffex. He placed his new student in command of his Anzat slaves and sent them to terrorize the populace of Kiffex in an attempt to attract the attention of the Jedi. Several Jedi responded, but only one, Aayla Secura's former Master Quinlan Vos, actually entered Karkko's stronghold to confront him. When the Dark Jedi's enchantment over Secura was broken by Vos, Karkko attempted to seduce Vos to the dark side, to no avail. Karkko then engaged Vos in lightsaber combat and was slain when the Kiffar Jedi Master cleaved him in two."}],"images":[]},{"title":"Biography","level":2,"content":[],"images":[]},{"title":"Rare Jedi","level":3,"content":[{"type":"paragraph","text":"Volfe Karkko was a male Anzat from the planet Anzat who lived more than a thousand years before the Invasion of Naboo. He was already more than eight hundred years old when his Force sensitivity was discovered by a member of the Jedi Order, and he was selected for Jedi training, during a time when enrollment was not restricted to children. Karkko eventually became a powerful—but arrogant—Jedi Master, one whose service to the Order over the years was nothing short of exemplary. Karkko was also well-known for the excessive amount of time he spent studying one of the Jedi Order's rare Sith holocrons kept within the Temple's Archives. He delighted himself in reminding other Jedi that his people remembered the first Sith Lords, though even with his extensive scrutiny of the holocron, there appeared to be no actual evidence to substantiate his claim."}],"images":[]},{"title":"Fall to the dark side","level":3,"content":[{"type":"paragraph","text":"Some members of the Jedi Order, among them the Jedi High Council itself, believed that training Anzati to use the Force was a dangerous affair, and there were fears that Volfe Karkko would not be able to resist his species' instinctive need to taste the \"soup,\" or life energy, of other sentients. Karkko vehemently dismissed these concerns, as his pride led him to believe that succumbing to such afflictions was beneath a Jedi as accomplished as him. He reasoned that because he had never tasted soup before, a single experience would be harmless. Upon his first taste, however, Karkko immediately became addicted, and craved soup ever thereafter. With his Jedi abilities, he began preying on other members of the Order, and through consumption of their essence Karkko became stronger in the Force. The Anzat fell to the dark side as a result and believed that he could single-handedly conquer the galaxy."},{"type":"paragraph","text":"Karkko's ambitions were deemed a threat to the Order, and the Jedi Council was forced to intervene. The Anzat fled to the world Kiffex in an effort to escape persecution, but he was still pursued by the Council. A battle ensued when they found him, during which Karkko held his own for a time. He was ultimately defeated by the Councilors who, rather than kill him, imprisoned him in a stasis field. Karkko was unable to move but remained in full consciousness, sentenced to a period of solitary confinement and left to reflect on his transgressions. Karkko's lightsaber was placed nearby in a miniature stasis field to serve both as a reminder to him of his former Jedi life, and as a warning to others of what could also befall them. The building on Kiffex which served as Karkko's prison was sealed to prevent anyone other than Jedi from gaining access."},{"type":"paragraph","text":"The memory of Volfe Karkko's downfall remained prominent throughout his one-thousand-year imprisonment. He achieved legendary status among the Anzat people as well as the Jedi, and his tale was even recorded in a holocron which remained locked away in the Holocron Chamber of the Jedi Temple's Tower of First Knowledge. Karkko's perpetual isolation on Kiffex did nothing to sway his allegiance to the dark side, however. While in solitude, he spent his time plotting the downfall of the Jedi Order and the resources such an aspiration required. As the centuries passed, Karkko's prison became a place of concentrated dark side power. His conscious spirit telepathically called to other Anzati and lured them to Kiffex. They were able to infiltrate his prison, where they worshiped at the feet of the one whom they called \"The Dreaming One.\" He corrupted them with his power, and by mentally draining the essence of his supplicants, Karkko was able to replenish his own strength. The Dark Jedi soon had an army of feral Anzat slaves, utterly devoid of sentience and completely bound to his will. None of the sycophants were able to release Karkko from the stasis field, something only another Jedi was capable of."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20100312053905\/starwars\/images\/thumb\/3\/3e\/VolfeFalls-Darkness.jpg\/250px-VolfeFalls-Darkness.jpg","caption":"Volfe Karkko battles the Jedi Council on Kiffex."}]},{"title":"Freedom","level":3,"content":[{"type":"paragraph","text":"In 30 BBY, after a thousand years in stasis, Volfe Karkko was finally granted an opportunity to escape confinement when a Twi'lek Jedi Padawan named Aayla Secura arrived on Kiffex. Although Secura was suffering from amnesia at the time, one particular memory remained with her: the murder of her uncle at the hands of her own Jedi Master, Quinlan Vos. It was through her anger at Vos and desire for revenge that Volfe Karkko sensed Secura's presence and began corrupting her to the dark side. He telepathically called her to his domicile and persuaded her to release him from stasis. Initially tempted with consuming the soup of a Jedi in such close proximity to him, Karkko resisted the urge to sup on her brain matter despite the deprivation he had long been forced to endure. He instead took Secura as his apprentice, with plans of eventually making her his queen after he abandoned Kiffex and had exacted revenge against the Jedi Order."},{"type":"paragraph","text":"Karkko immediately began preparing for his escape from Kiffex and saw his army of degenerate Anzati, led by Aayla Secura, as the means by which he would do so. He therefore placed her in command of his slaves and ordered them to attack a nearby security facility, where they slaughtered everyone inside. This attracted the attention of Sheyf Tinté Vos, ruler of Kiffex, who contacted the Jedi Council and requested that her nephew Quinlan be dispatched to investigate the disaster."},{"type":"paragraph","text":"During this same time, Astaal Vilbum, the Caretaker of the Jedi Temple's Tower of First Knowledge, witnessed the independent activation of the holocron which contained the legend of Volfe Karkko—one that had remained undisturbed for nearly fourteen generations. Vilbum was greatly troubled by this omen and alerted fellow Master Mace Windu, the Councilor who had assented to Quinlan Vos' intervention on Kiffex. The holocron's activation signified Volfe Karkko's release from stasis, and both Vilbum and Windu realized that Vos—who had a deep-seated fear of Anzati—was walking into a trap."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110302132413\/starwars\/images\/thumb\/4\/4d\/Volfe_Karkko_stasis_field.jpg\/220px-Volfe_Karkko_stasis_field.jpg","caption":"Aayla Secura discovers Volfe Karkko."}]},{"title":"Consolidation of power","level":3,"content":[{"type":"paragraph","text":"A pack of Volfe Karkko's slaves found and attacked Quinlan Vos and fellow Master Tholme when they landed on Kiffex, but were quickly slain by the Jedi. Another group of Anzati, this time led by Aayla Secura, was sent out to capture sentient beings for Karkko so that he might consume their essence. They attacked the patrons of the Black Hole cantina, but were opposed by Vos, Tholme, and a third Jedi, the Veknoid Master Zao. While Karkko's slaves harvested from the patrons of the cantina, his Twi'lek apprentice briefly fought her former Master, until a telepathic suggestion from Karkko reminded her that the mission he had sent her on superseded her need for vengeance. Secura, along with Karkko's Anzat minions, then fled the cantina, but the Jedi were in fast pursuit. After gaining a significant lead on them, Secura ordered the Anzati to hide themselves and ambush the Jedi when they passed, making sure to take them alive if possible so that Karkko could feast upon their soup. The subsequent attack was also repelled, thanks to the intervention of Kiffex's Jedi Watchman, Master T'ra Saa."},{"type":"paragraph","text":"Karkko was joined by Secura shortly afterward and listened as she reported her inability to complete the missions he had given her. He acknowledged her failure but explained that it had been his will that compelled Secura to abandon her task. Karkko mused over the fact that the consumption of a Jedi's soup would greatly increase his strength, prompting his apprentice to offer her own essence to him. The Anzat refused, preferring to instead wait for the Jedi whom he knew would most certainly come to him."}],"images":[]},{"title":"Final battle","level":3,"content":[{"type":"paragraph","text":"Karkko patiently anticipated the four Jedi Masters who approached his fortress and did battle with the Anzat defenders outside. They were able to defeat Karkko's slaves, but only one of the Jedi, Quinlan Vos, proceeded further into Karkko's domain. The Anzat was with Secura, Vos' former Padawan, in the inner sanctum when Vos arrived. Karkko greeted him before ordering the Twi'lek to attack. Secura dueled with Vos for a short time before the Jedi Master was able to break Karkko's spell over her by refusing to fight any longer. Enraged by the turn of events, Karkko blasted and incapacitated Secura with Force lightning, and then turned his attention to Vos."},{"type":"paragraph","text":"Karkko ignited his own weapon and engaged Vos in lightsaber combat while taunting Vos and attempting to lure him to the dark side. Vos tried to cut Karkko down after a brief clash of blades, but the Dark Jedi vanished into thin air and simultaneously conjured illusions of monstrous beasts to confound his opponent. Karkko then appeared behind Vos and used the Force to slam him into a nearby wall. He pressed his advantage but was halted when Vos unleashed a torrent of Force lightning, an ability the Anzat had not expected a proponent of the light to employ. Stalled only momentarily, Karkko projected his own lightning, the strength of which disabled Vos long enough for Karkko to prepare to harvest his soup. Contrarily, the Anzat neglected to account for Vos' companions outside the fortress—Masters Tholme, T'ra Saa, and Zao—whose combined power in the Force gave Vos enough strength to break Karkko's telepathic hold over him. Recovering from Vos' retaliatory assault, Karkko saluted his opponent with his lightsaber and readied himself for another exchange, only to be killed immediately afterward when Vos cut him in two."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20090711201838\/starwars\/images\/thumb\/2\/2b\/Volfe_Karkko_death.jpg\/250px-Volfe_Karkko_death.jpg","caption":"Karkko is killed by Quinlan Vos."}]},{"title":"Legacy","level":3,"content":[{"type":"paragraph","text":"The legend of Volfe Karkko and his fall to the dark side of the Force survived for many years after his death. The Jedi–turned–Sith Lord Count Dooku, leader of the Confederacy of Independent Systems, came into possession of one of Karkko's precious Sith holocrons, and used it in his seduction of another Anzat Jedi named Nikkos Tyris. Karkko had been something of a role model for Tyris, who painstakingly studied the teachings of his predecessor. Tempted by Dooku's promise of power, Tyris fell to the dark side and abandoned the Jedi Order as Karkko had done before him. He believed that he had discovered the \"Saarai,\" or \"True Way,\" and it was upon this belief that the foundations of the Jensaarai Order of Force-users was founded."}],"images":[]},{"title":"Personality and traits","level":2,"content":[{"type":"paragraph","text":"Volfe Karkko, whose given name was a common occurrence among the Anzati, stood nearly two meters tall and clad himself in flowing, black robes. He had olive skin and long black hair that he kept bound at the back of his head. Karkko also maintained a slight mustache and goatee. Like all members of the Anzat race, Volfe Karkko possessed two tentacle-like proboscises hidden within his cheeks. These appendages only revealed themselves when the Dark Jedi was ready to feed on the soup of a sentient being. He spoke his native Anzat language as well as Basic."},{"type":"paragraph","text":"Volfe Karkko served the Order with distinction during his time as a Jedi. He was faulted by his peers, however, for what they perceived as his proud and extremely arrogant attitude. He was well-known throughout the Order for his prolonged study of a rare Sith holocron, and he often boasted about how the Anzati knew of the original Sith Lords, a claim that was never proven. The teachings of Volfe Karkko regarding the Sith, which he compiled from various sources of Sith lore, were considered unorthodox by his Jedi peers. Karkko felt he was superior to the compelling nature of soup consumption and cited his Jedi training as the reason why such shortcomings had no affect on him. His first indulgence was based on that belief and resulted in a subsequent addiction. Over time, he developed a preference for other Jedi to satisfy his cravings. These acts, combined with his immense pride and brazen demeanor, paved Karkko's path to the dark side of the Force."},{"type":"paragraph","text":"The Jedi Council hoped that Karkko would reflect on the his fall to the dark side when he was apprehended and placed in stasis. On the contrary, Karkko intended to do no such thing and instead spent the centuries both nursing his hatred of the Jedi Order and contemplating his revenge against them. By 30 BBY, the fear of Karkko's freedom was still a cause of distress among the members of the current Jedi Council, and preventing his escape was a priority of the highest order. By the time Karkko was set free, his primary concerns included tasting soup and leaving Kiffex. He was content with delaying his soup craving for the more important escape, a plan he enacted upon his release. Karkko desired the essence of a Jedi to satisfy his craving, and he anticipated the arrival of those whom he was certain would respond once they became aware of his new-found freedom. Karkko was angered by the treachery of Aayla Secura, whom he considered a turncoat after his spell over her had been broken by Quinlan Vos. Karkko immobilized Secura without hesitation once he determined that she would no longer serve his purposes. He was intrigued by the darkness he sensed within Vos, but after several attempts, Karkko was unable to convince the Jedi Master to embrace it."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20110304140149\/starwars\/images\/thumb\/9\/99\/Aayla_kaarko.jpg\/200px-Aayla_kaarko.jpg","caption":"Volfe Karkko with his would-be consort, Aayla Secura."}]},{"title":"Powers and abilities","level":2,"content":[{"type":"paragraph","text":"While the Anzati had natural telepathic abilities with which they subdued their prey, Volfe Karkko's Jedi training afforded him a greater aptitude with mental manipulation. The Jedi took precautionary measures and developed methods of resisting the Anzati's strong hypnotic powers, but Karkko learned ways to counter these techniques. In draining the essence of Jedi, Karkko's benefits were twofold: his innate hunger was satisfied while he also grew stronger in the Force."},{"type":"paragraph","text":"Karkko was very strong in the Force, and learned in the ways of Sith magic. By the time he had fallen to the dark side, he was considered to be so much of a threat that the Jedi Council personally pursued him. Indeed, he had succeeded in slaying several of the Councilors before they were finally able to subdue him. While in stasis on Kiffex, Karkko's dark side aura permeated first his prison, and then the planet itself. He was still able to manipulate the Force and used it as the medium through which he summoned members of his species from as far as Anzat to his prison. Continuous exposure to Karkko's telepathic influence eroded their sentience, and with time, he bound all of them to his will. Karkko subjected Aayla Secura to the same treatment upon her arrival on Kiffex, taking advantage of her fragile mental state in order to convert the amnesiac Jedi to his service. Aside from telepathy, Karkko was skilled with Force lightning, an ability over which he touted total mastery. Casting Force illusions and disappearing into thin air also fell within the scope of his powers. He was proficient with telekinesis, using it to both slam his opponents into walls as well as paralyzing them just prior to consuming their soup."},{"type":"paragraph","text":"Karkko owned a red-bladed lightsaber of his own construction and wielded it in tandem with his Force powers. When dueling, Karkko switched between a single-handed, reverse grip and a traditional two-handed style. Prior to his incarceration, his prowess was such that he was capable of fighting multiple Masters of the Jedi Council simultaneously. When presented with the challenge of facing one Jedi joined by several others through the Force, however, Karkko was defeated and killed."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110514052650\/starwars\/images\/thumb\/7\/72\/Volfe_Karkko%27s_lightsaber.jpg\/150px-Volfe_Karkko%27s_lightsaber.jpg","caption":"Volfe Karkko's lightsaber"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Volfe Karkko first appeared as the primary antagonist of the Star Wars: Republic story arc Darkness, written by John Ostrander and penciled by artist Jan Duursema. Karkko is mentioned in connection to other Star Wars characters in several pieces of source material, such as The New Essential Chronology, Star Wars Insider 87's Order 66: Destroy All Jedi, and Jedi vs. Sith: The Essential Guide to the Force. He received further mention in StarWars.com Databank entries for both Aayla Secura and Quinlan Vos. T'ra Saa: An Expanded Universe Character first identifies him as a Sith magician, a distinction later corroborated by Saa's entry in 2008's Complete Star Wars Encyclopedia. A section of The Official Star Wars Fact File 137 was dedicated to Volfe Karkko, and he was also given his own entry in the Encyclopedia."},{"type":"paragraph","text":"Several contradictions arise when comparing the Star Wars: Darkness comic books to both The Official Star Wars Fact File 137 and The Complete Star Wars Encyclopedia. In Star Wars: Republic 35: Darkness, Part 4, Volfe Karkko is shown holding his lightsaber when he is cut in half by Quinlan Vos. The Official Star Wars Fact File 137, however, states that Vos used Karkko's own lightsaber to kill him. The Complete Star Wars Encyclopedia goes on to say that Karkko enthralled the local Anzat populace of Kiffex, but both the Official Star Wars Fact File 137 and Star Wars: Republic 34: Darkness, Part 3 state that the Anzati were drawn to Kiffex from their homeworld through Karkko's telepathic summons."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Republic 32: Darkness, Part 1","elements":[]},{"text":"Star Wars: Republic 33: Darkness, Part 2","elements":[]},{"text":"Star Wars: Republic 34: Darkness, Part 3","elements":[]},{"text":"Star Wars: Republic 35: Darkness, Part 4","elements":[]},{"text":"Jedi: Aayla Secura","elements":[]},{"text":"Jedi: Count Dooku","elements":[]},{"text":"Star Wars: Republic 73: Trackdown, Part 2","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Who's Who in the Jedi Order\"—Star Wars Insider 62","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":" T'ra Saa: An Expanded Universe Character on Wizards.com","elements":[]},{"text":"The Official Star Wars Fact File 98","elements":[]},{"text":"The Official Star Wars Fact File 104","elements":[]},{"text":"The Official Star Wars Fact File 116","elements":[]},{"text":"The Official Star Wars Fact File 137","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Evil Never Dies: The Sith Dynasties on Hyperspace","elements":[]},{"text":"\"Order 66: Destroy All Jedi\"—Star Wars Insider 87","elements":[]},{"text":"Jedi vs. Sith: The Essential Guide to the Force","elements":[]},{"text":" Order of the Jedi ","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":" Aayla Secura in the Databank","elements":[]},{"text":" Quinlan Vos in the Databank","elements":[]}]}],"images":[]}]}