{"sections":[{"title":"Anis","level":1,"content":[{"type":"paragraph","text":"Anis was a male Anzati who, prior to 36 BBY had become a clan leader amongst his species. Whilst in this position he was indebted to the criminal Wallanooga the Hutt and agreed to train the a Near-Human slave the Hutt purchased, name Aurra Sing, as an assassin. The Anzati assassin he assigned to train Sing, Torgo Tahn, later killed Anis with the aid of two of his students."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Anis was a male Anzati from the planet Anzat who was a clan leader amongst his species prior to the year 36 BBY. Whilst a clan leader he owed a debt to a Hutt criminal named Wallanooga, who asked him to train a Near-Human slave he had purchased from Senex pirates. The Hutt showed Anis the slave, whom was named Aurra Sing, and explained that she had been sold to the Senex by the Jedi known as the Dark Woman, whom the Anzati had heard of but assumed a myth. Sing was to obsessed with violence to be a pleasure slave but the criminal thought she had potential as a killer. Anis initially refused, saying that he and his trainers would only train fellow Anzati as their ability to feed on other beings brains was vital to their technique and as a non-Anzat Sing was nothing but a meal to the clan leader. The Hutt then called in the debt he was owed and Anis accepted saying he would accept the slave into his classes."},{"type":"paragraph","text":"Anis assigned Sing to one of his most able assassins and one of his own past students, Torgo Tahn. During Tahn's classes the teacher not only trained Sing to be a deadly assassin but attempted to establish a relationship with her, although she rejected his advances. After Sing left his training, Tahn and two of his other students killed Anis by decapitation with a chain, believing that the clan leader was old and dying and so would be grateful to be killed by one of his own students and not by a lucky shot from someone less able. The students then feed upon Anis's brain not wanting to waste it but were killed almost immediately after by Tahn for insulting Sing. Tahn then left the Anzat clan shortly after and later recounted the clan leader's death to Sing, whom he had captured, in 36 BBY."}],"images":[]},{"title":"Personality and traits","level":2,"content":[{"type":"paragraph","text":"Anis had blonde hair and pale skin. He considered non-Anzati unsuitable for training in Anzati assassin methods and saw them as food. He agreed to honor his debt to Wallanooga however and train Aurra Sing despite the fact she wasn't and Anzat, although he saw the matter as some what humorous. Torgo Tahn believed that Anis would rather have been killed by one of his own students then some one not as well trained who got a lucky shot ."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20080502013425\/starwars\/images\/8\/8b\/Anis.JPG","caption":"Anis"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Anis first appeared in a flashback in the black and white comic Aurra's Song written by Dean Motter and illustrated by Isaac Buckminster Owens and published in Dark Horse Presents Annual 2000: Girls Rule!. The comic was later republished in color with in Omnibus: Rise of the Sith which revealed the character's hair and skin color as well as the date at which the story took place. Anis also received entries in the Star Wars databank and The Complete Star Wars Encyclopedia which revealed no new information on him."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Aurra's Song","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Anis in the Databank","elements":[]}]}],"images":[]}]}