{"sections":[{"title":"Dannik Jerriko","level":1,"content":[{"type":"paragraph","text":"Dannik Jerriko was an Anzati bounty hunter known as the Eater of Luck, and by others as Death."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Jerriko drank his victims' brain matter, or soup of life, as he called it. Reasoning that they would go unnoticed, Jerriko preyed on murderers, thieves, and thugs, and was known amongst wealthier underworld bosses as an expensive, but thorough, means of dealing with failed assassins. An enigma, Jerriko did not suffer fools lightly and would not tolerate a client who could not appreciate the value received for his high fees. After brutally slaying and draining one complaining employer, Jerriko never heard another quibble over his price."},{"type":"paragraph","text":"Born during the New Sith Wars, Jerriko was just less than a thousand years old when Palpatine came to power. Somewhat surprisingly, he did not encounter a Jedi after 100 BBY until Obi-Wan Kenobi."},{"type":"paragraph","text":"Seeking out the soup of dangerous criminals, Jerriko came to Tatooine's Mos Eisley Cantina. On the day of Greedo's death, Jerriko sensed a strong, intoxicating soup of life from a Human. He attempted to probe Obi-Wan Kenobi, but he found the Jedi able to shield himself from Anzati probing, although young Luke Skywalker was a prime specimen. Jerriko's attention was drawn upon his discovery of Han Solo's presence at the cantina. Sensing a strong soup and aware of Jabba Desilijic Tiure's hefty bounty on Solo's head, Jerriko planned to make his move, but the smuggler departed from Tatooine before he could act."},{"type":"paragraph","text":"Seven months after the Battle of Yavin, Jerriko was hired on Tatooine to protect Tash Arranda, Zak Arranda, and Mammon Hoole from an Imperial assassin named Domisari. Jerriko spent some time in Jabba's Palace secretly following Hoole and the Arrandas. Eventually, Hoole, Zak, and Tash left Tatooine for Nespis VIII. Jerriko followed them there, and when Domisari finally attacked Hoole and the two children, Jerriko sprung into action, killing Domisari and drinking her soup."},{"type":"paragraph","text":"After this assignment, Jerriko returned to Jabba's Palace after agreeing to spy on Jabba for Lady Valarian and Eugene Talmont. Still desirous of Solo's soup, the Anzati's became excited upon the arrival of a carbonite slab containing Solo. However, Jerriko was deprived of his chance to drink Solo's soup when his Rebel Alliance comrades saved him. Frustrated at the loss of this opportunity, Jerriko accepted the option of sapping Jabba, only to be foiled by Jabba's death at the Great Pit of Carkoon. Mad with vampiric hunger and rage, Jerriko killed a number of unfortunate survivors at Jabba's Palace and then fled Tatooine to continue his endless search for \"soup\", now with a hefty bounty on his own head and topping the lists of such bounty hunters as the notorious Boba Fett."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20091113205226\/starwars\/images\/thumb\/5\/58\/Dannik_Jerriko.jpg\/180px-Dannik_Jerriko.jpg","caption":"Dannik Jerriko, frequent patron of Chalmun's Spaceport Cantina."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Dannik's last name is misspelled as \"Jericho\" in Children of the Jedi."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"A Hunter's Fate: Greedo's Tale webstrip","elements":[]},{"text":"Hammertong: The Tale of the \"Tonnika Sisters\"","elements":[]},{"text":"Star Wars: Episode IV A New Hope","elements":[]},{"text":"Play It Again, Figrin D'an: The Tale of Muftak and Kabe","elements":[]},{"text":"Star Wars 2: Six Against the Galaxy","elements":[]},{"text":"Nightlily: The Lovers' Tale","elements":[]},{"text":"Soup's On: The Pipe Smoker's Tale","elements":[]},{"text":"\"The Emperor's Court\"—Star Wars Tales 14","elements":[]},{"text":"Galaxy of Fear: Ghost of the Jedi","elements":[]},{"text":"Of the Day's Annoyances: Bib Fortuna's Tale","elements":[]},{"text":"Out of the Closet: The Assassin's Tale","elements":[]},{"text":"And Then There Were Some: The Gamorrean Guard's Tale","elements":[]},{"text":"The Great God Quay: The Tale of Barada and the Weequays","elements":[]},{"text":"Skin Deep: The Fat Dancer's Tale","elements":[]},{"text":"Epilogue: Whatever Became Of...?","elements":[]},{"text":"Children of the Jedi","elements":[]}]}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070818142838\/starwars\/images\/thumb\/1\/11\/Dannik_Jerriko_G1.jpg\/240px-Dannik_Jerriko_G1.jpg","caption":"Dannik Jerriko."}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Guide to Characters","elements":[]},{"text":"\"Use the Force: Bounty Hunters Trivia Quiz\"—Star Wars Galaxy Magazine 6","elements":[]},{"text":" Star Wars Customizable Card Game – A New Hope Limited","elements":[]},{"text":"\"The Last Page\"—Star Wars Insider 48","elements":[]},{"text":" \"The Anzati\"—Star Wars Gamer 1","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"The Official Star Wars Fact File 20","elements":[]},{"text":"The New Essential Guide to Characters","elements":[]},{"text":"\"Refresher Reading\"—Star Wars Insider 91","elements":[]},{"text":"Star Wars Miniatures: Bounty Hunters","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":" Star Wars Trading Card Game – A New Hope","elements":[]},{"text":" Star Wars Galaxies Trading Card Game – Galactic Hunters","elements":[]},{"text":"Star Wars Art: Visions","elements":[]},{"text":"Star Wars: Head-to-Head Tag Teams","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" \"I'd Just as Soon Kiss a Wookiee: Star Wars Romances,\" The Official Star Wars Blog","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" Cantina Roll-Call: Shedding Light on Some Alien Aliases on StarWars.com","elements":[]}]}],"images":[]}]}