{"sections":[{"title":"Saljé Tasha","level":1,"content":[{"type":"paragraph","text":"Saljé Tasha was a female Anzati assassin who served the Confederacy of Independent Systems during the Clone Wars. She had long, white hair and sported clawed cortosis gauntlets that had been given to her as gifts."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Approximately sixteen months after the First Battle of Geonosis, Tasha was hired by Sora Bulq and Senator Viento to assassinate former Supreme Chancellor Finis Valorum. Valorum boarded the freighter Star of Iskin, and Tasha followed and killed him, drinking his \"soup\". Tasha planted a bomb on the Star and exited before the ship lifted off. The Star of Iskin was destroyed to cover her tracks."},{"type":"paragraph","text":"Tasha kept in contact with Bulq and his Separatist clique after the Valorum job. About thirty-one months after Geonosis, two Anzati friends of hers were hired by Bulq to train Morgukai clones on Saleucami."},{"type":"paragraph","text":"Around this same time, Saljé was on Coruscant and heard through the grape vine that Khaleen Hentz was looking to hire her. But as she always researched people, Tasha rightly suspected that Quinlan Vos, Hentz's constant companion, was behind the request. Vos had come seeking information about the Valorum job and her connection with Senator Viento. Vos drew her into a heated confrontation to reveal what she knew, she promised to \"relieve\" him of the pain he caused and eventually he managed to draw the memories of her with his psychometric abilities, leading him to believe Sora Bulq was the \"Second Sith\", Darth Sidious. Since he knew the identity of her other employer, Tasha prepared to make him \"one of the Silent Voices, forever\". But before she could drink his soup, Khaleen struck her with a metal pole and aimed a blaster at her. Tasha fled the scene, having also lost her gauntlets in the process. She vowed vengeance on Quinlan and Khaleen."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070909045130\/starwars\/images\/thumb\/5\/55\/Saje2.JPG\/250px-Saje2.JPG","caption":"Saljé Tasha with her cortosis gloves."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In Trackdown, Dexter Jettster calls her Sajé Tasha, but when she grabs Khaleen Hentz, she calls herself Saljé Tasha."},{"type":"paragraph","text":"Unlike other Anzati, Saljé does not possess enlarged nostrils the way other Anzati do. It's not known if this was accidental or deliberate on the part of the artist"}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Republic: Trackdown","elements":[]},{"text":"Star Wars: Republic: Siege of Saleucami","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Unknown Regions","elements":[]}]}],"images":[]}]}