{"sections":[{"title":"Cato Neimoidia","level":1,"content":[{"type":"paragraph","text":"The oldest of the Neimoidian purse worlds, Cato Neimoidia was the location of Nute Gunray's secret redoubt. The planet was near the Neimoidian homeworld of Neimoidia, also in the Colonies region."},{"type":"paragraph","text":"Only the richest of the Neimoidians were allowed to live on the planet. Their treasures were protected in vaults located in difficult landscape and protected by B1 battle droids. The cities of Cato Neimoidia were built on large bridges spanning massive rock arches."},{"type":"paragraph","text":"Cato Neimoidia featured vast forests rich in flora and fauna. Notable species included the Neimoidian kreehawk, a dangerous but beautiful avian found in some aviaries."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Early history","level":3,"content":[{"type":"paragraph","text":"Cato Neimoidia was one of many worlds colonized by the Neimoidians early during the Old Republic era, joining the Galactic Republic sometime between 25,000 BBY and 22,000 BBY."},{"type":"paragraph","text":"The wealthiest and most resource-rich colony worlds were known as \"purse worlds\" that served as administrative posts ruling their own set of colonies. These purse worlds were the only colonies allowed to carry the name of Neimoidia. Other Neimoidian purse worlds include Deko Neimoidia and Koru Neimoidia, both were nearby in the same region of the Galaxy. Cato Neimoidia was the oldest purse world and may have been one of the earliest Neimoidian colonies."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20120830233413\/starwars\/images\/thumb\/9\/98\/CNCityBridges-SS.png\/240px-CNCityBridges-SS.png","caption":"Three bridge cities of Cato Neimoidia"}]},{"title":"Cold War","level":3,"content":[{"type":"paragraph","text":"During the Cold War, Republic spy Theron Shan was rumored to have had enemies in the corporate dens of Cato Neimoidia."}],"images":[]},{"title":"Rise of the Empire","level":3,"content":[{"type":"paragraph","text":"During the Clone Wars, it was a key member of the Confederacy of Independent Systems and was defended by the Neimoidian Home Defense Legions."},{"type":"paragraph","text":"In 19 BBY, the Republic launched an attack on the redoubt, led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, as well as Republic Navy Commander Jan Dodonna, to find Viceroy Nute Gunray of the Trade Federation and bring him to justice. Although Gunray escaped, he left behind hoards of valuables, all of which were captured by the Republic. In addition to this, he also left behind the Mechno-chair he used to contact the other Separatist leaders, and Darth Sidious."},{"type":"paragraph","text":"The bridge cities persisted in resisting the Republic, leading to a fierce aerial battle in which Plo Koon was shot down by his own clone pilots shortly after Order 66 was enacted by Supreme Chancellor Palpatine, who declared himself Emperor soon afterward. Also, the Jedi clones X1 and X2 fought in the battle, and X2 killed Jedi Master Ferroda in Gunray's palace, though he later turned against the Empire."},{"type":"paragraph","text":"Acting Viceroy Sentepeth Findos resisted for a brief moment but was forced by Stormtroopers to sign a peace treaty with the Empire the day that the Clone Wars ended, giving all of the Federation's resources to Palpatine's disposal to help him build the Galactic Empire. This had made the Trade Federation a puppet government."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20050526230043\/starwars\/images\/thumb\/b\/b0\/CatoNeimoidiaconcept.jpg\/220px-CatoNeimoidiaconcept.jpg","caption":"A Neimoidian room containing many valuables"}]},{"title":"Imperial period","level":3,"content":[{"type":"paragraph","text":"Months after the Clone Wars ended, agents of Bail Organa infiltrated the palace of Darga the Hutt in the ruined capital city of Zarra on Cato Neimoidia. They freed Darga's prisoner, Jedi Master Denia. Before leaving the palace, the agents overheard Darga's majordomo having a conversation with Inquisitor Draco."},{"type":"paragraph","text":"Four months after the Republic's transformation into the Galactic Empire, Jedi Dass Jennir came to Cato Neimoidia looking for work. Around the time when the Galactic Civil War began, the planet had been designated as an Imperial Protectorate of the Empire and thus outfitted with an Imperial garrison led by Baron Merillion Tarko. The Baron's iron rule over the planet, however, came to an end when a clone of Galen Marek flew to Cato Neimoidia to rescue General Rahm Kota, resulting in the destruction of much of Tarko-se, its arena, and the death of Tarko by being eaten by a Gorog as well."},{"type":"paragraph","text":"For nineteen years the federation continued to be a puppet government until the Imperial Senate was dissolved in 0 BBY taking the federation with it shortly before the Battle of Yavin."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic—The Lost Suns 3","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Clone Wars – \"Senate Spy\"","elements":[]},{"text":"\"Odds\"—Star Wars Insider 87","elements":[]},{"text":"\"CIS Shadowfeed Dispatch 14:10:05 Edition\"—Star Wars Insider 71","elements":[]},{"text":"Star Wars: The Clone Wars – \"Sabotage\"","elements":[]},{"text":"Brothers in Arms","elements":[]},{"text":"Labyrinth of Evil","elements":[]},{"text":"Reversal of Fortune","elements":[]},{"text":"Star Wars: Episode III Revenge of the Sith","elements":[]},{"text":"Star Wars Episode III: Revenge of the Sith junior novel","elements":[]},{"text":"Star Wars: Republic Commando: Order 66","elements":[]},{"text":"Star Wars: Republic: Into the Unknown","elements":[]},{"text":"Star Wars: Purge: Seconds to Die","elements":[]},{"text":"Star Wars Battlefront: Elite Squadron","elements":[]},{"text":"Star Wars: Dark Times 13: Blue Harvest, Part 1","elements":[]},{"text":"Star Wars: Dark Times 14: Blue Harvest, Part 2","elements":[]},{"text":"Coruscant Nights I: Jedi Twilight","elements":[]},{"text":" The Traitor's Gambit on Wizards.com","elements":[]},{"text":" A Wretched Hive on Wizards.com","elements":[]},{"text":" The Queen of Air and Darkness on Wizards.com","elements":[]},{"text":" Echoes of the Jedi on Wizards.com","elements":[]},{"text":"Celestia Galactica Photografica","elements":[]},{"text":"Star Wars: The Force Unleashed II","elements":[]},{"text":"Star Wars: The Force Unleashed II novel","elements":[]},{"text":"Star Wars: The Force Unleashed II comic","elements":[]},{"text":"Millennium Falcon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The New Essential Chronology","elements":[]},{"text":"Star Wars: Revenge of the Sith The Visual Dictionary","elements":[]},{"text":"\"Guide to the Grand Army of the Republic\"—Star Wars Insider 84","elements":[]},{"text":"\"Order 66: Destroy All Jedi\"—Star Wars Insider 87","elements":[]},{"text":"The Clone Wars Campaign Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 8","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 23","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" The Clone Wars Episode Guide: Senate Spy on StarWars.com","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 33","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 35","elements":[]},{"text":"\"Juno and the Jedi\"—Star Wars Insider 120","elements":[]},{"text":" Cato Neimoidia in the Databank","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"\"Unexpected Journeys\"—Star Wars Insider 140","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":" Buzz droid in the Encyclopedia","elements":[]},{"text":" Trade Federation in the Encyclopedia","elements":[]}]}],"images":[]}]}