{"sections":[{"title":"Neimoidia","level":1,"content":[{"type":"paragraph","text":"Neimoidia, also called Pure Neimoidia to avoid confusion with the Neimoidian purse worlds, was a planet in the Colonies region that the Duros from Duro colonized sometime around 25,000 BBY, bringing it into the Galactic Republic."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Early history","level":3,"content":[{"type":"paragraph","text":"Around 25,000 BBY, the Duros Chal Haan led a group of Duros explorers to colonize the planet Neimoidia. Neimoidia joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY."},{"type":"paragraph","text":"By 15,000 BBY, the inhabitants had evolved to the point when they could be considered a separate species from their Duros ancestors. The genetic differences from the Duros that the Neimoidians developed were attributed the features of the planet, including its heavier gravity, dimmer sun, humidity, and perpetual fog and mist."},{"type":"paragraph","text":"Neimoidia was ruled by a Trade Monarch, reflecting the Neimoidian's obsession with trade, commerce, and money. That was also present in the Neimoidian Inner Circle, the government\/legislature of the planet. The Neimoidians established purse worlds on nearby Cato Neimoidia, Deko Neimoidia, and Koru Neimoidia. Neimoidia was populated by the less capable and aggressive members of the species, all others moving off-world as soon as possible. Many low-level worker drones were kept malnourished so as to never reach full mental maturity. Combined with the planet's natural unpleasantness, it was usual for Neimoidians to choose not to return home unless absolutely necessary."},{"type":"paragraph","text":"By 4800 BBY, the Neimoidians locked up the distribution rights of newly-discovered ryll spice from Ryloth. Their irresponsible distribution of this drug led to the Gank Massacres, including the extinction of the Porporites."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070210005937\/starwars\/images\/thumb\/8\/8a\/Neimoidia.jpg\/200px-Neimoidia.jpg","caption":"A settlement on Neimoidia."}]},{"title":"Rise of the Trade Federation","level":3,"content":[{"type":"paragraph","text":"The Neimoidians helped found the Trade Federation in 350 BBY as a cartel of merchants and businessmen, although their defense force may have been some centuries older."},{"type":"paragraph","text":"In 33 BBY, the Trade Federation Viceroy Nute Gunray took over Dorvalla and then monopolized the Trade Federation Executive Board, resulting in Kuat Drive Yards leaving the Trade Federation. To offset this loss, the Neimoidians acquired KDY corporate secrets through corrupt KDY officers whom set up Kuati Security Forces officer Kalyn Farnmir to take the fall."},{"type":"paragraph","text":"After the failed Invasion of Naboo, Trade Federation Senator Lott Dod was ordered to tell Trade Federation Viceroy Nute Gunray to disband the droid army. Fearing an attack from the Republic if they would not comply, the Trade Federation leaders seemingly complied by 29 BBY, but fled Neimoidia for the three purse worlds to continue the development of their army well into the Clone Wars."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20061021200803\/starwars\/images\/thumb\/5\/52\/Neimoidian_NEGAS.jpg\/180px-Neimoidian_NEGAS.jpg","caption":"A Neimoidian."}]},{"title":"The Clone Wars","level":3,"content":[{"type":"paragraph","text":"During the Clone Wars, the Republic retook Neimoidia and its purse worlds from the Separatists in 19 BBY. During the battle, Neimoidia was ravaged, and the destruction of many Neimoidian grub-hatcheries would affect the Neimoidian species."},{"type":"paragraph","text":"Later, Viceroy Gunray and Settlement Officer Rune Haako were killed on Mustafar by Darth Vader. With the rise of the New Order, the Trade Federation was disbanded after Acting Viceroy Sentepeth Findos signed a treaty on Neimoidia, and Neimoidians began to adopt the culture of the baseline Duros to disassociate themselves with the Trade Federation's shameful legacy. Afterward, Neimoidians rarely traveled, unless shifty dealings were afoot."}],"images":[]},{"title":"Later History","level":3,"content":[{"type":"paragraph","text":"In 6 ABY, Neimoidia was quarantined due to viruses. This was not the first time such a precaution had been taken; numerous diseases and viruses originated on the planet, with the Neimoidians propagating them throughout the galaxy. The Intestinal Revenge of Bars Barka, which led to severe weight loss among Ubese colonists, as well as Great Pandemic of Deersheba, both called Neimoidia home. According to a joke made by Ebenn Q3 Baobab, onetime doctor for a Neimoidian fleet, \"the principal export of the Neimoidian home planet is Brainworm Rot Type C\"."},{"type":"paragraph","text":"Some Neimoidians joined the New Republic as pilots in the Yuuzhan Vong War, while others fell into criminal groups."}],"images":[]},{"title":"Biosphere","level":2,"content":[{"type":"paragraph","text":"Neimoidia was known for its manax tree orchards and fungus farms, tended by harvester beetles. Such orchards and farms, as well as the beetles, were established on all the purse worlds. Other known native species include:"},{"type":"list","elements":[{"text":"Mistfly","elements":[]},{"text":"Neekoflights","elements":[]},{"text":"Pylat","elements":[]}]}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Darth Plagueis","elements":[]},{"text":"Darth Maul: Saboteur","elements":[]},{"text":"Cloak of Deception","elements":[]},{"text":"Darth Maul: Shadow Hunter","elements":[]},{"text":"End Game","elements":[]},{"text":"Republic Commando: True Colors","elements":[]},{"text":"CIS Shadowfeed Dispatch 14:2:14 Edition","elements":[]},{"text":"CIS Shadowfeed Dispatch 14:7:01 Edition","elements":[]},{"text":"CIS Shadowfeed Dispatch 14:10:05 Edition","elements":[]},{"text":"Yoda: Dark Rendezvous","elements":[]},{"text":"Republic HoloNet News Special Inaugural Edition 16:5:24","elements":[]},{"text":"Dark Lord: The Rise of Darth Vader","elements":[]},{"text":"Death Star","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Secrets of Naboo","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Inside the Worlds of Star Wars: Episode I","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Galactic Phrase Book & Travel Guide","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Unseen Planets of Episode I","elements":[]},{"text":"The Official Star Wars Fact File 7","elements":[]},{"text":"The Official Star Wars Fact File 139","elements":[]},{"text":" \"The University of Sanbra Guide to Intelligent Life: The Duros\"—Star Wars Gamer 2","elements":[]},{"text":"Star Wars: The Official Figurine Collection 53","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Written Word on Hyperspace","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 33","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"Suns of Fortune","elements":[]}]}],"images":[]}]}