{"sections":[{"title":"Balmorra","level":1,"content":[{"type":"paragraph","text":"Balmorra was a factory world that was located within the Nevoota system, situated in the Colonies region at the border of the Core Worlds."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Wide plains surrounded the planet's capital, Bin Prime. Balmorran metal parasites feasted on metals in the urban areas of Balmorra. Balmorra flu was presumably from the world."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The world began as a colony of Humbarine. Due to slow interstellar travel and communications, it was one of several colony worlds that declared their independence."},{"type":"paragraph","text":"During the settlement of Balmorra, while the Republic was still in its infancy, Balmorra quickly established itself as a haven for renowned weapon and battle droid manufacturers. While determined to remain independent of the Republic, they became strong allies supplying the Galactic Republic and the greater galaxy with advanced droids and weapons."}],"images":[]},{"title":"Republic era","level":3,"content":[{"type":"paragraph","text":"Balmorra joined the Galactic Republic prior to the Indecta Era. During the Alsakan Conflicts, it supported Coruscant."},{"type":"paragraph","text":"Balmorra was a battlesite during the Hundred-Year Darkness. In that conflict, Leviathans bred by the Dark Jedi splintered the Jedi barricades on the planet. During the Great Galactic War the Sith Empire resolved to seize Balmorra due to their military manufacturing plants and strategic location close to the Core Worlds. The Republic immediately sent soldiers to prevent that from happening. As the Great Galactic War continued and the Sith Empire's control continued to spread, the strained Republic began removing forces from Balmorra for redeployment to more important conflicts. This continued until the Treaty of Coruscant was signed."},{"type":"paragraph","text":"The Republic base designated 11A had been established on Balmorra and was still under Republic control until the Treaty was signed. The commander of the base, General Buryn was assigned to leave the base with his troops as per the terms of the Treaty. General Buryn wanted to fulfill his orders, however the Jedi Fortris Gall insisted that the Republic team that was held captive by the Sith, Demolitions Squad 419, had to be freed first. The Jedi traveled to the Troida Military Workshop, where the soldiers were held hostage, without the permission of Buryn. Buryn chose to remain on planet after the Treaty's enforced deadline and waited for Fortis. Master Orgus Din soon joined the General and Jedi Fortis, to convince them both to leave the planet in an attempt to prevent further battles with the Sith, and to begin following the terms of the Treaty."},{"type":"paragraph","text":"Following the treaty and the beginning of the Cold War, the Republic was forced to officially end its support for Balmorra. However a small underground Republic force was left on the planet to aid in a resistance against the remaining Sith Empire. However, most Balmorrans shared the view that they had been abandoned by the Republic. Surprisingly, the remaining underground resistance prevented the Sith Empire from ever taking complete control of the planet. A number of years after the treaty was signed, with the fragile brokered peace between the Sith Empire remaining, the Republic began reintroducing Republic forces to the planet and while the Balmorrans were receptive to the assistance, their resentment of being abandoned in the past remained. At the same time, the Sith Empire attempted to escalate their presence on the planet in a further attempt to claim Balmorra's battle droids and weaponry."},{"type":"paragraph","text":"At one point, the planet was once the headquarters of Rigorra the Hutt. The Techno Union produced B1 battle droids on Balmorra until shortly before the Clone Wars. The production of battle droids then seemingly ceased, but secretly continued on Outer Rim Territories factory worlds such as Geonosis. In 22 BBY Balmorra seceded from the Galactic Republic and was given a fleet of Lucrehulk-class battleships to defend it. Balmorra was also the headquarters of Balmorran Arms, which manufactured SD-6 Hulk infantry droids."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140801122924\/starwars\/images\/thumb\/5\/5c\/Camp_Traken-4.png\/200px-Camp_Traken-4.png","caption":"A military base on Balmorra during the Great Galactic War"}]},{"title":"Imperial era","level":3,"content":[{"type":"paragraph","text":"Under the New Order, Governor Hinch Beltane ran the planet and oversaw production. During the reign of Galactic Emperor Palpatine, the Balmorrans manufactured weapons for the Imperial Army with strong ties to Kuat Drive Yards, and were the primary builders of the AT-ST walker."},{"type":"paragraph","text":"The Balmorrans longed for independence from the Galactic Empire, wishing for a free market on which to sell their vaunted weapons technology. Although there was mutual good feeling between the Rebel Alliance and the natives of Balmorra, liberation would have been impossible, as the planet was well defended, and isolated from the other planets held by the Rebels."},{"type":"paragraph","text":"Instead, the Alliance launched a hit-and-run sabotage effort, using the cover of the night to go undetected by Imperial sensor arrays. It was not until Luke Skywalker and Rogue Squadron had demolished much of the weaponry under construction in the yards that any kind of serious retaliation force was launched."},{"type":"paragraph","text":"By 4 ABY, the planet had become an Imperial fortress world. Balmorra remained under Imperial control until at least 6 ABY.Years later, the planet was liberated by the New Republic following the Battle of Endor, and it remained independent for years. Balmorra was brought back into Imperial service during the Emperor's reappearance, but following Palpatine's supposed death near Da Soocha, the rebellious Balmorrans began arming the New Republic."},{"type":"paragraph","text":"In retaliation, the planet was attacked by a force under the command of Military Executor Sedriss QL, including Shadow Droids and SD-9-series battle droids. After suffering surprising losses at the hands of Balmorra's SD-10 battle droids and new Viper Automatons, Sedriss called off his attack in exchange for a shipment of the molecularly-shielded droids."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100529044940\/starwars\/images\/thumb\/6\/63\/Balmorra_surface_view.jpg\/150px-Balmorra_surface_view.jpg","caption":"Balmorra's surface with Bin Prime seen from orbit, ca. 10 ABY."},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110703092629\/starwars\/images\/thumb\/1\/16\/Battle_of_Balmorra.jpg\/200px-Battle_of_Balmorra.jpg","caption":"Balmorra's capital is attacked by forces under Maximilian Veers."}]},{"title":"Later history","level":3,"content":[{"type":"paragraph","text":"During the Yuuzhan Vong War, the Senator for Balmorra offered any planet ground-based turbolasers in exchange for protection by a fleet during a panicked session of the Senate."},{"type":"paragraph","text":"During the Second Galactic Civil War elements of the Confederation Fleet attacked Balmorra in their push to reach the Core Worlds. This resulted in the Second Battle of Balmorra."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC video game Star Wars: Rebellion mistakenly places Balmorra in the Sesswenna sector (a misspelling of the true Seswenna sector) of the Galactic Core. The Seswenna sector is canonically located in the Outer Rim Territories."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Old Republic: Smuggler's Vanguard","elements":[]},{"text":"Star Wars: The Old Republic, Threat of Peace Act 2: New Galactic Order","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":" The Sixth Line: Part One on The Old Republic's official website","elements":[]},{"text":" The Sixth Line: Part Two on The Old Republic's official website","elements":[]},{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"Star Wars: The Old Republic: Shadow of Revan","elements":[]},{"text":"Cloak of Deception","elements":[]},{"text":"Star Wars: Republic 29: The Hunt for Aurra Sing, Part 2","elements":[]},{"text":"The Bounty Hunters: Aurra Sing","elements":[]},{"text":"Star Wars Adventures 4: Jango Fett vs. the Razor Eaters","elements":[]},{"text":"Star Wars Adventures 5: The Shape-Shifter Strikes","elements":[]},{"text":"Star Wars Adventures 6: The Warlords of Balmorra","elements":[]},{"text":" Baktoid Closes Down Five More Plants—HoloNet News Vol. 531 46","elements":[]},{"text":" Balmorran Secures Musician Rearmament Contract—HoloNet News Vol. 531 56","elements":[]},{"text":"Star Wars: The Clone Wars – \"Shadow of Malevolence\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"Destroy Malevolence\"","elements":[]},{"text":"Boba Fett: Maze of Deception","elements":[]},{"text":"The Cestus Deception","elements":[]},{"text":"\"CIS Shadowfeed Dispatch 14:7:01 Edition\"—Star Wars Insider 68","elements":[]},{"text":"Star Wars: Empire at War","elements":[]},{"text":"Star Wars: Rebellion","elements":[]},{"text":"Star Wars: Rogue Squadron","elements":[]},{"text":"Dark Empire II","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"The New Jedi Order: Recovery","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Dark Nest II: The Unseen Queen","elements":[]},{"text":"Legacy of the Force: Tempest","elements":[]},{"text":"Legacy of the Force: Exile","elements":[]},{"text":"Legacy of the Force: Inferno","elements":[]},{"text":"Millennium Falcon","elements":[]},{"text":"Fate of the Jedi: Vortex","elements":[]}]}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070426013756\/starwars\/images\/thumb\/8\/82\/Eaw_Balmorra.jpg\/150px-Eaw_Balmorra.jpg","caption":"Balmorra during the Galactic Civil War"}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Game Room: Launching a New Rebellion\"—Star Wars Galaxy Magazine 10","elements":[]},{"text":"\"Don't Leave Home Without It\"—Star Wars Galaxy Collector 1","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"The Essential Guide to Vehicles and Vessels","elements":[]},{"text":"The Essential Guide to Droids","elements":[]},{"text":"\"ComicScan: Comics That Almost Were\"—Star Wars Galaxy Collector 4","elements":[]},{"text":"Star Wars: Rogue Squadron: The Official Nintendo Player's Guide","elements":[]},{"text":"Ultimate Adversaries","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Star Wars: The Comics Companion","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 10","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" Balmorra on The Old Republic Holonet","elements":[]},{"text":"Scavenger's Guide to Droids","elements":[]},{"text":" Geonosis droid factory in the Databank","elements":[]},{"text":" Tanno Vik on The Old Republic Holonet ","elements":[]},{"text":"The Art and Making of Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Old Republic Explorer's Guide","elements":[]},{"text":"Book of Sith: Secrets from the Dark Side","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":" Star Wars: The Essential Guide to Warfare Author's Cut, 12: Tales of the New Republic on StarWars.com","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"Star Wars: Imperial Handbook: A Commander's Guide","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Balmorra on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}