{"sections":[{"title":"Kelada","level":1,"content":[{"type":"paragraph","text":"Kelada was a planet in the Anarid Cluster. It was controlled by the Galactic Empire during the Galactic Civil War. As the Rebel opposition grew stronger, an increasing number of smugglers frequented the planet, many of them hanging out at Lorana's Labyrinth."}],"images":[]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Kelada was located within the Kelada system, in the Duluur sector of the Colonies region of the galaxy. It was situated on the Corellian Trade Spine, a hyperlane which connected it to Enisca and Foless. Kelada's surface was divided between industrial wasteland and natural areas, including several large forests and a vast savannah."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Kelada was within space that remained loyal to the Galactic Republic during the Clone Wars. Later, during the Galactic Civil War, Kelada was an important asset for the Galactic Empire due to its production of repulsorcraft and speeder bikes, as well as components for repulsorlifts and walkers. A giant assembly factory operated by Arakyd Industries was especially valued by the Empire. Around 3 ABY, Rebel Alliance operative Vewin was captured by Imperial agents on Kelada. In the months after the Battle of Endor, Imperial engineers transported components from dismantled factories on recently-abandoned worlds to Kelada, where they were used in the construction of several new factories. As a defense against orbital attack, the engineers also set up a v-150 Planet Defender near the planet's main starport."},{"type":"paragraph","text":"There was also an Imperial skunkworks on Kelada, although the top designers at the skunkworks disappeared from the radar, alongside hundreds of schematics for experimental weapons the months prior to the Thrawn campaign. The reasons behind the disappearance would not be revealed until a few months after the crisis, when the reborn Emperor Palpatine had his fleet attack from Byss."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"Finder's Fee\"—Star Wars Adventure Journal 6","elements":[]},{"text":"\"Chessa's Doom\"—Star Wars Adventure Journal 1","elements":[]},{"text":" \"Dead End Drop\"—Shadows of the Empire Sourcebook","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Smuggler's Log\"—Star Wars Adventure Journal 1","elements":[]},{"text":"\"Recon & Report: The Journey to Coruscant\"—Star Wars Adventure Journal 2","elements":[]},{"text":"Star Wars Adventure Journal 13","elements":[]},{"text":"Platt's Smugglers Guide","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]}]}