{"sections":[{"title":"Drunost","level":1,"content":[{"type":"paragraph","text":"Drunost was a planet located within the Shelsha sector of the galaxy. A Consolidated Shipping hub and outlet were located near the planet's largest town, Conso City, making Drunost a good stop for fuel and supplies. Nominally under the jurisdiction of the Galactic Empire, the world consisted primarily of mines and farmland as well as company towns, and was settled by both Humans and aliens. During the time of the Galactic Civil War, the planet was also home to a Rebel Alliance supply line. The planet was also the scene of pirate activity engaged in by the BloodScar group."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Drunost was located in the Drunost system of the Shelsha sector, part of the Colonies region of the galaxy. It was a two day flight from Ranklinge, another planet in the sector. Drunost was home to one of the largest hubs of Consolidated Shipping, a transport business, as well as many corporate offices. The hub, located near Drunost's main settlement, Conso City, made the planet a popular stop for fueling and supplies. While Drunost's terrain included rivers and woods, the land was mainly used for farming and mining, although the planet supported company towns as well."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Drunost was involved in the Clone Wars, and at one point, Jedi were stationed on the planet. Later, the world was able to distance itself from Imperial business, as the Shelsha sector was scarcely supervised by the Empire, having Imperial garrisons on only two planets and just one Star Destroyer stationed in the area. Consolidated Shipping served as the local authority, doing its best to maintain law and order."},{"type":"paragraph","text":"In 0.5 ABY, a supply of arms for the Rebel Alliance that was being transported by Porter and Casement, two agents working for the Rebellion, was targeted by a swoop gang affiliated with the BloodScar pirate group. However, a gang of former stormtroopers who had deserted from Imperial service and dubbed themselves the Hand of Judgment, protected them, not knowing that in doing so they were helping the Rebel Alliance. Han Solo and Chewbacca, along with Luke Skywalker, were sent as representatives of the Alliance in order to meet with Porter after the incident. They met at a tapcafe on Drunost across the street from Consolidated Shipping's Repository and Currency Exchange. A group of three BloodScars were present at the café, watching a group of off-duty military personnel, as the pirate group had planned to rob the repository; this was in fact a cover for them to pick up the BloodScar swoop gang survivors held in custody. When the break-in began, the three BloodScars held the soldiers at bay with their blasters, until Skywalker, Solo, and Chewbacca intervened, killing one BloodScar and detaining the others. However, the robbery carried on, and the raiders made off with fifty thousand credits and their passengers."}],"images":[]},{"title":"Locations","level":2,"content":[{"type":"paragraph","text":"Drunost's main point of interest was the Consolidated Shipping hub and outlet, which was located northwest of its center of government, Conso City. From the air, the transport business's complex closely resembled the company's star-in-swirl logo. The hub was surrounded by a loose ring of several small permacrete landing areas that were used by freighters to pick up shipments and by people coming to purchase items directly from Consolidated's outlet center. The landing fields also had shopping areas from which travelers could buy food and supplies."},{"type":"paragraph","text":"The planet's major town, Conso City, was located on the edge of a river southeast of the hub. The medium-sized city was the main part of Consolidated's local operation, as Consolidated's repository, their main administrative offices, and the HoloNet center had been established there. Also, in the northern part of town, across the street from the repository, was a tapcafe, which served both Human and alien clientele."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Drunost was first created for Timothy Zahn's 2007 novel, Allegiance, and was later given an entry in The Complete Star Wars Encyclopedia in 2008. More information about the planet's location in the galaxy was provided by The Essential Atlas Online Companion, although the planet itself is not mentioned."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Allegiance","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Reader's Companion","elements":[]}]}],"images":[]}]}