{"sections":[{"title":"Halowan","level":1,"content":[{"type":"paragraph","text":"Halowan was a barren planet in the Fakir sector of the Bakchou arm. It was the location of Holowan Laboratories, the creators of the IG-series droids."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Sometime before 15 BBY, it was the site of the Holowan Massacre, in which the four IG-88 model assassin droids and one IG-72 murdered the entire complement of Project Phlutdroid personnel immediately after activation. They broke free of the lab and blasted away from the planet to begin their Droid Revolution."},{"type":"paragraph","text":"Halowan was also home to the trans-system data storage library, an information repository containing information on, among other things, star systems throughout the galaxy. After his service at Echo Base ended in 3 ABY, Alliance to Restore the Republic historian Voren Na'al visited the library, compiling a good deal of background information on the Hoth system and on the geography of Hoth for his records. Shortly after the Battle of Endor in 4 ABY, Na'al was dispatched to Halowan in order to infiltrate the Imperial data storage facilities and attempt to compile a report on the Imperial command structure at Endor. Na'al deceived Imperial security forces into allowing him access to restricted files by posing as a special agent of Fakir sector Moff Lorin. After one day of research, Na'al had finished his report and rejoined the Alliance Fleet."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20080803103140\/starwars\/images\/thumb\/0\/09\/IG-88_activated.JPG\/250px-IG-88_activated.JPG","caption":"The IG-88s massacre their creators."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places the Fakir Sector and, consequently, Halowan, in the Galactic Core."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Therefore I Am: The Tale of IG-88","elements":[]},{"text":"Star Wars: Rebellion","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 3: The Empire Strikes Back","elements":[]},{"text":"Galaxy Guide 5: Return of the Jedi","elements":[]},{"text":"The Movie Trilogy Sourcebook","elements":[]},{"text":"Galaxy Guide 5: Return of the Jedi, Second Edition","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Battle of Turak IV on Hyperspace","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Reader's Companion","elements":[]}]}],"images":[]}]}