{"sections":[{"title":"Palanhi","level":1,"content":[{"type":"paragraph","text":"Palanhi was a Colonies world that was located within the Fakir sector, situated on the Bakchou arm of the galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"More of Palanhi's surface area was dry land than ocean; underwater volcanoes constantly produced new islands, but the continents themselves were quite stable."},{"type":"paragraph","text":"During the Galactic Civil War it was home to an important central bank."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Palanhi joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY, although it was outside of Republic space at the time. During the Alsakan Conflicts, it supported Alsakan."},{"type":"paragraph","text":"Palanhi was the site of a battle won by the Republic during the Jedi Civil War."},{"type":"paragraph","text":"The planet didn't secede during the Clone Wars. Late in the war, the planet was heavily contested until a Separatist victory was achieved due to the use of Scorpenek annihilator droids in combat."},{"type":"paragraph","text":"The planet joined the New Republic sometime between 6 ABY and 7 ABY. It was a New Republic stronghold during the Zsinj campaign but was lost during the Thrawn campaign, in 9 ABY. During the campaign, New Republic Admiral Ackbar was arrested after Imperial technicians transfered a large sum of money into Ackbar's account. Later back under New Republic control, Palanhi was conquered before Operation Shadow Hand by the Imperial\/Pentastar Alignment forces, in 10 ABY.Grand Moff Ardus Kaine was killed over the planet shortly after, when his shuttle was ambushed by several New Republic E-wing fighters."},{"type":"paragraph","text":"Palanhi was invaded during the Yuuzhan Vong War. The planet was later part of Darth Krayt's Galactic Empire."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places the Fakir sector and, consequently, Palanhi, in the Galactic Core."},{"type":"paragraph","text":"Star Wars: Rebellion: Prima's Official Strategy Guide misspells the planet as \"Palanini.\""}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Rebellion","elements":[]},{"text":"Dark Force Rising","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Dark Force Rising Sourcebook","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":" \"The Imperial Warlords: Despoilers of an Empire, Part 1,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}