{"sections":[{"title":"Giju","level":1,"content":[{"type":"paragraph","text":"Giju was the Herglic homeworld. Located in the Colonies, it was on the Rimma Trade Route and was one endpoint of the Giju Run. Giju was an aquatic-type world with large bodies of water and associated terrain including: expansive oceans, islands, marshes, and glaciers. Giju had many spaceports and manufacturing centers."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Herglic developed hyperdrive around 27,500 BBY and colonized many nearby planets in what became Herglic Space, establishing the Herglic Trade Empire. The Trade Empire joined the Republic around 13,000 BBY, and in 12,720 BBY, the Herglic established contact with the Human colonists of nearby Tapani sector."},{"type":"paragraph","text":"Sha Koon fought on the world during the Battle of Giju during the Clone Wars."},{"type":"paragraph","text":"Giju suffered under the rule of the Galactic Empire, its manufacturing centers and spaceports among the first to be commandeered by Emperor Palpatine's New Order. The Herglics attempted to resist, but the one-sided slaughter that ensued convinced them to submit to the will of the Empire with their infrastructure still intact. Herglic Space was then granted nominal status as an Allied Region, and although they were denied the rights given to Humans, the Herglics were able to live comfortably as they labored to supply the Imperial war machine. When the Empire abandoned Giju, the Herglics were able to resume their role in galactic trade with relative ease."},{"type":"paragraph","text":"Following the Battle of Endor and the establishment of the New Republic, Giju quickly joined the new galactic government."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060415144345\/starwars\/images\/thumb\/2\/27\/Narloch1.jpg\/150px-Narloch1.jpg","caption":"A Herglic."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Outbound Flight","elements":[]},{"text":"Star Wars: Purge: Seconds to Die","elements":[]},{"text":" \"Elusive\"—No Disintegrations","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Dark Force Rising Sourcebook","elements":[]},{"text":"Lords of the Expanse","elements":[]},{"text":"Shadows of the Empire Planets Guide","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Galaxy of Intrigue","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]}]}