{"sections":[{"title":"Talasea","level":1,"content":[{"type":"paragraph","text":"The fourth planet in the Morobe system, Talasea orbited the yellow primary star in a red\/yellow binary group. A cool, moist, forested, and fog-shrouded world, Talasea had a higher gravity than standard and was lashed by severe thunderstorms during the rainy season. Island continents made up its land masses. Animal life included native insects and reptiles, along with feral mammals descended from those brought for an early farming colony, including banthas and rycrits. Indigenous plant life included green ivy, tendril-moss, and the kaha tree."},{"type":"paragraph","text":"Colonized long ago, most of the settlers' descendants left over the years, and the last group of them were wiped out by Darth Vader after the Clone Wars for harboring a fugitive Jedi."},{"type":"paragraph","text":"Some three years after the Battle of Endor, Rogue Squadron was moved from Folor to Talasea, closer to the Galactic Core, as a staging area for their eventual move on Coruscant. They made their base on the largest of the island continents, inhabiting the ruins of Talasea's Planetary Governor's Palace and the surrounding ivy-covered cottages. The Palace's primitive Grand Room was built of heavy native wood and thick plaster. After Imperial Intelligence agent Kirtan Loor deduced the location of Rogue Squadron's new headquarters, Admiral Devlia ordered a platoon of stormtroopers to secretly infiltrate the base and plant explosives. Though the squadron lost six sentries and pilot Lujayne Forge, all of the Imperial commandos were captured or killed. The Alliance immediately evacuated the base, leaving behind several booby traps for any Imperial follow-up teams to discover."},{"type":"paragraph","text":"A year later, a larger New Republic base was established at Talasea, and the recently compromised Project Morrt was manipulated to set up a trap there for one of Warlord Zsinj's Star Destroyers. The Star Destroyer Implacable escaped, but its escorts Provocateur and Constrictor were defeated in the Battle of Talasea."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Jedi Trial","elements":[]},{"text":"X-Wing: Rogue Squadron","elements":[]},{"text":"X-Wing: Wedge's Gamble","elements":[]},{"text":"X-Wing: The Bacta War","elements":[]},{"text":"X-Wing: Wraith Squadron","elements":[]},{"text":"I, Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"The Official Star Wars Fact File 14","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" Bantha in the Databank","elements":[]}]}],"images":[]}]}