{"sections":[{"title":"Byblos","level":1,"content":[{"type":"paragraph","text":"Byblos was a planet in the Colonies."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Byblos was the headquarters of Byblos Drive Yards, and some other important technology brands maintained corporate towers there. It was a densely populated manufacturing center for high technology and military items. The natives built huge city towers, some of which had 5,000 levels or more. BlasTech, SoroSuub, and Sienar Fleet Systems all maintained corporate towers on Byblos."},{"type":"paragraph","text":"The average day lasted 38 standard hours and the year 402 local days."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Like its neighbor Loronar, Byblos was colonized by Corellian settlers before the founding of the Galactic Republic. Both worlds later declared their independence from Corellia."},{"type":"paragraph","text":"Byblos joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY. During the Alsakan Conflicts, it supported Coruscant."},{"type":"paragraph","text":"The planet did not secede during the Clone Wars. During the war, a battle occurred on Byblos, in which ARC troopers managed to get behind Separatist lines by hijacking a SRT droid."},{"type":"paragraph","text":"By 4 ABY, the planet had become an Imperial fortress world."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":" \"All the Extras\"—Shadows of the Empire Sourcebook","elements":[]},{"text":" \"Dead End Drop\"—Shadows of the Empire Sourcebook","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Platt's Starport Guide","elements":[]},{"text":" Star Wars Customizable Card Game – Premiere Limited","elements":[]},{"text":"Star Wars Adventure Journal 9","elements":[]},{"text":"No Disintegrations","elements":[]},{"text":"\"The Great Herdship Heist\"—Star Wars Adventure Journal 15","elements":[]},{"text":"Shadows of the Empire Sourcebook","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"Tinker, Tailor, Soldier, Praji","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Galaxy of Intrigue","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"The Bounty Hunter Code: From the Files of Boba Fett","elements":[]},{"text":" \"Star Wars: The Essential Guide to Warfare: Author's Cut, Part 8: Tales of the Clone Wars,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}