{"sections":[{"title":"Mrisst","level":1,"content":[{"type":"paragraph","text":"Mrisst was a mid-sized planet in the Fakir sector of the Colonies. It had a mild climate, and its four continents were dotted with small lakes and rivers. Jungle made up the majority of the terrain, consisting of spinetrees, spirepines, and a variety of other flora. It was the homeworld of the Mrissi."},{"type":"paragraph","text":"The planet boasted many cultures, but had yet to develop three dimensional art when first contacted by the Old Republic."},{"type":"paragraph","text":"Mrisst became a center of higher learning for many underprivileged youths galaxywide; its Mrisst Trade and Science Academy, while not as prestigious as other universities, was an effective learning institution."},{"type":"paragraph","text":"Mrisst was recaptured by Grand Admiral Thrawn, who used it as a staging area for his final assaults leading up to his surprising attack on Coruscant. Years later, the New Republic used Mrisst as a staging area for an attack on Yaga Minor."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places the Fakir sector and, consequently, Mrisst, in the Galactic Core."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Rebellion","elements":[]},{"text":"X-Wing: Wedge's Gamble","elements":[]},{"text":"The Last Command","elements":[]},{"text":"The Last Command (comics)","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Thrawn Trilogy Sourcebook","elements":[]},{"text":"The Essential Guide to Vehicles and Vessels","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]}]}