{"sections":[{"title":"Sif-Uwana","level":1,"content":[{"type":"paragraph","text":"Sif-Uwana was a planet within the Colonies area of the galaxy. It was the homeworld of the individuals known as Sif-Uwani and was administered by the Sif-Uwana Council. The planet was controlled by Alsakan during the Alsakan Conflicts but was eventually lost to the Galactic Republic. At some point, the Emperor's agent Mara Jade visited the world."}],"images":[]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Sif-Uwana was a planet of the Sif-Uwana system, within the Colonies region of the galaxy. The individuals native to Sif-Uwana were called the Sif-Uwani, known for their casual way to approach money and management. The world was ruled by the Sif-Uwana Council, an organization composed only of Sif-Uwani."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Eventually falling within the Northern Dependencies, Sif-Uwana was under Alsakan control during the Alsakan Conflicts, but a few hundred years after the Fifth Alsakan Conflicts ended, the world fell within the Alsakan's opponents' grip, namely the Galactic Republic's."},{"type":"paragraph","text":"By 0 BBY, the thief Kels Turkhorn, had acquired a certified Sif-Uwana credit voucher. At some point, the Emperor's Hand Mara Jade, traveled to the planet for business reasons, under the orders of Emperor Palpatine, the leader of the dominant galactic government, the Galactic Empire, which also controlled the territory Sif-Uwana fell in. Around 6 ABY, the smuggler Talon Karrde posed as a Sif-Uwani chief purchasing agent of the Sif-Uwani Council, during diplomatic negatiations on the world Kaal, claiming that the Sif-Uwani Council wished to set up their own harvesting operations on the Unis Islands.Two years later, Karrde would pose again as the Sif-Uwani agent, during an investigation on the planet Varonat."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Sif-Uwana was first mentioned in the 1994 Timothy Zahn's First Contact, a short story published within Star Wars Adventure Journal 1. Three years later, the world was mentioned within the Star Wars Adventure Journal 15, more specifically in the The Great Herdship Heist, a short story written by Daniel Wallace. It would then receive an entry in the 1998 Star Wars Encyclopedia, and another entry within the 2008 The Complete Star Wars Encyclopedia. One year later, the planet was mentioned in The Essential Atlas, an Essential Guide written by Jason Fry and Daniel Wallace. In 2012, Sif-Uwana was mentioned in the The Essential Guide to Warfare, another Essential Guide, written by Jason Fry and Paul R. Urquhart."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"The Great Herdship Heist\"—Star Wars Adventure Journal 15","elements":[]},{"text":"\"First Contact\"—Star Wars Adventure Journal 1","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. III ","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]}]}