{"sections":[{"title":"Berrun","level":1,"content":[{"type":"paragraph","text":"Berrun was a planet located within the Colonies region of the galaxy that was the site of a Galactic Republic detention center during the Cold War with the Sith Empire. Thousands of years later, Berrun served as the host of the sporting event known as the Galactic Games in 33 BBY."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"The planet Berrun was located in the Berrun system, a star system that was situated in the Colonies region of the galaxy, relatively close to the Core Worlds."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"As early as 22,000 BBY, Berrun fell within the expanse of the Galactic Republic, and by the time of the Cold War between the Republic and the Sith Empire, the Republic maintained a detention facility on the planet. After being convicted of war crimes as a result of targeting the families of their Imperial targets, the members of the Republic Special Forces squad known as the Surgeons served out their life sentences in the prison. In 33 BBY, Berrun hosted the Galactic Games, a sporting event that was held every seven years on a different planet. The Euceron athlete Maxo Vista won five events at the Games on Berrun, earning him galactic fame."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Berrun was first mentioned in the young readers novel Jedi Quest: The Dangerous Games, published in 2002, though no other information was given in any other source until The Essential Atlas placed the Berrun system in the Colonies, within the grid square M-10.Sergeant Fideltin Rusk, a companion character for the Jedi Knight class in the video game Star Wars: The Old Republic, mentions Berrun in the optional conversation \"The Surgeons,\" in which he has investigated the fates of his old squadmates."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Jedi Quest: The Dangerous Games","elements":[]}]}],"images":[]}]}