{"sections":[{"title":"Aquilae","level":1,"content":[{"type":"paragraph","text":"Aquilae was an ancient Duros colony located along the Hydian Way in the Colonies region."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Aquilae joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY. The planet was discovered and colonized by the Duros,"}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Han Solo's brief reference to Aquilae in Star Wars 7: New Planets, New Perils! suggests it is on the far side of the galaxy from Aduba-3."},{"type":"paragraph","text":"Aquilae was one of the first planet-names seen in the early drafts of Star Wars: Episode IV A New Hope, dating back to the first story treatment. In the shooting script, Luke Skywalker still referenced Aquilae, along with the planet Sullust, but this line was eventually cut out of the final movie."},{"type":"paragraph","text":"In the first story treatment, Aquilae, which is the Latin plural or genitive of aquila, or \"eagle\", was a blue-green terrestrial planet threatened by a space fortress (later to become the Death Star). It contained the starport Gordon, and is the home of an anonymous princess."},{"type":"paragraph","text":"In the rough draft, the princess was first named Leia, and was the daughter of King Kayos. She succeeds to the throne of Aquilae at the conclusion of the script. It was home planet of Kane Starkiller and his sons Deak and Annikin Starkiller. The planet was renamed Townowi in the first draft; by the second draft it only appears as in the name of the Aquillian Rangers."},{"type":"paragraph","text":"Neva Kee came from Aquilae in the revised first draft of Star Wars: Episode I The Phantom Menace; this was later changed to Xagobah."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Episode IV A New Hope","elements":[]},{"text":"Star Wars 7: New Planets, New Perils!","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Annotated Screenplays","elements":[]},{"text":"The Making of Star Wars: The Definitive Story Behind the Original Film","elements":[]},{"text":" \"The University of Sanbra Guide to Intelligent Life: The Duros\"—Star Wars Gamer 2","elements":[]},{"text":"Star Wars: Episode I Insider's Guide","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Aquila (constellation) on Wikipedia","elements":[]}]}],"images":[]}]}