{"sections":[{"title":"Ord Antalaha","level":1,"content":[{"type":"paragraph","text":"Ord Antalaha was a planet located along the Shwuy Exchange, in the Colonies region of the galaxy, that was colonized and established as an Ordnance\/Regional Depot by the Galactic Republic during the Clone Wars. As a military outpost, Ord Antalaha was primarily used for storage and recreational purposes, prompting the construction of thousands of warehouses across the planet. After the Clone Wars, all military forces abandoned the planet, leaving the civilian colonists as the planet's only inhabitants. The colonist population, however, quickly declined over the years and Ord Antalaha soon became a regular stopover and haven for pirates, smugglers, and other space-faring criminals."},{"type":"paragraph","text":"This new wave of fringe elements soon inhabited Ord Antalaha's unoccupied warehouses, arming and barricading them into impenetrable fortresses referred to as \"Resorts.\" The colonists, despite the arrival of their new neighbors, continued living their lives in peace as simple farmers. In fact, the majority of Ord Antalaha's criminal population found it wise to prevent the harassment of the colonists for fear of attracting unwanted Imperial attention. Though no formal government ruled over the planet after the Clone Wars, the collective fringe presence on the world operated under a code consisting of three fundamental rules. Ord Antalaha's sole starport was Fort Divin, a center of black marketeering and smuggling."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Ord Antalaha was a planet in the Ord Antalaha system located along the Shwuy Exchange, a minor trade route in the Colonies region connecting the Shwuy and Fakir sectors. While Ord Antalaha was remote, the fact that it accessed a minor trade route meant that starships could use it as a stopover on their way to the two major routes toward either end of the Exchange: the Hydian Way and the Namadii Corridor."},{"type":"paragraph","text":"A pleasant world with a temperate climate and a breathable atmosphere, Ord Antalaha was covered in a mix of forests and plains spread out across its three continents. Originally colonized by the Galactic Republic as an Ordnance\/Regional Depot, the planet later became a haven for pirates, smugglers, and other fringe elements. After its abandonment by the Republic, Ord Antalaha was ruled by no individual government, although local fiefdoms arose across the planet. The planet's major industries included farming and illegal ship services, and planetary trade mainly dealt in stolen goods and plunder. The only starport located on the planet was Fort Divin."},{"type":"paragraph","text":"The Rebel Alliance SecuriDex directory identified Ord Antalaha as only a moderate threat to Alliance personnel and considered the world to be strategically located. It was also recommended as a temporary refuge or the site of a supply exchange base for Alliance operatives."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Ord Antalaha was colonized by the Galactic Republic as an Ordnance\/Regional Depot sometime before the Pius Dea Era, and was initially used as a storage facility and recreational zone for wounded soldiers due to its convenient location along the Shwuy Exchange. All over the planet, thousands of warehouses were constructed and clustered by the dozen. These warehouses were eventually evenly relocated across the planet and lightly armored to slow potential orbital bombardment by enemy forces. A small hospital and resort was also constructed for the benefit recovering soldiers. Over the course of the war, Ord Antalaha remained nearly undisturbed; it was the site of several staging actions but no actual battles took place there. After the Clone Wars, the military bases and warehouses were downgraded and eventually abandoned, but the colony remained and subsisted on light trade and agriculture."},{"type":"paragraph","text":"The colony's population began to rapidly decline in the years following the Clone Wars until there was virtually no colony left, and the few remaining colonists moved elsewhere around the planet. Ord Antalaha eluded the attention of the newly-established Galactic Empire, but soon became a regular stop for pirates and smugglers. The world's small existing population allowed for criminals to conduct their private business without local or Imperial interference, and as word spread among the underworld, the abandoned assortment of defensible warehouses and staging facilities were repaired and reinhabited, serving as bases for various pirate and smuggling groups. The colonists continued living as they did before the arrival of fringe elements, and were left undisturbed by their new neighbors."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100608005658\/starwars\/images\/thumb\/8\/88\/OrdAntalahaFarms.jpg\/300px-OrdAntalahaFarms.jpg","caption":"Much of Ord Antalaha's colonist population continued living in peace as farmers after the end of the Clone Wars."}]},{"title":"Inhabitants","level":2,"content":[{"type":"paragraph","text":"After the Clone Wars, Ord Antalaha was home to a light, scattered population of colonists and criminals, both Human and otherwise. The planet was known to have one of the highest criminal-to-citizen ratios in the galaxy. Between approximately 2 BBY and 4 ABY, Ord Antalaha's inhabitants were thought to have numbered around 150,000, although the accuracy of this number was in question. By circa 25 ABY, the average inhabited world on the Shwuy Exchange had a population between 100 million and 500 million."}],"images":[]},{"title":"Colonists","level":3,"content":[{"type":"paragraph","text":"Most of Ord Antalaha's colonist population was based five kilometers away from the Fort Divin starport and located within the planet's warm forests and hot plains. After all military forces abandoned the planet in the aftermath of the Clone Wars, the colonists left their original dwellings but continued living their lives in relative peace, although their numbers rapidly dwindled over the years. Many colonists lived as simple farmers and sustained themselves through agriculture in the absence of Republic support. Virtually nothing changed in their lifestyle after the arrival of pirates and other criminals; aside from the occasional low-flying pirate ship, their territory remained peaceful and quiet. Although they did not particularly enjoy living near such rough individuals, the colonists found their criminal neighbors tolerable. Spread out across the planet were roughly two thousand occupied warehouses, collectives, farms, homesteads, ranches, and villages, each with colonist populations ranging from one to one thousand. Wherever possible, the colonists attempted to move into the abandoned Republic facilities, but many simply used prefabricated buildings when warehouses were not available."}],"images":[]},{"title":"Criminals","level":3,"content":[{"type":"paragraph","text":"Criminal elements, such as pirates and smugglers, were originally drawn to Ord Antalaha due to the planet's relative obscurity and convenient location along the Shwuy Exchange. Since the planet had a very tiny colonist population and was entirely overlooked by the Empire, criminals could go about their business without conflict."},{"type":"paragraph","text":"Though no actual government existed after the Republic abandonment, a local code was developed among the criminals to govern the various fringe elements on the planet. The code consisted of three basic rules, the first one being \"Antalaha is a neutral zone.\" Feuds between criminal groups were prohibited on the planet; pirate captains and mercenary units often clashed in space, but any conflict between them was to be suspended upon reaching the surface of Ord Antalaha. Personal duels and cantina brawls were permitted, but any organized aggression was met with harsh punishment by the rest of the planet's criminal denizens. The second rule was \"Leave the colonists alone.\" Many felt that allowing the colonists to live in peace would keep unwanted attention away from their safe haven. Most were concerned that outraged farmers could attract Imperial interest, which they felt would end in disaster for everyone. Some pirates and mercenaries took this idea to an extreme and believed that it was their duty to protect the colonists from crime lords and gangsters. Though the colonists often felt overprotected, most of them preferred having the criminals occupy the planet rather than the Imperials. The final rule enforced by the fringe elements of Ord Antalaha was \"You only get one chance.\" Overly disruptive individuals were given one warning by the planet's older criminal denizens; no second failures were tolerated and repeat offenders were sometimes known to go missing."},{"type":"paragraph","text":"Many criminals made their homes in the warehouses abandoned by the Republic. About one thousand warehouse clusters, consisting of one to ten warehouses each, were spread across the planet, each varying in size and design. Roughly five hundred of these were occupied by the various raider, slaver, smuggler, and mercenary groups drawn to the planet. These inhabited clusters were often referred to as \"Resorts\" by the colonists. Each Resort had at least one large warehouse, usually subdivided into quarters and run by a support staff, and a landing field large enough for a light freighter. Additionally, many Resorts had at least a single hangar and some criminal groups even installed light space defense blasters in case of attack. A few group leaders were paranoid enough to move periodically; others set up their Resorts in such a fashion that evacuation could be achieved at a moment's notice. Not all groups transformed their Resorts into impenetrable fortresses: others turned their claimed structures into simple settlements or miniature courts."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100608005655\/starwars\/images\/thumb\/1\/14\/FortDivin.jpg\/300px-FortDivin.jpg","caption":"Criminals at Fort Divin, Ord Antalaha's only starport"}]},{"title":"Locations","level":2,"content":[],"images":[]},{"title":"Fort Divin","level":3,"content":[{"type":"paragraph","text":"Ord Antalaha's sole starport, Fort Divin was named after Divin, the first lieutenant to command the planet's military depot after its initial colonization. After the arrival of off-world criminals, the starport began to receive a good deal of illegal traffic. Smuggling eventually became a secondary industry on the planet and a large number of black marketeers began to trade with the local pirates for their plunder. Fort Divin was the site of a fair amount of illicit dealing and backstabbing, but it was not considered much more dangerous than most seedy starports. Transponder forgeries and ship modifications were among the starport's many illegal offerings, but the port's facilities were unable to service any ships larger than a CR90 corvette and mainly dealt with converted freighters and patrol vessels. Fort Divin had a thriving used starship market, although ships were sold stripped so that weapons and other extras had to be added on later, at a small profit to the starship fitters."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Ord Antalaha was first detailed in Pirates & Privateers by Timothy S. O'Brien, a supplement to Star Wars: The Roleplaying Game published by West End Games in 1997. In 2008 it received an entry in the multi-author work The Complete Star Wars Encyclopedia and in 2009 it was referenced in The Essential Atlas by Daniel Wallace and Jason Fry."},{"type":"paragraph","text":"Pirates & Privateers states that fringe elements did not discover Ord Antalaha until \"roughly ten years before Palpatine's ascension to the throne.\" However, since the rest of the book indicates that the criminals only occupied the planet when it was abandoned after the Clone Wars, this is likely a mistake. This is further reinforced by the planet's entry in The Complete Star Wars Encyclopedia, which indicates that the planet was discovered by pirates after the Clone Wars."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Pirates & Privateers","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]}]}