{"sections":[{"title":"Castell","level":1,"content":[{"type":"paragraph","text":"Castell was a terrestrial planet located along the Perlemian Trade Route in the Colonies region of the galaxy. The homeworld of the Gossam, Castell was a major foundry planet for the Commerce Guild."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"A terrestrial world located along the Perlemian Trade Route, the Gossam homeworld was reached by other sentient species during the blazing of that route between 30,000 BBY and 25,000 BBY. Having begun experimentation with the tumble hyperdrive during the Infinite Empire's reign over parts of the galaxy, the Gossam Courivers were able to leave Castell and colonize planets such as Felucia circa 27,000 BBY. When the Galactic Republic was born out of the Core Worlds, Castell joined the rapidly expanding government sometime before 22,000 BBY."},{"type":"paragraph","text":"Involvement in galactic history was rare for Castell, remaining within Republic space even during times of conflict. During the Great Sith War, the Krath waged a Holy Crusade along the worlds of the Perlemian in their attempt to conquer Coruscant. Recovering from the war, the Republic would race along the Perlemian and its worlds during the Jedi Civil War to engage the armies of Revan's Sith Empire."},{"type":"paragraph","text":"During the latter half of the Republic's Golden Age Castell fell into a decades-long depression, only to find an ally in the Commerce Guild. Upon the Guild's intervention, the war and slaughter brought about by starvation and economic crisis ended abruptly as the Guild swept in and funneled money into the economy by buying much of the world. In exchange, many Gossams worked as indentured servants for a portion of their life in order to maintain ownership of their property. One such Gossam was the young, corporate-minded Shu Mai, who rose through the corporate world to become Chief of Property Resources. As Mai became more and more prolific in her career, she managed to repurchase the entire planet from the Commerce Guild and lead her people to prosper. In return for her work, Mai raised rents on the world and demanded that her people give her tribute in thanks for gaining back the planet's independence from the Guild."},{"type":"paragraph","text":"True independence never came, however, as Mai was named Presidente of the Commerce Guild and Castell remained one of its largest powerhouses. Mai would eventually lead her people away from the Republic during the Separatist Crisis, pledging the Commerce Guild's clandestine funding in exchange for a place on the governing Council of the Confederacy of Independent Systems. While creating an elite group of Gossam Commandos, Mai and the other Separatists incited the Clone Wars, a bloody war of separatism, against the Republic. As Castell was surrounded by Republic space, the region was patrolled by the 3rd Sector Army of the Grand Army of the Republic. Eventually Castell itself fell to Republic forces, much to Presidente Mai's dismay. Retreating to Felucia and denounced by her people, Mai was reassured by her superior, Count Dooku that the loss of her homeworld was all apart of his master plan."},{"type":"paragraph","text":"In 19 BBY, following Presidente Mai's execution along with the rest of the Separatist Council on Mustafar by Darth Vader, the war ended and the Galactic Empire arose from the ashes of the Republic. Because of their former allegiances, the Gossams of Castell were targeted by the Empire for enslavement, and the factories of the world were repurposed to manufacture military goods for the Imperial Navy. Undoing any of the meager good that Shu Mai and the Commerce Guild had managed to achieve, Castell spiraled back into economic turmoil under the Empire and was unable to supply many soldiers to the fledgling Rebel Alliance, though many expressed support for the group. When the Rebel Alliance eventually emerged victorious over the Empire, it took a year for the New Republic to move down the Perlemian, liberating Castell in 5 ABY. Struggling to recover despite their newfound independence, the world suffered greater setbacks during the Yuuzhan Vong invasion of the galaxy. Conquering Castell, the world was ravaged by the invaders until the New Republic forced itself down the Perlemian once again, from Dac to Coruscant. With the rise of the Galactic Alliance, Castell once more began the recovery process. As of 137 ABY, Castell fell within the area controlled by the Empire of Darth Krayt."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Evasive Action: Reversal of Fortune","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" \"Galactic Power Brokers\"—Star Wars Gamer 10","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Star Wars: Revenge of the Sith The Visual Dictionary","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 37","elements":[]},{"text":" Shu Mai in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"The Bounty Hunter Code: From the Files of Boba Fett","elements":[]}]}],"images":[]}]}