{"sections":[{"title":"Devaron","level":1,"content":[{"type":"paragraph","text":"Devaron was the home world of the Devaronians. It was located in the Colonies, near the Corellian Trade Spine. It was a planet of low mountains and deep valleys linked by thousands of rivers. The planet had strict capital punishment and a matriarchal government."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Devaron joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY. The world was located on the border of known space at the time."},{"type":"paragraph","text":"During the Jedi Civil War, the planet was the site of a battle won by the Republic."},{"type":"paragraph","text":"Only Devaronian females were allowed to participate in government. Devaron would be represented in the Galactic Senate jointly by Elsah'sai'Moro and Vien'sai'Malloc during the final days of the ancient democracy. However, in 22 BBY, Elsah was assassinated by Aurra Sing who had been hired by Vien, who was herself arrested (and presumably executed) for both her assassination attempt and her secret sponsoring of a Separatist base in the Blue Mountains. The planet, under President Aven'sai'Ulrahk, continued to support the Galactic Republic during the Clone Wars, and came under the sway of the Galactic Empire following the war's end."},{"type":"paragraph","text":"Around 22 BBY, bounty hunter Cad Bane attacked a Republic outpost on the planet in order to capture Jedi Master Bolla Ropal, who was the keeper of the Kyber memory crystal, which contained a list of Force-sensitive children in the Galaxy. Later, Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano arrived in the Star Destroyer Resolute in order to reclaim the holocron. During the battle, the Resolute later engaged Bane's Munificent-class star frigates. Bane managed to escape, but the bounty hunter fleet was destroyed."},{"type":"paragraph","text":"Later in the war, the Temple of Eedit on Devaron was attacked by Separatist forces. This battle was the first appearance of Count Dooku's new apprentice Savage Opress and where Jedi Halsey and his Padawan Knox died."},{"type":"paragraph","text":"Around 5 BBY, it was the site of an uprising against the Empire, which was put down by the Imperial-aligned Devaronian Army, led by Kardue'sai'Malloc, whom was thus called the \"Butcher of Montellian Serat\". To escape persecution, the Butcher fled to Tatooine and changed his name to Labria."},{"type":"paragraph","text":"In 19 ABY, Boba Fett captured Labria and took him to Devaron, where the Butcher was executed."},{"type":"paragraph","text":"The planet was denied membership in the New Republic due to its violent capital punishment. During the Yuuzhan Vong War, the planetary government of Devaron attempted to appease the Yuuzhan Vong by offering Jedi Knight Hivrekh'wao'Cheklev, who was able to escape."},{"type":"paragraph","text":"Some female Devaronians wished to join the Galactic Alliance and proposed a termination to feeding criminals to the quarra. However, they met with strong resistance from traditionalists."},{"type":"paragraph","text":"Darth Maladi, a member of both the One Sith and Darth Krayt's Galactic Empire, was from Devaron."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130522014719\/starwars\/images\/thumb\/3\/3c\/Jungle_of_Devaron.png\/250px-Jungle_of_Devaron.png","caption":"A jungle on Devaron."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Ultimate Alien Anthology erroneously states that Devaron is in the Expansion Region."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Knight Errant","elements":[]},{"text":"Jedi: Aayla Secura","elements":[]},{"text":"The Clone Wars: Act on Instinct","elements":[]},{"text":"Star Wars: The Clone Wars – \"Cargo of Doom\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"Monster\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"Witches of the Mist\"","elements":[]},{"text":"Yoda: Dark Rendezvous","elements":[]},{"text":"The Hutt Gambit","elements":[]},{"text":"Rebel Dawn","elements":[]},{"text":"Empire Blues: The Devaronian's Tale","elements":[]},{"text":"Winner Lose All","elements":[]},{"text":"Doctor Death: The Tale of Dr. Evazan and Ponda Baba","elements":[]},{"text":"The Last One Standing: The Tale of Boba Fett","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"Star Wars: Legacy 45: Monster, Part 3","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 1: A New Hope","elements":[]},{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Galaxy Guide 6: Tramp Freighters","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Star Wars Screen Entertainment","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Official Star Wars Fact File 140","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Starships of the Galaxy, Saga Edition","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Legacy Era Campaign Guide","elements":[]},{"text":"Star Wars: The Clone Wars: Visual Guide Ultimate Battles","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" The Clone Wars Episode Guide: Monster on StarWars.com","elements":[]},{"text":"The Journal of Master Gnost-Dural","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"Star Wars: Force Collection","elements":[]}]}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130522011532\/starwars\/images\/thumb\/9\/94\/Devaron_during_the_clone_wars.png\/180px-Devaron_during_the_clone_wars.png","caption":"Another view of Devaron"}]}]}