{"sections":[{"title":"Ghorman","level":1,"content":[{"type":"paragraph","text":"Ghorman was a planet in the Sern sector of the Colonies region. It was the site of the infamous Ghorman Massacre. Fang Zar had a residence on the planet."},{"type":"paragraph","text":"It lay on the Rimma Trade Route."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"A temperate planet, Ghorman was the site of the Ghorman Massacre, an early atrocity committed the Empire shortly after its formation. In 18 BBY, an anti-tax demonstration by the Ghorman citizens ended in tragedy when Wilhuff Tarkin purposefully landed his ship on top of the crowd of peaceful demonstrators, killing and injuring hundreds."},{"type":"paragraph","text":"The members of the former Delegation of 2000 were spurred by the Ghorman Massacre to begin plotting open rebellion against the Empire, plans which would culminate in the formal creation of the Alliance to Restore the Republic some seventeen years later. As a result of his action, Emperor Palpatine promoted Tarkin to the rank of Admiral."},{"type":"paragraph","text":"In the Imperial Senate, the planet was represented by Gebnerret Vibrion."},{"type":"paragraph","text":"An Imperial base was later established on Ghorman. An Imperial freighter convoy consisting of 3 BFF-1 bulk freighters called Century 1, Century 2, and Century 3 was en route to the new base and had already rendezvoused with a TIE Fighter escort when the Rebels deployed a Y-wing along with an R-22 Spearhead from Red Squadron to attack the convoy. The R-22 held off the attacking TIEs while the Y-wing destroyed the convoy. The loss of necessary supplies managed to delay the completion of the outpost for an entire year. The Rebels later recreated the mission as a simulation for training new pilots."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places Ghorman in the Sesswenna (sic) sector of the Core Worlds. The Seswenna sector is actually located in the Outer Rim."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: X-Wing","elements":[]},{"text":"The Farlander Papers","elements":[]},{"text":"Star Wars: Rebellion","elements":[]},{"text":"\"Do No Harm\"—Star Wars Adventure Journal 10","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Rebel Alliance Sourcebook","elements":[]},{"text":"X-Wing: The Official Strategy Guide","elements":[]},{"text":"Rebel Alliance Sourcebook, Second Edition","elements":[]},{"text":"Star Wars Technical Journal (Volume Three)","elements":[]},{"text":"\"Game Room: Launching a New Rebellion\"—Star Wars Galaxy Magazine 10","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Chronology","elements":[]},{"text":"Hero's Guide","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"\"Who's Who in the Delegation of 2000\"—Star Wars Insider 85","elements":[]},{"text":"Starships of the Galaxy, Saga Edition","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" Grand Moff Tarkin in the Databank","elements":[]},{"text":" Fang Zar in the Databank","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]}]}