{"sections":[{"title":"Hok","level":1,"content":[{"type":"paragraph","text":"Hok was a planet located in the Colonies. The planet was split into two sides. One side was the desert wasteland that looked like Tatooine, while the other half was surrounded by pure darkness. This area also had a rich supply of crystals on which the people mined and traded."},{"type":"paragraph","text":"It was established as a Gran colony in 1000 BBY during an expansion period. However, the emigrating colonists left a significant imbalance in Gran society on their homeworld of Kinyen. Feeling they were destroying too many families, and diluting the Gran race, the government reacted with isolationist policies and prohibited unauthorized emigration from Kinyen and limited offworlders to special alien quarters in their cities."},{"type":"paragraph","text":"This protected the Gran society, but it also isolated the Gran on Hok and Malastare who had begun to form strong bonds to their new homes. The Gran colonies continued independently, continuing the strong social bonds of Gran society but with loosened social codes. The looser social codes allowed for more corruption in the upper levels of colonial Gran society."},{"type":"paragraph","text":"The famed Gran Podracer pilot Mawhonic was a native of this world."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Episode I: The Phantom Menace novelization","elements":[]},{"text":"Podracing Tales","elements":[]},{"text":"The Clone Wars: Decide Your Destiny: Crisis on Coruscant","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Inside the Worlds of Star Wars: Episode I","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Force Unleashed Campaign Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" Mawhonic in the Databank","elements":[]},{"text":"The Official Star Wars Fact File (2013) Part 3","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":"Star Wars: Age of Rebellion Core Rulebook","elements":[]}]}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20140330232956\/starwars\/images\/thumb\/b\/bf\/Galactic_Map_-_ITWAOTC.png\/250px-Galactic_Map_-_ITWAOTC.png","caption":"Location map of Hok in the galaxy"}]}]}