{"sections":[{"title":"Dankayo","level":1,"content":[{"type":"paragraph","text":"Dankayo was a Colonies world on the Shwuy Exchange with a Alliance to Restore the Republic administrative base, known as Dankayo Base, that served three sectors for purposes of coordination and records. Part of the area within its purview was Ralltiir sector."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"During the Galactic Civil War, the Imperial Navy discovered the location of the base and ordered the Star Destroyers Avenger, Devastator, and Relentless to wipe it out. However, the Alliance learned of the impending assault."},{"type":"paragraph","text":"General Carlist Rieekan oversaw the Rebel withdrawal from the base. Only one operative, Agent ZNT-8, was left behind as an observer in the temporary safety of a deep-planet survival shelter."},{"type":"paragraph","text":"When the Imperial task force arrived, they bombarded the planet from orbit, in an assault that seems to have been a Base Delta Zero operation. The attack did far more than merely reducing the small Rebel fortress to wreckage, leaving Dankayo's surface thoroughly cratered, blasting dark clouds of dust into the sky, and even stripping away the atmosphere. Agent ZNT-8 later emerged to discover that the Rebel self-destruct charges had failed to detonate fully, and that key areas of the base remained intact."},{"type":"paragraph","text":"Imperial stormtrooper search-teams from the Imperial Armored Transport Elusive recovered several datapacks from the planet, containing the locations of safe worlds and the identities of contacts and undercover agents within the area served by Dankayo. Although Agent ZNT-8 warned the Alliance and attempted to stop the Imperials with the few resources available to him, the datapacks were dispatched aboard the Elusive for delivery to the Imperial Intelligence Operations Center on Coronar."},{"type":"paragraph","text":"General Rieekan sent a team of Rebel operatives to prevent the delivery of the datapacks. While the Rebel shuttle Bonderium attempted to intercept the Elusive, the Ugor Black Hole-class Salvage Dreadnought Captain's Pride and the Squib Momship Thrifty battled over rights to salvage the remains of the base. However, with the help of the Squibs, the Rebel crew of the Bonderium recovered the datapacks."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Imperial attack on Dankayo is often cited as an example of a Base Delta Zero operation, but the exact term is not used in Scavenger Hunt, and there is no evidence that the planet's crust was extensively melted. However, the Star Destroyers' instructions to \"reduce the tiny base to molten slag\" indicates that they received a formal order for a high-intensity bombardment, comparable to the parameters of a Base Delta Zero, and in the aftermath, the planetary surface is described as \"evenly cratered,\" there is a reference to the \"dense clouds of atomized topsoil\" being formed, and \"the last of the atmosphere\" is described as drifting away, implying that the assault had planet-wide effects. The description is confusing, though, since stormtroopers are later described scouring the wreckage of the Rebel base on the surface, although their ability to operate here can perhaps be explained by their armor's limited vacuum capability."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Scavenger Hunt","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 3: The Empire Strikes Back, Second Edition","elements":[]},{"text":"The Official Star Wars Fact File 121","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" General Carlist Rieekan in the Databank","elements":[]},{"text":"Star Wars: Imperial Handbook: A Commander's Guide","elements":[]}]}],"images":[]}]}