{"sections":[{"title":"Noquivzor","level":1,"content":[{"type":"paragraph","text":"Noquivzor was an aesthetically pleasing Colonies world which consisted mainly of rolling grassland and savannas of yellow and orange. It bore some similarities to the Bothan homeworld of Bothawui."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Noquivzor joined the Galactic Republic prior to the Indecta Era. During the Alsakan Conflicts, it supported Alsakan."},{"type":"paragraph","text":"It played a vital role in the preparations for the New Republic's assaults on Borleias and later on Coruscant."},{"type":"paragraph","text":"The New Republic Provisional Council met on this planet prior to the conquest of Coruscant at the behest of Councilor Borsk Fey'lya who was indulging in cheap political trickery. Rogue Squadron was officially based on the planet, but unofficially they were off scouting out Coruscant prior to the eventual conquest of the planet. The rumors were enough for Warlord Zsinj to turn up with the Iron Fist and flatten the base there as vengeance for the capture of Contruum's Pride and Vengeance Derra IV. General Edor Crespin was rumored to have been amongst the wounded in the attack. Mechanics Zraii and Koyi Komad escaped injury with the rest of Rogue Squadron's X-Wings."},{"type":"paragraph","text":"After the bombardment, Admiral Ackbar and Borsk Fey'lya agreed that the conquest of Coruscant needed to be hastened so the New Republic could immediately go after Zsinj and make him pay."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"X-Wing: Rogue Squadron","elements":[]},{"text":"X-Wing: Wedge's Gamble","elements":[]},{"text":"X-Wing: Iron Fist","elements":[]},{"text":"X-Wing: Solo Command","elements":[]},{"text":"I, Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Stock Ships","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":" \"The Star Wars Spy Game: SPIN Declassified,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}