{"sections":[{"title":"Arkania","level":1,"content":[{"type":"paragraph","text":"Arkania was the adopted homeworld of the Arkanian species. It was covered with tundra and rich in diamonds and other precious minerals, which the Arkanians mined to further their offworld connections and master their technology. Arkanian cities were designed to keep the cold out, and were mostly completely enclosed. Off-world visitors rarely had to deal with the frigid conditions of the planet."},{"type":"paragraph","text":"The population was thought to be slowly built up until there was a population boom at one time. Many citizens were miners."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"A harsh world of tundra and ice, Arkania was able to sustain life and civilization despite the harsh climate. Deep underground, the planet was filled with diamond stores considered extremely valuable by those on the surface, resulting in the excavation of extensive mines across the world."}],"images":[]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Early mining operations and the Sith Empire","level":3,"content":[{"type":"paragraph","text":"Discovered by scouts from the Galactic Republic sometime between 25,000 and 20,000 BBY, the frozen world of Arkania was home to a population of white-eyed humanoids called the Arkanians. Home to massive diamond stores, Arkania opened these hidden vaults to mining industries associated with the Republic. The rich gem mines on their planet led to its great development and the construction of elaborate trade cities on Arkania. This was the reason why Arkanian culture largely flourished as a result of off-world contact. They were well known throughout the galaxy for their extremely reclusive scientists and rumors soon abounded that these geneticists were not above experimentation on sentients. Indeed, one of their earliest known endeavors was the creation of the Quermian species from the Xexto around 17,000 BBY while the Republic was cutoff from the world by the tumultuous Alsakan Conflicts. Though they abandoned their clandestine experiments, fearing legal action from the Republic, the Quermians resurfaced millennium later."},{"type":"paragraph","text":"The ancient capital Adascopolis served as the home of The Adasca BioMechanical Corporation of Arkania, a corporation with a controlling interest in the planet and run by the House of Adasca. At this point in Arkania's history, the Sith Empire enveloped the plant in their iron-clad grip and established a massive library called Veeshas Tuwan circa 6900 BBY. Drawing Sith Lords from across the Empire, the library grew over the centuries as scientists would draw upon dark side magics to conduct their experiments. As the structure became so cavernous that no one could find what they were looking for; still Lords would practice their dark arts in hidden chambers far from the control of the Republic or the Jedi Order. The growth of the great library came to a fiery end at the conclusion of the Great Hyperspace War however. Following the exile of Sith Lord Naga Sadow, the Jedi Order learned of the library's location and deemed it a threat to the stability of the Order and the Republic. Dispatched by the Jedi High Council, a team of several Jedi Masters descended upon Arkania and destroyed Veeshas Tuwan, wiping out the Sith population and returning power to the Arkanians."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20080520080951\/starwars\/images\/thumb\/0\/03\/Arkania.JPG\/200px-Arkania.JPG","caption":"Arkania in 4000 BBY"}]},{"title":"Old Sith Wars","level":3,"content":[{"type":"paragraph","text":"By the time of the Great Sith War, the world was inhabited by not only pure-blood Arkanians, but genetically-engineered offshoots. Inhabiting cities constructed over large stretches of frozen wastes, the pure-blooded Arkanians held great contempt for the offshoots and sent them into ghettos. Despite the adversity faced by many offshoots, the Force-sensitive Arca Jeth, whose blood was mixed with the Sephi race, rose to great prominence in the Jedi Order and attained the rank of Jedi Master. As the High Council became concerned with the re-emergence of the Sith, Master Jeth was dispatched to his homeworld to ensure that it did not fall back into the hands of the Order's sworn enemies. Establishing a praxeum in the wilderness of the planet not far from a small city, Jeth cleansed the world of the remaining taint of the dark side and began training such famed Jedi as Ulic Qel-Droma, Cay Qel-Droma, and Tott Doneeta. Jeth fought in numerous campaigns ranging from the defeat of the Lorell Raiders, the Freedon Nadd Uprising and finally defending the Republic against the rise of the Krath cult."},{"type":"paragraph","text":"A generation after the end of the Great Sith War and Arca Jeth's death, Adascorp's leader, Lord Arkoh Adasca implemented Project Black Harvest as a means of gaining further power for himself. During this illegal project, scientists such as the offshoot Gorman Vandrayk were forced to study the fabled exogorths which floated dormant in space. As the Mandalorian Wars began to tear at the fabric of peace in the Republic, Adascorp's activities on Arkania began to crescendo as the young Adasca put his final plan in motion but was halted by through the intervention of the failed Jedi Padawan Zayne Carrick and his band of criminals and misfits. With the death of Adasca and the destruction of the Arkanian Legacy, Adascorp fell under the control of the Draay Trust, established by Jedi Master Lucien Draay."},{"type":"paragraph","text":"Despite Adasca's death, Adascorp did not disappear entirely. In the wake of the Great Galactic War, the corporation emerged to assist the Republic during the Cold War with the resurgent Sith Empire. Aiding the Republic Strategic Information Service in preparing a trap for the bounty hunter Grand Champion of the Mandalorian Great Hunt, members of Adascorp worked side by side with Jedi Master Juns Semos in preparing to capture the deadly and elusive warrior."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20101123212643\/starwars\/images\/thumb\/7\/7c\/Arca%27s_training_center.png\/200px-Arca%27s_training_center.png","caption":"Arca Jeth's praxeum on Arkania."}]},{"title":"The Arkanian Revolution","level":3,"content":[{"type":"paragraph","text":"Following the Cold War Arkania remained deeply in the fold of the Republic, despite the chaos and anarchy of the New Sith Wars, the planet did not return to the Sith thrall. As the Republic grew stronger, the Arkanian Dominion also grew in power on Arkania and experimentation expanded almost unfettered. Developing a reputation as a species made up entirely of mad scientists, Arkanian society was greatly threatened by the discovery of the experiments being conducted on the neighboring Yaka species. The culmination of the social outrage plaguing Arkania came to fruition in 50 BBY when a group of scientists known as the Arkanian Renegades attempted a coup against the Dominion in what came to be known as the Arkanian Revolution. Funded and supplied by Jabba the Hutt by smuggling weapons and ammunition from the planet Dreddon, these scientists designed cybernetic warriors to wage war against the Dominion and put an end to the lawlessness of the scientific engine on the planet. When the coup failed, a brutal civil war erupted on the planet and the Dominion was forced to call upon the Jedi Order for assistance in ending it. In response, the Jedi High Council dispatched Masters Mace Windu and Aqinos, the latter considered a rogue among the Order for the training of his so-called Iron Knights. Aided by the droid-Jedi, Master Windu was able to defeat the famed warrior Gorm the Dissolver in a savage duel. As the war ended, the Dominion remained in power and the Renegades were all executed leaving Jabba with a surplus of weapons. Gorm survived his duel with Windu and escaped execution, and the Jedi suffered minor losses. Returning to Coruscant, the Iron Knights were made High Marshals of the Republic by Supreme Chancellor Frix, while being excommunicated by the Jedi Order for their straying from the Jedi Code."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20150624035257\/starwars\/images\/thumb\/8\/82\/Arkania_mining_camp.jpg\/180px-Arkania_mining_camp.jpg","caption":"Former Arkanian mining camp as of 3963 BBY"}]},{"title":"Rise of the Empire","level":3,"content":[{"type":"paragraph","text":"As thoughts of rebellion dwindled, life on Arkania returned to normal and the diamond mines continued to flourish. Dejarik tournaments were held often on the planet and the Jedi Order saw an influx of students entering its academies. Staunch and vocal supporters of the Galactic Constitution within the Galactic Senate, the Arkanian senators strongly opposed the ideals of the Confederacy of Independent Systems during the Separatist Crisis. By this time, Arkania had largely directed its scientific resources to the cloning industry; establishing many large therapeutic cloning centers which specialized in generating replacement organs for those individuals suffering major afflictions."},{"type":"paragraph","text":"When the Clone Wars erupted between the Republic and the Confederacy, the Galactic Senate unveiled its Grand Army of the Republic, a clone army created from the facilities on Kamino. Disgusted by the Republic's use of the army, the respected Arkanian Jedi Knight Serifa Altunen forswore her oath to the Order and returned to her homeworld in an effort to keep Arkania neutral in the war. The High Council dispatched Jedi Obi-Wan Kenobi and Anakin Skywalker to bring her back, but Altunen could not be swayed as she believed she was being guided by the Force. Much to the dismay of the Arkanian government, the Senate eventually voted to halt all non-military cloning with Decree E49D139.41; despite initial fears, certain exemptions were made and Arkanian could continue to produce cloned technology with a license, but were prohibited from exporting it. The war never came to Arkania, due to strict patrols by the 3rd Sector Army, and Arkania remained unspoiled by battle."},{"type":"paragraph","text":"Suffering economically from the cloning ban, despite provisions for it to continue on their world, Arkania had no choice but to submit to the Galactic Empire when it rose from the ashes of the Republic at the end of the war. While the Arkanian Dominion played no role in the Galactic Civil War, some members of the species joined the Empire in secret laboratories of Grand Moff Wilhuff Tarkin and Grand Admiral Demetrius Zaarin helping develop bioweapons for the Imperial military machine. When the Empire collapsed, the Arkanians refrained from joining the New Republic due to fear of major, stricter sanctions on their scientific fields. Despite their stance against the Republic, Arkanians did work with the fledgling to wipe out stone mites after the pests destroyed an Arkanian colony in 24 ABY. In the ensuing years, the galaxy was invaded by the Yuuzhan Vong, a species of aliens who declared war on the civilized galaxy. In 27 ABY a fierce battle was fought over Arkania, with the alien invaders ultimately capturing and occupying the world."},{"type":"paragraph","text":"Upon the defeat of the Yuuzhan Vong in 29 ABY, Arkania was eventually liberated and joined the Galactic Alliance in order to ensure their recovery. As of 127 ABY, Arkania was under the control of Darth Krayt's Galactic Empire."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20090509004953\/starwars\/images\/thumb\/5\/56\/Arkania_surface.jpg\/200px-Arkania_surface.jpg","caption":"The frigid surface of Arkania"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places Arkania in the Glythe sector of the Mid Rim."}],"images":[]}]}