{"sections":[{"title":"Commenor","level":1,"content":[{"type":"paragraph","text":"Commenor was a planet in the Commenor system of the Colonies, just outside of the Core Worlds."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Commenor began as a colony of Humbarine. Due to slow interstellar travel and communications, it was one of several colony worlds that declared their independence. The planet joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY."},{"type":"paragraph","text":"A trading outpost and spaceport, Commenor was considered as prestigious as the Core planets. It was known for its chrysopaz gemstones and local brandy."},{"type":"paragraph","text":"During the Mandalorian Wars, the planet was attacked by the Mandalorian Neo-Crusaders, as part of the Mandalorian Triumph campaign. Between 3959 BBY to 3956 BBY, during the Jedi Civil War, a battle was fought here against the Sith which the Republic had won."},{"type":"paragraph","text":"In 44 BBY, Commenor contributed ships and crew to Senator Ranulph Tarkin's paramilitary force."},{"type":"paragraph","text":"Shortly before the Clone Wars, Senator Padmé Amidala spoke at the University of Commenor against the Military Creation Act. The planet remained loyal to the Galactic Republic during the Clone Wars, and was attacked by the Confederacy of Independent Systems. Native Jan Dodonna was one of the first Star Destroyer captains. Following the Declaration of a New Order, there were a number of anti-Imperial protests across the planet."},{"type":"paragraph","text":"After the Battle of Endor, Commenor declared its independence from the Empire, but still maintained trade relations with them, as well as the New Republic and the independent warlords. They did not join the New Republic until after the defeat of Grand Admiral Thrawn. Tavion Axmis acquired the Scepter of Ragnos from a merchant on Commenor in 14 ABY. Fyor Rodan served in the New Republic Senate during the Yuuzhan Vong War, during which time the Yuuzhan Vong conquered the world. Commenor was later liberated from the Vong by Boba Fett's Mandalorian Supercommandos at the end of the war."},{"type":"paragraph","text":"In 40 ABY, Commenor became allied with Corellia in the Second Galactic Civil War. By that time, Fyor Rodan was its Prime Minister. Matric Klauskin served it as an admiral. It sent a fleet to repulse the Blockade of Corellia. Later, at the height of the war, Commenor contributed a fleet of Star Destroyers equipped with new turbolaser technology to the Confederation war effort."},{"type":"paragraph","text":"It later came under attack. During the attack, the Galactic Alliance Third Fleet launched an asteroid at the planet, and the Commenorians were unable to keep it from colliding with their homeworld."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20081205041737\/starwars\/images\/thumb\/0\/0e\/Commenor.JPG\/220px-Commenor.JPG","caption":"Commenor with space traffic"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places Commenor in the Corellian sector of the Galactic Core."},{"type":"paragraph","text":"Ironically, despite the world's high status and wealth, Commenor's name can be rearranged to spell \"commoner\"."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"A Guide to the Star Wars Universe","elements":[]},{"text":"Wanted by Cracken","elements":[]},{"text":"Star Wars: Rebellion: Prima's Official Strategy Guide","elements":[]},{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"The New Essential Guide to Characters","elements":[]},{"text":"The Official Star Wars Fact File 14","elements":[]},{"text":"\"Who's Who in Rogue Squadron\"—Star Wars Insider 59","elements":[]},{"text":"The Official Star Wars Fact File 24","elements":[]},{"text":"The Official Star Wars Fact File 88","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"\"Jawa's Corner\"—Star Wars Insider 95","elements":[]},{"text":"The Force Unleashed Campaign Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Rebellion Era Campaign Guide","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":" \"Star Wars: The Essential Guide to Warfare: Author's Cut, Part 8: Tales of the Clone Wars,\" The Official Star Wars Blog","elements":[]},{"text":"Star Wars: Imperial Handbook: A Commander's Guide","elements":[]}]}],"images":[]}]}