{"sections":[{"title":"Colonies","level":1,"content":[{"type":"paragraph","text":"The Colonies, also known as the Colonies Regions, was the name given to a region of the galaxy between the Core Worlds and the Inner Rim. Due to its close proximity to the galaxy’s economic and political powerhouse, the Core Worlds, the Colonies was a largely wealthy region consisting of booming industrial worlds, trade centers, and garden worlds."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20090904103024\/starwars\/images\/thumb\/7\/73\/TheColonies.jpg\/250px-TheColonies.jpg","caption":"Map of the Colonies region."}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"The planets of the Colonies were among the first areas outside the Core to be colonized, some before the establishment of the Galactic Republic, and many worlds in the Colonies were founding members. The worlds here were typically heavily populated, industrialized, and had cultures as well established as the Core Worlds. The planets in the Colonies were extremely wealthy and highly developed, and could be referred to as export powerhouses. Many produced vast amounts of raw materials, particularly food and metals for the production of droids, starships, and military vehicles. Mining operations would often leave entire planets ravaged and bare."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Circa 27,000 BBY, the Gossam of Castell developed the tumble hyperdrive which allowed them to colonize several distant worlds including Felucia in the Outer Rim. Most worlds in the Colonies section of \"the Slice\" were colonized by 24,000 BBY. During the late Pre-Republic era, several wealthy Core worlds in the Arrowhead colonized various worlds in this region through the use of generation ships and carved up interstellar empires. Settlers from Humbarine colonized Balmorra and Commenor while the Corellians colonized Byblos and Loronar. The Duros colonists settled on Neimoidia and gradually evolved into a separate sub-species known as the Neimoidians by 15,000 BBY. Due to slow hyperspace travel and lack of communication, these colony worlds broke away from their colonial masters which sparked some conflict."},{"type":"paragraph","text":"The formation of the Galactic Republic in 25,000 BBY helped minimize conflict between the Core and break-away Colony worlds, and expand colonization efforts within the region. This was greatly aided by the discovery of the Corellian Run and Perlemian Trade Routes which led to the establishment of several new colony worlds including the shipyard base of Loronar, the Yabol Opa, Raithal, Arkania, and the agrarian worlds of the Delle system. By 22,000 BBY, the Duros on Neimoidia had established a few colony worlds known as the \"purse worlds\". One of these worlds Cato Neimoidia joined the Republic that year."},{"type":"paragraph","text":"In 50 BBY, the Arkanian Revolution occurred in Arkanian space when a non-interventionist faction rebelled against the radical geneticist Arkanian Dominion. The revolutionaries amassed an army of cyborgs created from merging the body parts of various species. However, the Dominion appealed to help from the Jedi Order and the revolution was brutally put down. However, some of their cyborg creations survived including the bounty hunter Gorm the Dissolver."},{"type":"paragraph","text":"Ten years before the Invasion of Naboo, the Commerce Guild took advantage of an economic recession on Castell to take control of the planet. One Gossam named Shu Mai used her aggressive business tactics to buy back Castell and gradually became the Guild's president. Mai had each able Gossam serve as an indentured servant of the Commerce Guild for a portion of their lives in return for food, housing, and a modest income. Gradually, Castell recovered from the recession, but came under the influence for the Commerce Guild which subsequently joined the Confederacy of Independent Systems during the Separatist Crisis and Clone Wars."},{"type":"paragraph","text":"During the Clone Wars, Neimoidia and the \"purse worlds\" were battlegrounds between the Republic and the Confederacy of Independent Systems towards the end of the war in 19 BBY. Under Emperor Palpatine's reign, the Galactic Empire was very forceful in controlling the Colonies particularly developing a hardline policy towards species and worlds that had supported the Confederacy. The Gossam species of Castell were a primary target of the Empire's humanocentric policies. Consequently, the Alliance to Restore the Republic and its successor state the New Republic gained support in the region. As part of its invasion of the Core Worlds from 5 ABY to 6 ABY, the Republic secured several undeveloped Colonies worlds as stepping stones. Following the Battle of Endor in 4 ABY, the Gossam were liberated from Imperial rule."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Episode I Adventures 1: Search for the Lost Jedi","elements":[]},{"text":"Star Wars Adventures 1: Hunt the Sun Runner","elements":[]},{"text":"Star Wars Adventures 5: The Shape-Shifter Strikes","elements":[]},{"text":" Baktoid Closes Down Five More Plants—HoloNet News Vol. 531 46","elements":[]},{"text":"The Cestus Deception","elements":[]},{"text":" A Wretched Hive on Wizards.com","elements":[]},{"text":" \"Dead End Drop\"—Shadows of the Empire Sourcebook","elements":[]},{"text":" Ride Herd on Wizards.com","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Roleplaying Game, Second Edition","elements":[]},{"text":"Imperial Sourcebook, Second Edition","elements":[]},{"text":"Heroes & Rogues","elements":[]},{"text":"The Jedi Academy Sourcebook","elements":[]},{"text":"\"Shape-shifters\"—Star Wars Adventure Journal 12","elements":[]},{"text":" A Traveler's Journals of Ralltiir on Wizards.com","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Who's Who in the Delegation of 2000","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide","elements":[]},{"text":" Arkanian Chill on Wizards.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Galaxy of Intrigue","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]},{"text":" Essential Atlas Extra: The Knight Errant Gazetteer on StarWars.com","elements":[]},{"text":"The Journal of Master Gnost-Dural","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":" \"Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away, Part 1,\" The Official Star Wars Blog","elements":[]},{"text":"Suns of Fortune","elements":[]}]}],"images":[]}]}