{"sections":[{"title":"Bardotta","level":1,"content":[{"type":"paragraph","text":"Bardotta was a planet located in the Colonies' Bardotta system that was ruled by the much beloved Queen Julia during the Clone Wars. Its inhabitants were reputed for their mysticism and attention to spiritual matters."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"During the Clone Wars, in 20 BBY the Bardottan Queen Julia contacted the Galactic Senate as several of her most trusted spiritual advisers had disappeared, and asked for the help of Representative Jar Jar Binks, to come and investigate the unusual situation."},{"type":"paragraph","text":"Jar Jar Binks was accompanied by Jedi Master Mace Windu, even though the Bardottans didn't trust the Jedi (due to an incident in the past which painted the Jedi as Kidnappers) and excluded the Master from several important meetings about the matter. During a meeting with Jar Jar Binks, the queen got abducted so Jar Jar and Mace Windu decided to investigate the underground caves under the Royal Palace as they thought that that was the best place to look due to info of it leading to a revered place of the Frangawl cult."},{"type":"paragraph","text":"The Representative and the Jedi found the secret headquarters of the Flanglaw cult and rescued the Queen, moments before being sacrificed in order to steal her life force, a power which later would land in the power of Clan Mother Talzin of the Nightsisters."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20150411011925\/starwars\/images\/thumb\/f\/f8\/Bardotta.png\/250px-Bardotta.png","caption":"The landscape of Bardotta"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The planet Bardotta is named after French artist Brigitte Bardot."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Clone Wars – \"The Disappeared, Part I\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"The Disappeared, Part II\"","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Launch Pad\"—Star Wars Insider 148","elements":[]},{"text":" \"The Disappeared, Part I\" - The Clone Wars Episode Guide on StarWars.com","elements":[]},{"text":" \"The Disappeared, Part II\" - The Clone Wars Episode Guide on StarWars.com","elements":[]},{"text":" Bardotta in the Encyclopedia","elements":[]}]}],"images":[]}]}