{"sections":[{"title":"Borleias","level":1,"content":[{"type":"paragraph","text":"Borleias was the fourth and only inhabited planet in the Pyria system. It was located in the Colonies, at the edge of the Galactic Core and along the Namadii Corridor."},{"type":"paragraph","text":"Every year it went through a meteor shower. A jungle planet with beautiful beaches and seas, it was poor in natural resources."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Galactic Republic era","level":3,"content":[{"type":"paragraph","text":"Borleias was the site of an Alderaan Biotics operation established about 700 BBY. The Galactic Republic established a small base on the world, using it as a waypoint for transport to the Corporate Sector."},{"type":"paragraph","text":"In 27 BBY, the Outbound Flight expedition traveled through the system on its voyage from Yaga Minor to the Unknown Regions."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070804082417\/starwars\/images\/thumb\/8\/8b\/Alderaan_Biotics_facility_%28Borleias%29.png\/150px-Alderaan_Biotics_facility_%28Borleias%29.png","caption":"Alderaan Biotics facility."}]},{"title":"Galactic Civil War","level":3,"content":[{"type":"paragraph","text":"Under the Galactic Empire, the Alderaan Biotics facility was converted into a blackmarket production facility by General Evir Derricote before he was transferred to Coruscant to create the Krytos virus for Ysanne Isard. The world was otherwise left largely alone. To prevent Rebel incursion to the world (a possible stepping-stone to the Core Worlds), the Empire expanded its military base, including four ion cannons and two TIE Fighter squadrons."},{"type":"paragraph","text":"Calling it the code name \"Blackmoon\", the New Republic finally captured the world after a first failure in 6.5 ABY. The New Republic fortified Borleias as a forward base, using it as a branch for the Invasion of Coruscant. After the capture of Borleias, the New Republic established a fighter training base on the planet even as ships sent by Warlord Zsinj began making reconnaissance raids into the system."},{"type":"paragraph","text":"In 7 ABY the surviving members of Wraith Squadron took leave on one of the planet's beaches to celebrate after the destruction of Admiral Apwar Trigit and his Imperial-class Star Destroyer Implacable in the Battle of Ession."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070804185248\/starwars\/images\/thumb\/4\/41\/Evir_Derricote_and_scientist.png\/130px-Evir_Derricote_and_scientist.png","caption":"General Derricote and Borleian scientist."}]},{"title":"Later history","level":3,"content":[{"type":"paragraph","text":"In 27.5 ABY, during the Yuuzhan Vong War, Borleias served as a New Republic fortress. Its loss led to the Battle of Coruscant. The system was later the site of a significant battle, which saw the annihilation of a large Yuuzhan Vong contingent and consequently a morally important New Republic victory."},{"type":"paragraph","text":"In 40 ABY, Jacen Solo offered Borleias and Bilbringi to the Imperial Remnant if they supported the Galactic Alliance at the Second Battle of Fondor. Despite Solo's overtures to the Moff Council three years earlier, Borleias was under Galactic Alliance control as of 43 ABY. An assassination attempt against Imperial Head of State Jagged Fel on Coruscant was perpetrated by turncoat stormtroopers funded with monetary accounts from a dummy company on Borleias. Then in 44 ABY, the transport Dust Dancer visited Borleias in preparation for the Jedi coup against Natasi Daala on Coruscant."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"X-Wing: Rogue Squadron","elements":[]},{"text":"X-Wing: Wedge's Gamble","elements":[]},{"text":"X-Wing: The Krytos Trap","elements":[]},{"text":"X-Wing: The Bacta War","elements":[]},{"text":"X-Wing: Wraith Squadron","elements":[]},{"text":"X-Wing: Iron Fist","elements":[]},{"text":"X-Wing: Isard's Revenge","elements":[]},{"text":"Specter of the Past","elements":[]},{"text":"The New Jedi Order: Dark Tide II: Ruin","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]},{"text":"The New Jedi Order: Enemy Lines I: Rebel Dream","elements":[]},{"text":"The New Jedi Order: Enemy Lines II: Rebel Stand","elements":[]},{"text":"The New Jedi Order: Destiny's Way","elements":[]},{"text":"The New Jedi Order: Ylesia","elements":[]},{"text":"The New Jedi Order: The Final Prophecy","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Legacy of the Force: Exile","elements":[]},{"text":"Legacy of the Force: Revelation","elements":[]},{"text":"Fate of the Jedi: Outcast","elements":[]},{"text":"Fate of the Jedi: Backlash","elements":[]},{"text":"Fate of the Jedi: Conviction","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"The Official Star Wars Fact File 140","elements":[]},{"text":"Scum and Villainy","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 33","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]}]}