{"sections":[{"title":"Carida","level":1,"content":[{"type":"paragraph","text":"Carida, originally known as Ord Carida, was a planet of the Colonies region of the galaxy, near the Perlemian Trade Route, and the homeworld of the Caridan race."}],"images":[]},{"title":"Features","level":2,"content":[{"type":"paragraph","text":"This large, high-gravity world was covered in everything from rocky mountains and frozen ice fields, to rain forests full of carnivorous plants, and deserts. As such, this planet was the perfect training ground for combat in difficult terrain. It was an exporter of food, and was ruled by the Council of Merchants, which later shared power with a military administration."}],"images":[]},{"title":"History","level":2,"content":[],"images":[]},{"title":"The Old Republic","level":3,"content":[{"type":"paragraph","text":"Originally known as Ord Carida, the planet was colonized by the Galactic Republic as a Ordnance\/Regional Depot some time circa 12,000 BBY. During the Pius Dea Civil War, which ended Pius Dea domination over the Galactic Republic, the Republic's Rocket-Jumper Elite Advance Unit played an important role in the Jedi victory over the Pius Dea garrison there. During the time of the Cold War, a proxy conflict between the Sith Empire and Galactic Republic, some foragers discovered a crude tunnel burrowing under Carida's largest mountain range, believing it to be the entrance to a fabled ancient city. Eventually, someone was sent to check the foragers' findings."},{"type":"paragraph","text":"Carida was the site of a major military training facility, the Academy of Carida. The training facilities were offered to the Galactic Republic for training an army created by the Military Creation Act before the Clone Wars. This selfsame facility was converted willingly by the population to an Imperial training center and was home to the Empire's most important stormtrooper program, along with several hundred B3 ultra battle droids. The planet remained loyal to the Republic during the Clone Wars and was an adamant supporter of the Galactic Empire until the bitter end."}],"images":[]},{"title":"Clone Wars","level":3,"content":[{"type":"paragraph","text":"In 22 BBY, the first year of war, the planet was the site of a victory for the Confederacy of Independent Systems over the Republic. The Republic's loss at Carida, coupled with other recent defeats, led Jedi Grand Master Yoda to believe that the Republic needed another major victory."},{"type":"paragraph","text":"Sometime later in the war's course, Carida was once again under Republic control. The Republic operated a space station, known as the Valor, within orbit of Carida and it was the site of a Republic strategy conference around 20 BBY. The Separatists, under a super tactical droid, unsuccessfully tried to destroy the station during the conference using a derelict bomb-laden Jedi cruiser, the Renown. Near the end of the war, Republic forces seized a Techno Union factory on Tar Morden and acquired many crab droids, which were then sent to Carida."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130124185004\/starwars\/images\/thumb\/3\/3c\/Unidentified_Abafar_Jedi_cruiser.png\/220px-Unidentified_Abafar_Jedi_cruiser.png","caption":"Separatist forces attempted to destroy Valor during a strategy conference."}]},{"title":"Later history","level":3,"content":[{"type":"paragraph","text":"The planet also had numerous rancors on it that had been transplanted from other worlds. They were often used for training exercises, pitting stormtroopers or Imperial vehicles against them. The planet was also the site of the Battle of Carida, between forces under Grand Admiral Thrawn and ships of the Zann Consortium."},{"type":"paragraph","text":"The MT-AT \"Spider Walker\" was developed and manufactured here. General Veers also tested the first AT-AT there. Carida was also the homeworld of Admiral Kendal Ozzel."},{"type":"paragraph","text":"Carida originally had two moons, one of which, the Mascot Moon, had the Academy's logo carved into its surface. In 8 BBY, Mako Spince attempted to remove the logo using antimatter. Instead of achieving this goal, the moon was destroyed."},{"type":"paragraph","text":"At some point after the Battle of Endor, the Rebel Alliance, namely Mon Mothma, considered either recruiting or otherwise containing Carida as part of their long term plans of weakening the Empire's military infrastructure, although Carlist Rieekan expressed that they can only contain the planet in the best case scenario, as recruiting it is out of the question."}],"images":[]},{"title":"The destruction of Carida","level":3,"content":[{"type":"paragraph","text":"The planet was destroyed in 11 ABY by Jedi Kyp Durron under the influence of the spirit of Sith Lord Exar Kun by using the Sun Crusher, a superweapon that fired torpedoes into a star and caused it to go supernova. Beforehand, Durron requested information on his brother, Zeth, who had been forced into the stormtrooper program. The Caridans falsely told him Zeth was killed in a training maneuver, and, in a rage, Durron fired a resonance torpedo at the system's sun. Kyp announced they had two hours to evacuate before their world was destroyed, and just before it happened, Lieutenant Dauren alerted him that Zeth was still alive. Many Imperials evacuated from the planet."},{"type":"paragraph","text":"As Kyp raced to the surface to find Zeth, the sun collapsed and exploded in two massive shockwaves. Kyp managed to find his brother Zeth. However, Dauren prevented Zeth from getting on board his brother's ship and Kyp was forced to watch his brother die in the first wave. Kyp escaped as the second wave cracked the planet in half."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The PC game Star Wars: Rebellion mistakenly places Carida in the Fakir sector of the Core Worlds. The Fakir Sector is actually located in the Inner Rim Territories."},{"type":"paragraph","text":"The Clone Wars: Wild Space stated that early on in the Clone Wars, Carida was conquered by the Separatists. However, the Star Wars: The Clone Wars Season Five episode \"Point of No Return\" shows Carida heavily cordoned by Republic warships, thus back under the Republic banner. Until a source clears up this discrepancy, this article reconciles information from all source material by assuming that Carida fell back under Republic control sometime between these events."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20060501081728\/starwars\/images\/thumb\/2\/28\/CaridaSurface.jpg\/200px-CaridaSurface.jpg","caption":"A rancor on Carida."}]}]}