{"sections":[{"title":"Caridan (species)","level":1,"content":[{"type":"paragraph","text":"The Caridan were a mammalian species of Carida. Average Caridans stood over two meters tall and possessed dense musculatures due to Carida's high gravity level. They spoke Caridan and most also spoke Basic. Caridan society was structured around a mercantile culture led by an active market and Caridan owned industrial firms. In fact, the Caridans were widely known for their appraisal and bartering skills. The Caridans cooperated with the Galactic Republic and later the Galactic Empire in the operation of the Academy of Carida. The Empire's xenophobia ignored the Caridans outside the Imperial compound, although tensions grew after the Battle of Yavin. Many Caridans vanished from the galaxy with the destruction of Carida at the hand of Kyp Durron. The few Caridans that survived were off-world as traders, New Republic operatives, or fringers. Notable Caridans included Imperial Ambassador Furgan of Carida."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" Carida Backs Military Creation Act—HoloNet News Vol. 531 52","elements":[]},{"text":"Boba Fett: Maze of Deception","elements":[]},{"text":"Boba Fett: Hunted","elements":[]},{"text":"Jedi Search","elements":[]},{"text":"Dark Apprentice","elements":[]},{"text":"Champions of the Force","elements":[]},{"text":"Tyrant's Test","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Jedi Academy Sourcebook","elements":[]},{"text":"The Essential Guide to Planets and Moons (Carida entry)","elements":[]},{"text":" Carida: Heavy Duty on Wizards.com","elements":[]},{"text":"Star Wars: Empire at War: Forces of Corruption: Prima Official Game Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}