{"sections":[{"title":"Cragmoloid","level":1,"content":[{"type":"paragraph","text":"Cragmoloids were a rare sentient species of intimidating pachydermoids with massive builds. They had big, flat ears, manipulative trunks and a number of tusks that could be used in combat—and that were valued by hunters. They also had less pachydermoid traits, including hands with five nailed fingers. Although prone to attacking in a rage, particularly when facing subterfuge, Cragmoloids disliked gratuitous violence and were a proud, peaceful people. Cragmoloids loved their families and tended to get depressed if separated from them."},{"type":"paragraph","text":"Cragmoloids evolved on the rocky planet Ankus, where they were enslaved by the Galactic Empire and forced to allow the planet to be strip-mined by a corporation called TaggeCo. Cragmoloids also suffered frequent attacks by hunters who sought their valuable ivory, a peril that prompted many Cragmoloids to the humiliation of simply off sawing their own tusks off. A small number of Cragmoloids left their world to earn a living among the stars; some of these were Boulad, an information broker living on Coruscant; and Rooty, a gambler and smuggler operating in Hutt Space."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Cragmoloids were sentient pachydermoids that resembled anthropomorphic elephants, or simply elephants walking on their hind legs. Cragmoloids had stiff, thick, leathery skin that protected them from damage, and two elephantine, flap-like ears. Among the folds of their skin, a Cragmoloid had two sharp, small, red, beady eyes, which opened wide when the individual was surprised. When crying, each of the eyes shed half a liter of water as a tear."},{"type":"paragraph","text":"Another pachydermoid trait was the thick facial trunk, which was a manipulative organ: Cragmoloids used their trunk to frisk individuals. They also raised it in moments of surprise. While some Cragmoloids had only one trunk, others had two smaller, secondary trunks surrounding the main one. Cragmoloids had natural tusks under the trunk. These could be used in combat to impale an opponent or during a wrath-driven charge. Some Cragmoloids had two big tusks, while others had four smaller ones. In any case, the tusks could be, and sometimes were, sawed off."},{"type":"paragraph","text":"Cragmoloids were massive in size, commonly reaching three meters of height, and weighing over two hundred kilograms in adulthood. Not only big, but also very strong, cumbersome and intimidating, they commonly found that hiding their bulk was a difficult task. Other Cragmoloid physical traits were less pachydermoid. The top of the head presented coarse, stringy hair, at least in some cases. While Cragmoloids had three-toed, clawed feet, their massive five-fingered hands were humanoid in shape and had nails."},{"type":"paragraph","text":"Cragmoloids began their adolescence at eight years of age, reaching biological maturity at fifteen. They typically suffered no ills of age before reaching forty, and were considered to be old only at eighty-seven. A Cragmoloid could easily reach the advanced age of one hundred and twenty years."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Cragmoloid people were proud and valued a promise as a bond. They considered that losing one's tusks was a severe humiliation. They also preferred to face setbacks with direct answers instead of what they considered to be dishonorable tricks—something that did not stop them from pursuing careers in organized crime. Duplicity and deception commonly exasperated Cragmoloids, who were prone to violent attacks of rage when angered. Notwithstanding their physical prowess, Cragmoloids believed that unjustified violence was barbaric and to be avoided."},{"type":"paragraph","text":"Their civilization was organized into clans. Cragmoloids were so close to their families that they suffered severe depressions if separated from their homes or their friends. A Cragmoloid always preferred chatting about kinship to talking about any other subject, and they commonly praised their direct relatives. Aliens speaking with a Cragmoloid sometimes resorted to asking about their families to obtain the Cragmoloid's trust—although only after enduring many minutes of speeches. Cragmoloids had one-word names. Representative appellations included Akoom, Darak, Ormoj, Urun, Vuula, Bachus, Ganesh and Trusk."},{"type":"paragraph","text":"Cragmoloids were an isolated people, commonly speaking only Cragii, the native language of their homeworld. Cragmoloids traveling to other planets commonly learned to speak, but not to read, Galactic Basic Standard. Non-verbal aspects of Cragii was not a widely-known subject on other worlds: a grunt could be construed to mean either acknowledgment, amusement or digestive upset."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100614080557\/starwars\/images\/thumb\/c\/cf\/Rootylando1.PNG\/180px-Rootylando1.PNG","caption":"Cragmoloids disliked duplicity"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Cragmoloids evolved on the plains of Ankus, a rocky planet in one of the freestanding subsectors of the Mid Rim. At some point prior to 22 BBY, the Cragmoloids joined the galactic community. Although a number of Cragmoloids were identified as Force-sensitives, none of them became a Jedi Knight. The Cragmoloids also became prey to professional hunters, who killed the pachydermoids to keep the ivory from the Cragmoloids' valuable tusks. That was not the species' only off-world threat: the Galactic Empire, created in 19 BBY,enslaved all the available Cragmoloids, and the company TaggeCo performed extensive mining on Ankus. These three factors pushed the Cragmoloid species towards extinction. As the Empire had caused some of their worries, a few Cragmoloids joined the Alliance to Restore the Republic, hoping to help their kin."}],"images":[]},{"title":"Cragmoloids in the galaxy","level":2,"content":[{"type":"paragraph","text":"Cragmoloids were rarely seen in the galaxy, partly as they needed to adapt common appliances to their massive bulks. Boulad, a Cragmoloid information broker in the Undercity of the planet Coruscant, hollowed out a resiplex to create a dwelling appropriate for his size. Circa 18 BBY, Boulad sold the Human security guard Gregar Typho valuable information about the Sith Lord Darth Sidious's presence on the planet Mustafar."},{"type":"paragraph","text":"At some point prior to 20 BBY, two three-meter tall Cragmoloids, Noba and Ook, were captured on Ankus by the Chevin Dark Side Adept Phylus Mon. Mon jailed the Cragmoloids in his menagerie, the starship Animiasma, along with other uncommonly seen non-Humans. Although the Cragmoloids were intimidating even behind bars, they were really very depressed over their situation."},{"type":"paragraph","text":"Most Cragmoloids were unable to escape from Ankus to the stars during the Galactic Civil War. Those who could commonly decided to saw off their own tusks to avoid the threat of hunters, but to many that was an unbearable humiliation. The free Cragmoloids worked as scouts or with merchants, but the species was almost exclusively seen in Imperial work camps."},{"type":"paragraph","text":"Around 10 BBY, the Cragmoloid smuggler and gambler Rooty reached the moon Nar Shaddaa. Ashamed for having turned his massive back to his planet, Rooty hoped to forget his disgrace in a hedonistic search of pleasure and rubbing shoulders with the likes of the Human smugglers Han Solo, Salla Zend and Lando Calrissian. In 1 BBY, Rooty defeated Calrissian at the card game sabacc, winning the 20,000 bet that the Socorran had placed on his hand. Calrissian then admitted he had bet more credits than he actually had available, and offered an alternative payment to Rooty. Understanding that Calrissian was trying to cheat him, the Cragmoloid was enraged and physically threatened Calrissian. A certain Twi'lek bystander offered to pay Rooty the remainder of the debt and, although Rooty agreed, he still retained a dislike for Calrissian in later times."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Cragmoloids first appeared in the 2000 comic book Underworld: The Yavin Vassilika 1, written by Mike Kennedy and drawn by Carlos Meglia. The background for the species was expanded in Andrew Hind's article Unusual Suspects, published in 2001 in Star Wars Gamer 6, and again in 2003's Ultimate Alien Anthology. In 2008, the species received an entry in The Complete Star Wars Encyclopedia."},{"type":"paragraph","text":"Although Ultimate Alien Anthology repeats a number of sentences from Unusual Suspects, it also introduces a number of inconsistencies, mostly in terms of role-playing game rules: The Gamer article considers the Cragmoloids to be larger in game terms, and adds a bonus to their perception and a penalization to their charisma to reflect their cumbersomeness and intimidating appearance. Both sources recognize that the Cragmoloids can attack with tusks or by ramming, but each source uses different rules for the effects. Ultimate Alien Anthology also provides a table for the Cragmoloid lifespan, while Unusual Suspects suggests that the lifespan of a Cragmoloid equals a Wookiee's. In this last case, this article follows the Anthology lifespan table, because it is the more recent source."},{"type":"paragraph","text":"Star Wars: The Essential Atlas Online Companion places the Cragmoloid home planet Ankus in the Mid Rim. Previous sources located it in the limits of the Unknown Regions, near Ord Mantell. Ankus shares its name with an implement used to handle elephants. One of the example names for Cragmoloids given in Ultimate Alien Anthology, Ganesh, is that of an elephant deity of the Hindu pantheon."},{"type":"paragraph","text":"Huge, pachydermoid aliens that shares physical traits in common with the Cragmoloids appears in two comedic, non-canon stories. In Best Birthday Ever, first published in Star Wars Tales 16 in 2003, a pachydermoid appears waiting in a queue with the Twi'lek majordomo Bib Fortuna. Another story, Fett Club, first published in Star Wars Tales 24 in 2005, features a pink, tusked elephantine humanoid who answers a fake advertisement to become a Mandalorian. In actuality, the ad is a trick by Separatist Head of State, Count Dooku, to find a template for his clone army. The pink pachydermoid escapes the audition."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100614080658\/starwars\/images\/4\/4d\/Bestbirthdayevercragmoloid.PNG","caption":"From Best Birthday Ever"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"A Mon Alone","elements":[]},{"text":"Coruscant Nights II: Street of Shadows","elements":[]},{"text":"Underworld: The Yavin Vassilika 1","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" \"Unusual Suspects\"—Star Wars Gamer 6","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}