{"sections":[{"title":"Cyrillian","level":1,"content":[{"type":"paragraph","text":"Cyrillians were a species of tall, sentient reptiles native to the industrialized planet Cyrillia. The species invented the DUM-series pit droid to aid them in vehicle maintenance and made use of it during the reign of the Galactic Republic, when their homeworld became part of the galactic circuit of podracing. The species agreed to give up the rights to the model and produce it for the Serv-O-Droid, Inc. droid-manufacturing company, in return for profits after Cyrillia ceased to be part of the podracing circuit. During the Galactic Civil War, Cyrillia became a fortress world for the Galactic Empire, but the Imperials abandoned it in 6 ABY."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cyrillians were a sentient reptilian species who stood as tall as Wookiees, a species whose males stood around 2.1 meters tall on average."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Cyrillians were native to Cyrillia, an industrialized planet in the Cyrillia system of the Cyrillian Protectorate. The area of the Slice in the Expansion Region within which the species' homeworld fell was widely explored between 20,000 BBY and 15,000 BBY. During the Alsakan Conflicts, the planet became a stronghold of the fanatical religious cult known as the Pius Dea, who at the time controlled the Galactic Republic. In around 12,700 BBY, during the conflicts and by which time the world was within Republic space, a resistance rose up on Cyrillia, and in 10,967 BBY, the Cyrillian homeworld was attacked by Alsakan forces and their allies as part of the Seventh Alsakan Conflict, which aimed to remove the cult from power in the Republic."},{"type":"paragraph","text":"The Cyrillians began making use of turbine-powered, floating transports on their homeworld prior to 189 BBY, and they developed the small DUM-series pit droid model to help carry out maintenance on the vehicles. The droids were used in particular for jobs requiring small size, such as moving under a hovering vehicle or climbing into a circuitry bay. Cyrillia became a part of the galactic podracing circuit in 189 BBY, and the inhabitants made use of large numbers of pit droids to service and fuel podracers taking part in the competitions. In 122 BBY, Cyrillia ceased to be part of the podracing circuit, but the pit droids had become so popular that the large droid-manufacturing company, Serv-O-Droid, Inc., made a deal with the Cyrillians to distribute the model. The Cyrillians gave up ownership but agreed to continue making it; in return, the company financed the building of factories on Cyrillia and handled distribution and advertising, with the Cyrillians also still receiving some profit."},{"type":"paragraph","text":"By 52 BBY, the region of space including Cyrillia had become part of Hutt Space, an area controlled by members of the Hutt species. It remained in the region until at least 19 BBY, when the Galactic Empire, the successor state to the Republic, claimed the area. By 4 ABY, during the Galactic Civil War, the Cyrillians' homeworld was considered an Imperial fortress world. However, in 6 ABY the Imperials were forced to abandon the planet after the New Republic won a victory over the Empire in a battle on the nearby fortress world of Reytha."},{"type":"paragraph","text":"The New Republic made the Cyrillian homeworld a Republic stronghold by 7 ABY, a situation that led to a battle there during Operation Shadow Hand, a bid by the reborn Galactic Emperor Palpatine to reclaim lost Imperial territory between 10 ABY and 11 ABY. The Cyrillia system was attacked again during the Yuuzhan Vong invasion of the galaxy between 26 ABY and 27 ABY, and by 27 ABY, the Yuuzhan Vong controlled the planet. Nevertheless, the Vong lost control of the Cyrillian homeworld by 40 ABY."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20071012163057\/starwars\/images\/thumb\/8\/86\/DUM-pitdroid_negtd.jpg\/200px-DUM-pitdroid_negtd.jpg","caption":"The Cyrillians developed the DUM-series pit droid model."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Cyrillians were first mentioned in the entry for the pit droids in The New Essential Guide to Droids, a sourcebook released in 2006 and written by Daniel Wallace. They were also included in the entry for pit droids in the 2009 The Complete Star Wars Encyclopedia."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]}]}],"images":[]}]}