{"sections":[{"title":"Celegian","level":1,"content":[{"type":"paragraph","text":"Celegians were a nonhumanoid species from Celegia, a planet with raging seas in the Expansion Region. Celegians were relatively isolationist as a species, but had good relations with the Galactic Republic."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Celegians appeared to many humanoids as \"floating brains.\" Very intelligent, they had a natural form of telekinesis that functioned like a repulsorlift. They breathed cyanogen, a gas poisonous to Humans. Conversely, oxygen was lethal to them, necessitating atmospheric transport chambers offworld."},{"type":"paragraph","text":"The Celegians were greatly known for their massive intellect and wisdom. Their race evolved from ocean-dwelling invertebrates to the ancestors that eventually lived on land in Celegia. To move their jellyfish-like bodies, the Celegians created a form of locomotion similar to a repulsorlift generator. Their soft fleshy bodies, great tentacles, and dependence upon life-support chambers made the Celegians look as though they were always swimming or floating. Celegians communicated using a form of telepathy, and had no written or spoken language."}],"images":[]},{"title":"Celegians in the galaxy","level":2,"content":[{"type":"paragraph","text":"Celegians tended to be explorers, and were often found in the company of other species with the same interests. Those Celegians that could be encountered away from their homeworld were usually scouts or diplomats, although a rare few were trained in the ways of the Force by the Jedi Order. One of the most notable Celegians was Ooroo, a Jedi Master during the Great Hyperspace War."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Tales of the Jedi: The Golden Age of the Sith","elements":[]},{"text":"Tales of the Jedi: The Fall of the Sith Empire","elements":[]},{"text":"Knight Errant","elements":[]},{"text":" Stories of Caarimon on Wizards.com","elements":[]},{"text":"The Last Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Jedi Academy Training Manual","elements":[]},{"text":" Essential Atlas Extra: The Knight Errant Gazetteer on StarWars.com","elements":[]},{"text":" Celegian in the Databank","elements":[]},{"text":"The Essential Reader's Companion","elements":[]}]}],"images":[]}]}