{"sections":[{"title":"Chazrach","level":1,"content":[{"type":"paragraph","text":"The Chazrach (also known as \"reptoids\") were a short, stocky, reptilian humanoid race with snubbed snouts who served the Yuuzhan Vong as slave soldiers."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Overview","level":2,"content":[{"type":"paragraph","text":"Like the Yuuzhan Vong, the Chazrach were not native to the galaxy, having been enslaved during the Yuuzhan Vong's conquest of their galaxy. Unlike the Yuuzhan Vong, however, they had a presence in the Force."},{"type":"paragraph","text":"For thousands of years, the Chazrach were bred in large numbers as expendable support troops. A pair of dome-like calcifications protruded from the forehead of each Chazrach, inhibiting their autonomy and allowing their Yuuzhan Vong masters to control them. However, this proved to be a disadvantage in battle since they could be easily killed. In battle, the Chazrach were controlled by warbeasts such as Thrall herders and Rakamats. If a warbeast was destroyed, the Chazrach associated with it would attack anything that moved, including each other."},{"type":"paragraph","text":"Any form of cognizance and initiative that was possessed by the base species vanished over the generations of genetic tampering by the shaper caste. This flaw, combined with their small, stocky statures made them incapable of mastering the use of the standard amphistaff used by the warrior caste as a whip. The reptoids instead use the inflexible coufee, which was better suited to their body form, and an inferior breed of the amphistaff. A few Chazrach served the Yuuzhan Vong so well over the generations that they were permitted to join the warrior caste at its most basic levels."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20100131181758\/starwars\/images\/thumb\/0\/0a\/InvasionRefugeeChazrach.jpg\/150px-InvasionRefugeeChazrach.jpg","caption":"A Chazrach reports to Commander Tsalok."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"At some point in the past, the Yuuzhan Vong conquered the Chazrach, and began breeding the creatures to serve as shock troopers during their wars. While not as formidable as the warrior caste, they proved to be single minded and were incapable of being reasoned with. They accompanied their masters onboard the worldships and later participated in the invasion of the galaxy."},{"type":"paragraph","text":"The first notable engagement where the Chazrach were used was during the Battle of Dantooine where the reptoids were used to attack the New Republic forces on the planet. However, once Luke Skywalker killed the Thrall Herder, the mental control over the Chazrach was removed and the creatures became feral; attacking one another and anything in their sight. Later, Commander Shedao Shai used Chazrach in the Battle of Ithor. Reptoids were also seen during the invasion of Rychel where they battled against New Republic troopers."},{"type":"paragraph","text":"These creatures remained loyal to their masters throughout the conflict and defended the Yuuzhan Vong empire at the Battle of Yuuzhan'tar, where the Yuuzhan Vong were defeated after the death of Supreme Overlord Shimrra Jamaane."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Invasion: Refugees 3","elements":[]},{"text":"The New Jedi Order: Dark Tide I: Onslaught","elements":[]},{"text":"Star Wars: Invasion: Revelations 1","elements":[]},{"text":"The New Jedi Order: Dark Tide II: Ruin","elements":[]},{"text":"The New Jedi Order: Agents of Chaos II: Jedi Eclipse","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]},{"text":"The New Jedi Order: Enemy Lines I: Rebel Dream","elements":[]},{"text":"The New Jedi Order: Enemy Lines II: Rebel Stand","elements":[]},{"text":"The New Jedi Order: Force Heretic III: Reunion","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":" Last Call at Leatherback's on Wizards.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}