{"sections":[{"title":"Clawdite","level":1,"content":[{"type":"paragraph","text":"Clawdites were a humanoid sentient species native to the planet of Zolan. They were one of the few shape-shifting species in the galaxy, and were sometimes referred to as Changelings."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"In their natural form, Clawdites had the appearance of reptilian humanoids, and in fact had evolved from reptomammals.  They had sunken cheeks with a narrow nose and a small mouth. A thin line ran down their foreheads and creased the center of their noses. They possessed large eyes with slit-like pupils, and their irises could be yellow, gold, or blue. Their skin was considered to be rough, and ranged in color from green to yellow. Overall, their appearance was identical to that of their genetic forebears, the Zolanders."},{"type":"paragraph","text":"Due to genetic manipulation, Clawdites possessed the extremely rare ability to change their appearance. When using this ability, they could change the color and texture of their skin and eyes, mimicking the appearance of other similarly-shaped beings, such as Humans. Shifting into a Weequay, a species with similar facial features, was considered to be an easy task. Though they could not add physical mass to their bodies, they were able to form hair, and could actually make it quite long. Clawdites were also able to mimic the appearance of clothing or jewelry, provided that the item laid directly on their skin, as it was merely a manipulation of their skin's texture. They could not change the appearance of their actual clothing, and had to rely on holographic technology in order to change such items."},{"type":"paragraph","text":"The growth of their abilities mainly relied upon a Clawdite's age. Younglings were only able to change color, a talent that began at infancy, and baby Clawdites used different hues and colors to indicate their needs to their parents."},{"type":"paragraph","text":"Unlike most shape-changing species, the Clawdite's shifting abilities actually caused them great physical discomfort. While the range of their abilities varied in individuals, with both age and practice, they could work through the pain of changing in order to alter their appearance in more and more extreme ways. Even the most talented Clawdite, however, lacked the fine coordination it would take to mimic a specific individual's appearance precisely. Only a very talented Clawdite was able to sleep and retain their altered form. If a Clawdite was suitably distracted or hurt, and certainly if they were killed, they would revert to their true form."},{"type":"paragraph","text":"It was thought to be impossible for a Clawdite to actually change their body structure or body mass, though it appeared that some individual Clawdites, such as Zam Wesell, Rolsat Noviee and Nuri, managed this feat through unknown means. As most sentient beings' bodies were composed mostly of water, xenobiologists speculated that the Clawdites ability to change may have laid in the manipulation of water, and that Wesell may have been able to exert greater control over her body's water than most. It was further presumed by those in the field that Wesell used some sort of medical device or injected substance, or that she managed to figure out how to expel and consume water in various quantities to reduce or increase her mass. Though scientists attempted to test their theories about Wesell, no Clawdites were willing to subject themselves to study, fearing repercussions or prejudice should their abilities be fully revealed."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20081230124517\/starwars\/images\/thumb\/7\/70\/Clawdite2.jpg\/200px-Clawdite2.jpg","caption":"A Clawdite taking on a new form while running from a Jedi."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"By nature, Clawdites were quiet and solitary beings, often shunning the company of others unless it benefited them. They viewed the rest of the galaxy pragmatically, and were often harsh realists who were often mistrustful and suspicious of others."},{"type":"paragraph","text":"Not all Clawdites used their shape-shifting abilities, but those who did were forced to undertake great physical pain and effort in order to do so. They often learned meditation and concentration techniques, over long periods of time, in order to maximize their capabilities. It was also necessary for Clawdites to treat their skin with specialized oils in order to prevent cracking or tearing of their skin, due to the difficulty in physically maintaining their disguises."},{"type":"paragraph","text":"While in their natural form, they were considered to be indistinguishable from their Zolander brethren, but it was possible to distinguish the two via genetic examination."},{"type":"paragraph","text":"The Mabari were an ancient order of warriors from Zolan, which survived at least until the last decades of the Galactic Republic. Though a few Clawdites, like Zam Wesell, were allowed entry, it was predominantly composed of Zolanders. The Zolanders wisely presumed that training too many Clawdites in the ways of war could create a powerful group of shape-shifting fighters, capable of overthrowing their rule. Any Clawdites who were accepted were closely monitored, and were they to leave the order, they were forcibly pressured to leave their homeworld as well. Those who joined the order often wore Mabari armorweave, and the group presented clasps to their adherents, which signified their ranks."},{"type":"paragraph","text":"On their homeworld of Zolan, Clawdites were feared and shunned by the Zolanders, who were a deeply religious people. Among their many strong convictions, the Zolanders believed the Clawdites to be impure and sinful. Because of their prejudice, the Zolanders forced the Clawdites to live in slums all across the planet. These ghettos were secured, so that the Zolanders could prevent the Clawdites from spreading. This subjugation continued for centuries on end, and it wasn't until after 4 ABY that they were able to change their situation. After the rise of their new government, the Clawdites began to hold classes for schoolchildren, in order to teach them greater control and efficiency with their abilities."},{"type":"paragraph","text":"The few Clawdites who left their world most often took advantage of their natural abilities to join militaristic professions, such as spying, assassination, and bounty hunting. Joining groups such as these were the rare occasions where Clawdites afforded their loyalty to others, and they saw it as a positive contribution to the galaxy. They often sought to protect the liberties of other species, sensing in their pain the disparity their own people suffered."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070701111500\/starwars\/images\/thumb\/6\/66\/Zolan.jpg\/200px-Zolan.jpg","caption":"Zolan, the Clawdite homeworld."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Hundreds of generations in the past, the planet of Zolan began to become bombarded with harmful solar radiation. Zolander scientists experimented on a group of volunteers, activating dormant skin-changing genes in the volunteers' genetic codes. To the repulsion of the rest of the Zolanders, these volunteers gained the ability to change their appearance. As they passed their genes down, a new species was formed, and the Zolanders quickly sought to marginalize and restrict this new species. After suffering persecution at the hands of their brethren, the very beings who had made them what they were, the altered Zolanders decided to create a new name for their species, to distinguish themselves from those who oppressed them. They now called themselves Clawdites."},{"type":"paragraph","text":"Hundreds of years after the divergence of their species, the Clawdites still lived in subjugation on their homeworld. During the Separatist Crisis, the assassin Zam Wesell, an ally of Jango and Boba Fett, was hired to help Fett kill Senator Padmé Amidala. Her assassination attempt went awry, however, and she was tracked down and captured by two Jedi, Obi-Wan Kenobi and Anakin Skywalker. As she lay wounded in the street on Coruscant, Fett felt that rather than allow her to reveal what she knew or attack the Jedi himself, he had to kill Wesell. He shot her in the neck with a poisoned Kyber dart, killing her."},{"type":"paragraph","text":"Around this same time, the famous pugil athlete, Rolsat Noviee, was discovered to be a Clawdite, due to a random blood test. Noviee had been posing as a Lannik for nine years, and was the highest-scoring and highest-paid player on the planet. After he was found out, Noviee fled offworld."},{"type":"paragraph","text":"During the Clone Wars, the Clawdites formed a political government for the first time, and sought the help of the Confederacy of Independent Systems. After contacting Count Dooku, they believed they would be able to overthrow the Zolanders. Two different Clawdites were known to have worked for the Separatists. One was the bounty hunter, Cato Parasitti, who helped fellow hunter Cad Bane in his mission to steal a holocron from vaults of the Jedi Temple. Another, Braxus Lyn, worked for the CIS as a spy. The Clawdite's hopes of help from Dooku were shattered when he was killed near the end of the Clone Wars by Skywalker."},{"type":"paragraph","text":"Conversely, some Clawdites served the Republic during the conflict. Bargu was a Clawdite Padawan in the Jedi Order, and a contemporary of Tallisibeth Enwandung-Esterhazy. Bargu competed in the Jedi Temple Apprentice Tournament in an attempt to show a Jedi Master that she should be chosen as their apprentice. She was hurt and disqualified during the eighth and final round."},{"type":"paragraph","text":"After the fall of the Republic, and the subsequent rise of the New Order, the Clawdites decided to act and struck back against their oppressors. The rebellion was short-lived, however, as the Galactic Empire, arrived and forcefully put down the uprising. Subsequently, the Clawdites were trapped on their planet by a forced blockade. Following the death of Emperor Palpatine and the fracturing of his Empire, however, the Clawdites rose up once more and fought against the Zolanders, in what become the Zolan Civil War. Inspired by the actions of the New Republic, the Clawdites triumphed during the war, and managed to gain control over seventy-five percent of their planet."},{"type":"paragraph","text":"Shortly after emerging victorious from their civil war, the Clawdites contacted the New Republic, and sought to become members of the new galactic government. Almost immediately, however, the Yuuzhan Vong invaded the galaxy, ignited a devastating war. A group of Clawdites formed Guile Company, which served as an intelligence unit behind Yuuzhan Vong lines. With their members numbering just over one hundred, and entering the most hostile of enemy territories, the Clawdites suffered an extremely high casualty rate. Even still, Guile Company kept receiving new volunteers, and they selected only the best shape-shifters. Because the casualty rate was so high, and the fact that their numbers galaxy-wide were so low, Clawdites who had children were disallowed into their ranks. Despite this, some hid the fact they had children from the recruiters, and managed to join."},{"type":"paragraph","text":"Guile Company remained intact after the war ended, and soon began work for the Galactic Alliance."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20071002142705\/starwars\/images\/thumb\/f\/fd\/Zam-clawdite.jpg\/200px-Zam-clawdite.jpg","caption":"Noted Clawdite assassin, Zam Wesell."}]}]}