{"sections":[{"title":"Coway","level":1,"content":[{"type":"paragraph","text":"The Coway were a primitive race of humanoids that were native to the planet Mimban. Because of their intense dislike of outsiders, they spent most of their lives in the caves beneath the planet's fog-shrouded swamps."},{"type":"paragraph","text":"Coway were bipedal and covered with a fine red down. They had relatively large eyelids and small eyes which were capable of seeing into the infrared spectrum, which they used to survive in the subterranean darkness. A Coway's diet typically consisted of fruits, lichens, raw meats and fungus which would be poisonous to them if not for the strong amino acids of his or her digestive system."},{"type":"paragraph","text":"Compared to the space-age cultures of the rest of the galaxy, the Coway were a primitive lot. Their main technological achievements were fire and weapons made of flowstone. They had little to no sense of higher learning or technology and were fond of charms. They treated death as an inevitable, everyday occurrence."},{"type":"paragraph","text":"Coway tribes lived in large villages where order was maintained by brute force. Any outsiders who ventured too close would be attacked. Males were dominant in Coway society and each village was ruled by a triumvirate of chiefs who answered only to the will of Canu, a warrior god."},{"type":"paragraph","text":"If the chiefs encountered gridlock when they attempted to resolve an issue by themselves, they submitted the problem to Canu. Because the Coway believed that Canu demanded strength from his followers, the greatest warriors of the conflicting parties would face each other in single combat until one quit or died. The winner of the contest would be presumed to be favored by Canu and therefore the chiefs would rule in favor of the party that the winner fought for. If the loser had lost because he quit, he and the party that he championed would abide by Canu's judgment and pay his respects to him by hitting the winner in the face. The winner was expected to return the favor or else face the prospect of angering Canu—and another physical contest."},{"type":"paragraph","text":"The largest known Coway village contained a population of at least two hundred. It was located in a large subterranean amphitheater near an ancient Thrella city that was adjacent to a subterranean lake. The village itself contained two Thrella structures that the tribe kept in an outward state of repair at the very least."},{"type":"paragraph","text":"The cave drawings of the Coway and the pictographs of the Mimbanites—another intelligent species native to Mimban and genetic cousins of the Coway— were extremely similar to those found in the Temple of Pomojema. This led many New Republic xenoarchaeologists to theorize that the two species and the temple—as well as the ancient civilization that had built it—were connected in some way."},{"type":"paragraph","text":"The Coway commonly made their way to the surface through Coway shafts which connected to Thrella wells as well as sinkholes and other openings. During their early days, they could come and go as they pleased. However, when the Galactic Empire discovered that Mimban was rich in dolovite, it established a mining facility on the planet. Rather than be subjugated by the Empire as their genetic cousins would be, the Coway retreated further into the subterranean depths, believing that they could find some refuge from the Empire's energy drills."},{"type":"paragraph","text":"The Coways' relative peace was short-lived. The Empire's mining operations managed to further disrupt their way of life. The Coway responded by rebelling with occasional acts of unpredictable violence. Sometime after the Imperial presence had been well-established, Coway would only periodically venture into the outskirts of the five mining towns. If they were confronted, they would flee. This behavior led many of the locals and miners to mistakenly believe that the Coway were shy and peaceful."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20061105131059\/starwars\/images\/thumb\/4\/41\/Coway2.png\/200px-Coway2.png","caption":"A Coway warrior."},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070205073235\/starwars\/images\/thumb\/b\/be\/Cowaychiefs.JPG\/180px-Cowaychiefs.JPG","caption":"The leaders of a Coway tribe decide the fate of a group of interlopers."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: General Grievous","elements":[]},{"text":"Splinter of the Mind's Eye","elements":[]},{"text":"Splinter of the Mind's Eye 3","elements":[]},{"text":"Splinter of the Mind's Eye 4","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Official Poster Monthly 10","elements":[]},{"text":"A Guide to the Star Wars Universe","elements":[]},{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Rebellion Era Sourcebook","elements":[]},{"text":"The Official Star Wars Fact File 15","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide","elements":[]},{"text":"\"Unknown Soldier: The Story of General Grievous\"—Star Wars Insider 86","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" Coway in the Databank","elements":[]},{"text":" Mimban in the Databank","elements":[]},{"text":" Mimbanite in the Databank","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]}]}],"images":[]}]}