{"sections":[{"title":"Charon","level":1,"content":[{"type":"paragraph","text":"Charon were a sentient species with both humanoid and arachnoid features. They had four arms, two of which were extremely powerful, and four legs, which made them very stable on their feet. Originally from a realm known as realspace, the Charon moved to a cold, bleak planet located in \"otherspace,\" a pocket dimension made up of black holes beyond the known confines of the galaxy. Charon were known for their violent, emotionless nature."},{"type":"paragraph","text":"Prior to the rise of the New Jedi Order, Charon were confined to otherspace, where most Charon followed a death cult which held the existence of all life, even their own species, to be an abomination. Their contact with the civilizations of the galaxy was limited, but it was enough to make them objects of horror."},{"type":"paragraph","text":"Shortly after the destruction of the second Death Star in 4 ABY, a splinter group of Charon devoted to maintaining peace and setting up new communities successfully constructed the species’ first hyperdrive and departed otherspace, with many Charon taking up positions as bioscientists, developing bio-organic technology similar to that of the Yuuzhan Vong."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Averaging between two to two and a quarter meters tall, Charon resembled a biological cross between humanoids and arachnids. They had thin bodies, encased by a thick mottled carapace, with distinctly arachnoid features, such as spinnerets in the abdomen, as well as multiple limbs. They had four thin arms with triple-clawed hands, and four hairy, insectoid legs, with large clawed feet. Their uppermost pair of arms was slightly larger than the other pair, and was used for holding weapons, and although Charon could hold objects in any of their four clawed hands, they only had one pair of primary hands. Their multiple limbs had several advantages; Charon were exceptional climbers, were extremely stable on their feet, and the claws on both their hands and feet made deadly weapons capable of damaging almost any material. An extremely powerful species, they were also able to lift objects which were far too heavy for most other species."},{"type":"paragraph","text":"Charon had mandibular chelicerae at the sides of their small mouths and bulging, slit-pupil eyes. They often wore clothing from the waist up, though not always. Because of their large size, Charon found it difficult to hide, although they could move slightly faster than most other species."},{"type":"paragraph","text":"Charon had a large trailing abdomen, capable of spinning strands of sticky webbing, which could be organized into latticework structures that allowed Charon to climb from place to place. They could shoot webs several times a day; the stronger the individual Charon the more times it could spin. They were able to attack an enemy over ten meters away with a strand of webbing, entangling them, or spin a web about two meters around them in all directions. Although it could be broken by blunt objects, blasters and lightsabers were the most effective weapons against a Charon’s webbing."},{"type":"paragraph","text":"Charon had shorter lifespans than most sentient species in the known galaxy, growing rapidly in the first half dozen standard years of their lives. Considered younglings until they were four standard years old, Charon became adults at six standard years. When they reached thirty four years, they were regarded as middle-aged, while those between fifty six and sixty four were thought to be old. A Charon who lived for more than sixty five years old was considered venerable."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20091203184952\/starwars\/images\/thumb\/9\/9c\/Charongg4.jpg\/250px-Charongg4.jpg","caption":"A Charon warrior."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Though most commonly associated with otherspace, the Charon actually originated in realspace. Their precursors were the Charr Ontee of Kathol, sentient arachnoids genetically engineered by the Precursors of Kathol as agricultural workers. After the Rift Disaster, many Charr Ontee ships were \"flipped\" into otherspace. The Charr Ontee stranded in otherspace found a new home, and eventually gave rise to the Charon."},{"type":"paragraph","text":"Their new home system was close to a black hole, which threatened to drag their homeworld into its gravitational clutches. Due to its proximity to a black hole, the new planet of the Charon was cold, dark and barely habitable, for the gravity of black holes was so great that it could even suck light into it. Only the Charon knew the exact location of their world, and no-one ever learned its name."},{"type":"paragraph","text":"In the face of imminent destruction, a death-worshiping religion arose. The Charon Death Cult, or Cult of Death, held that as all life must eventually return to the Void of Death, it was the holy duty of the Charon to speed all life towards this end. All life, including the Charon themselves, was viewed as blasphemy. They were led by the Prophet of the Void."},{"type":"paragraph","text":"Shortly before the death cult became influential on their home planet, a stardrive was developed by the Charon. Instead of utilizing it to escape their doomed world, the Charon death worshipers annihilated their home planet and all non-believers, and used the stardrive to disperse throughout Otherspace, exterminating any lifeform they came across. As they spread through their galaxy, the Charon massacred and eradicated all life they came into contact with. However, the Charon never discovered the secret of hyperspace travel, and could never leave otherspace. Imperial sentientologists later stated that if the Charon death worshipers had discovered hyperspace, the consequences on the Empire’s galaxy would be severe, and that a war far more devastating than the Galactic Civil War may have broken out."},{"type":"paragraph","text":"Charon technology was based on specially grown organisms rather than machines or computers. The Charon differed from the Yuuzhan Vong in that they had no objection to using mechanical or electronic devices when available. Standard Charon technology did not include hyperdrives, however, thus confining the species for the most part to Otherspace. Examples of this unique biotechnology were stored in Emperor Palpatine's secret Mount Tantiss facility on the planet Wayland."},{"type":"paragraph","text":"Just prior to the Battle of Endor in 4 ABY, a Charon splinter group calling themselves the Cult of Light secretly constructed the Charon’s first ever hyperdrive. Many Charon, disillusioned with the savage ways of the Cult of the Void, left the Charon Galaxy to find a new life. Each new hyperdrive produced gave hope to hundreds of Charon eager to escape otherspace, and the Cult of Light, which sought to mingle with other species and maintain peace, began to search for uninhabited worlds to colonize and transport Charon to. The Cult of Light, led by a Charon dubbed the Illuminated One, managed to remain secret from the Cult of the Void until the destruction of Coruscant by the Yuuzhan Vong in 27 ABY. The Prophet of the Void then began to hunt down suspected members of the other faction; however, the Cult of Light were able to keep the secret of hyperspace out of the death worshipers clutches, thus saving the galaxy from another costly invasion."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"After the Cult of the Void gained complete power over the Charon people, their leader, the Prophet of the Void, became the supreme dictator of all of otherspace, and his orders were followed without question. Charon who served the Prophet of the Void believed in entropy, and strove to destroy all life without mercy. During the reign of the Cult, Charon were thought to be emotionless beings with a lust for death, and they believed the free will exhibited by other species was blasphemy."},{"type":"paragraph","text":"Those Charon who defected to the Cult of Light followed the Illuminated One devotedly, and sought to leave their galaxy and create a new, thriving colony of Charon on a more hospitable planet. All Charon, regardless of affiliation and allegiance, were ruthless and extremely determined, pursuing their desires with single-minded determination."},{"type":"paragraph","text":"Those who had encountered the Charon simply thought they were intelligent killing machines. Considered evil by the few spacers in the Outer Rim with any knowledge of them, Charon terrified all sentients they came into contact with, and were extremely powerful and aggressive."},{"type":"paragraph","text":"All Charon technology was based on biological constructs, and although they did not shun or despise mechanical technology, they preferred bio-organics. The process by which these bio-organic materials were created was unknown, however one theory put forward by Imperial sentientologists was that Charon bioscientists surgically modified living beings to create an organic machine that fitted their wants and needs. An alternative theory was that their constructs were genetically engineered, or else a combination of the two possible methods. Although the constructs were essentially living beings, they were said to have no personality or free will. The amount of bio-organics produced by the Charon dropped significantly when the Charon began to slaughter the other beings of their galaxy."},{"type":"paragraph","text":"Charon spoke a bizarre language of the same name, made up of clicks, squeals and various scratching sounds made by rubbing their mandibles together. The language could only be copied by other insectoid species. Written Charon was basically a series of intricate web patterns indistinguishable from decorative shapes."},{"type":"paragraph","text":"Although at least one prophet took a name, Charon serving the Prophet of the Void were never given personal names. Charon belonging to the Cult of Light often took on names while exploring the Galaxy; the names they took were usually influenced by the other species which they had met on their travels. Common Charon names included Fa’chak, H’zish, Ry’shyrr, Sya’kalla and Tin’soth."},{"type":"paragraph","text":"In addition to two castes, Charon produced biotechnological constructs which incorporated Charon and alien biological components. They may also have had additional, rarer castes."}],"images":[]},{"title":"Warriors","level":3,"content":[{"type":"paragraph","text":"This caste looked like eight legged spiders with dark exo-skeletons, allowing them stealthy movement in dark locations. It was this caste that served the cause of the Charon by killing millions in their native dimension. Warriors usually stood upright, and were typically males."}],"images":[]},{"title":"Bioscientists","level":3,"content":[{"type":"paragraph","text":"This caste was smaller than their counterparts with brightly colored cilia on their forelegs, this caste was slower but far more agile than the warriors. This caste was populated by scientists who had mastered the creation of biological constructs which lacked the free will and vitality of other lifeforms. Bioscientists were typically females, and unlike warriors, they wore uniforms. Bioscientists were bred to think in longer term goals than their warrior counterparts, and carried medprobes, diagnostic scanners, plasma scalpels and neuro-replacement chips."}],"images":[]},{"title":"Charon in the galaxy","level":2,"content":[{"type":"paragraph","text":"Though the lack of hyperdrive technology restricted them for the most part to Otherspace, Charon were not unknown in realspace. Incidents of contact were rare enough that as late as the Galactic Civil War, Charon were considered little more than legends. Most of the information on them was gathered from spacer's tales and rumors in cantinas by Imperial sentientologist Obo Rin on behalf of Darth Vader."},{"type":"paragraph","text":"However, a group of Rebel operatives, as well as a group of Imperial prisoners of war led by Grand Moff Ravik, encountered the Charon and their Prophet, Ber'asco. This encounter eventually led to the Battle of Stronghold."},{"type":"paragraph","text":"Another small colony of Charon, consisting of less than three dozen warriors and bioscientists stranded in the galaxy after an unexplained accident was found on Kayri III around the same time. This colony had a Force-dampening sacred artifact called the Void Stone."},{"type":"paragraph","text":"Famous Charon really only existed in the Cult of Light, though a few Charon made allies with other species, mainly acting as bioscientists and warriors. Charon bioscientists constructed weapons, ships, and various other devices from living matter similarly to the Yuuzhan Vong, although no in depth study on their methods ever took place. No Force-using Charon were ever known to exist. Charon members of the Cult of the Light sought to discover and build colonies on uninhabited worlds."},{"type":"paragraph","text":"Ber'asco was a Charon Prophet of the Void, and the commander of the Charon ship Desolate. A mature Charon, he stood over almost meter taller than the average Charon. He wore a natural body armor constructed for him by his bioscientists, and he led the campaign to eradicate the last remaining life in otherspace, dubbing himself the Final Prophet. After extinguishing the last few lives of otherspace, Ber'asco and his Charon warriors captured a stranded rebel ship and learned of another dimension, teeming with life; he made it his goal to annihilate all life there too. With the help of Imperial Grand Moff Ravik, Ber'asco entered realspace, despite the efforts of the Rebel Alliance. When Ber'asco linked with the ship's computer, Ravik's mind entered the Charon's body. In order to survive, Ber'asco took the body of a young Human male named Bane Nothos, and helped the Alliance fight off Ravik and the Charon warriors. Ber'asco, using Nothos's body, later fought with Ravik, and was killed, although he managed to deal a fatal blow to the Moff inhabiting his body."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070303230655\/starwars\/images\/thumb\/4\/43\/Charon.JPG\/180px-Charon.JPG","caption":"A Charon warrior fighting Rebel soldiers at the Battle of Stronghold."},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080830100431\/starwars\/images\/thumb\/b\/b9\/Charon_Ready_for_battle.jpg\/180px-Charon_Ready_for_battle.jpg","caption":"A horde of Charon on Stronghold."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Otherspace","elements":[]},{"text":"Otherspace II: Invasion","elements":[]},{"text":"Endgame","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"The Last Command Sourcebook","elements":[]},{"text":"Mos Eisley Adventure Set","elements":[]},{"text":" Terror From Beyond the Rim on StarWars.com","elements":[]},{"text":"Rebellion Era Sourcebook","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Droids, Technology and the Force: A Clash of Phenomena on Hyperspace","elements":[]},{"text":"Starships of the Galaxy, Saga Edition","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"\"From Page to Screen and Back Again...\"—Star Wars Insider 145","elements":[]}]}],"images":[]}]}