{"sections":[{"title":"Columi","level":1,"content":[{"type":"paragraph","text":"The Columi were one of the oldest sentient species in the galaxy. They were easily recognized by their large heads (which made up over one-third of their approximately 1.75 meter height) and their vestigial arms and legs."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"This highly evolved bipedal species were easily recognizable due to their large cranial cavities. They typically stood 1.75 meters tall, their hairless, noseless heads taking up a third of this height. Another notable feature was their immense black lidless eyes with worm-like veins on their temples. However, their mental evolution had an impact on their physical bodies with their physiques deteriorated. As a result, their boneless arms and legs became appendages that no longer were able to support their own body weight. This was even the case when in their natural low-gravity environment of their homeworld. Thus, their bodies became simply repositories for their lungs, hearts and other invaluable bodily organs. This evolutionary trend also resulted in their vital organs being drawn up towards their cranial activity."},{"type":"paragraph","text":"Modern age Columi were highly specialized organisms with their brains containing four cerebrums and over one hundred lobes with each being dedicated to an independent function. Beyond their brains, the other organ that had developed in importance amongst their kind was their eyes, which were the only link between their highly evolved brains and the world around them. These developed more than being simply photoreceptors as they were able to see all the wavelengths in the electromagnetic spectrum. This had resulted in them being able to \"hear\" through their eyes by detecting and analyzing the frequency of sound or radio waves. This increased development of their visual senses had led to a loss in other organs with them losing their sense of smell, and holding only a vague sense of touch."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Columi originally evolved from herbivorous reptiles who roamed the marshes of the low-gravity planet Columus. These early members of the species made use of buoyont bellies which helped them crawl through the marsh on four webbed feet. In time, they eventually evolved to walk on their hind legs which allowed them to pick fruit from the trees. After a few thousand years, they underwent their next evolutionary step where they began laying their eggs in the trees which better protected them from predators. This gradually led to life entirely within the trees themselves where they began to develop hands instead of claws. In addition, they evolved prehensile tails which replaced the heavy caudal appendage which they dragged around when they were quadrupeds. Following a few centuries, they mastered the use of tools that in turn brought a rapid series of evolutionary developments. They lost their tails and gained the capacity to walk in a bipedal stance and marked their rise to true sentience. In time, they began to mine minerals and other raw materials from the bedrocks which they used to construct cities that were constructed high above the trees and mud that were supported by great pylons."},{"type":"paragraph","text":"Over the next few thousand years, they evolved rapidly in technological advancement and in their own evolution. They quickly developed a technological civilization and, by 2,000,000 BBY and again by 100,000 BBY, interstellar spacecraft. The Columi became one of the first species to develop interstellar travel and were the first to send scouts to explore the far corners of the galaxy. However, their early explorations in search of other civilizations led to disappointing results. Every life-bearing planet they discovered, including Coruscant and Duro, was inhabited by people they considered no better than subsentients and barbarians. To make matters worse, the gravity on other planets was much too high for the Columi’s comfort. The disillusioned Columi abandoned space travel, and retreated to Columus to develop in isolation. It was speculated that the Columi followed the example of the Sharu and checked their expansion to avoid the retribution of the Celestials."},{"type":"paragraph","text":"Over time, the Columi began to develop their minds and their society to the exclusion of their bodies. While their limbs and torsos shrank and atrophied, their brains expanded. They eventually developed highly sophisticated brains, with four cerebrums and over one hundred lobes. Their eyes became highly acute, able to detect most of the electromagnetic spectrum. However, they lost their senses of smell and taste, and became essentially immobile. Eventually, they became utterly dependent on machines, repulsorlift chairs, and droids for mobility and all other physical tasks. These devices were controlled by radio signals generated by the Columi's brain waves. One such device was the Columi mental hoverpod, a vehicle controlled by mental projection. Eventually, the Columi gained sufficient understanding of non-Columi minds to allow the device to be modified to work with other sentients."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20061113175833\/starwars\/images\/thumb\/f\/f4\/Columi_Mental_Hoverpod.png\/200px-Columi_Mental_Hoverpod.png","caption":"A Columi mental hoverpod, a typical example of Columi technology."}]},{"title":"Society","level":2,"content":[{"type":"paragraph","text":"This species devotion to mental pursuits had led to a deep disdain for physical activities with them holding the view that there was no dignity in any activity except those relating to thought. As a result, they often looked down at races that made use of physical forms of labor."},{"type":"paragraph","text":"The Columi government was a democracy, where every Columi had an equal share in decision making. This resulted in policy discussions which dragged on for years. However, when the Galactic Empire turned its attentions towards Columus, the Columi reacted with uncharacteristic swiftness and joined the Imperial cause. Though the Columi feared and despised other, more \"primitive\" sentients, they were willing to lend assistance to the Empire in exchange for being left alone. Many Columi thinkers held positions within the Imperial administration. A minority of Columi went renegade, and lent their intellectual assistance to criminal organizations or even the Rebel Alliance."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20080830093223\/starwars\/images\/thumb\/6\/6c\/Boss_Tosk.jpg\/300px-Boss_Tosk.jpg","caption":"Columi crime lord Boss Tosk attacking an individual with the help of his Repulsorsuit and his two droids"}]},{"title":"Columi in the galaxy","level":2,"content":[{"type":"paragraph","text":"By the latter days of the Galactic Republic, Columus was something of a backwater, with Columi civilization having been overtaken in influence by younger species. Though their technology was up to galactic standard, it was too specialized to attract significant trade. The Columi tried to attract trade by marketing their homeworld as a tourist destination, though the health benefits of Columus' low gravity were disputed. The Columi also had cloning facilities on their homeworld—facilities which were their only means of reproduction—but civilian use of these facilities was restricted during the Clone Wars."},{"type":"paragraph","text":"Boss Tosk, a crime lord operating in the Tapani sector, was perhaps the best known Columi renegade. Despite admitting that they had an ancient civilization, the Imperial sentientologist Obo Rin claimed in his Catalog of Intelligent Life in the Galaxy that the Empire was the first galactic civilization to make contact with the Columi. These claims, revealed to merely be Imperial propaganda, were similar to those he made about the Mon Calamari."},{"type":"paragraph","text":"A droid design team consisting of Columi were hired by Chiewab Amalgamated Pharmaceuticals Company for the creation of the GH-7 medical analysis unit due to their reputation for being logical and efficient engineers."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20091017193458\/starwars\/images\/9\/9f\/PossibleColumi-ZTHR.jpg","caption":"Possible Columi at droidfest."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"Episode I Adventures 5: The Ghostling Children","elements":[]},{"text":" Healthy Vacation Claims Disputed—HoloNet News Vol. 531 56","elements":[]},{"text":"Star Wars Missions 15: Voyage to the Underworld","elements":[]},{"text":"Scoundrel's Luck","elements":[]},{"text":" \"Quest for the Dragon's Tomb\"—Star Wars Gamemaster Screen","elements":[]},{"text":"The Courtship of Princess Leia","elements":[]},{"text":"Zorba the Hutt's Revenge","elements":[]},{"text":"Dark Nest I: The Joiner King","elements":[]},{"text":"Crucible","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Galaxy Guide 6: Tramp Freighters","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"Galladinium's Fantastic Technology","elements":[]},{"text":"Lords of the Expanse","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"A Guide to the Star Wars Univers, Third Edition","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 18","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Xim Week: The History of Xim and the Tion Cluster on Hyperspace","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":" \"Star Wars: The Essential Guide to Warfare: Author's Cut, Part 2 — Ancient Coruscant,\" The Official Star Wars Blog","elements":[]},{"text":"Suns of Fortune","elements":[]},{"text":"Dangerous Covenants","elements":[]}]}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20090903050112\/starwars\/images\/thumb\/4\/4a\/Belgoth%27s_Beacon.jpg\/200px-Belgoth%27s_Beacon.jpg","caption":"The hyperspace beacon Belgoth's Beacon with the face of a Columi"}]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Mama's","elements":[]},{"text":"Outlander Club","elements":[]}]}],"images":[]}]}