{"sections":[{"title":"Covallon","level":1,"content":[{"type":"paragraph","text":"The Covallon were a bestial sentient species rarely seen away from their homeworld. The descendants of swift predatory quadrupeds, the Covallon had a developed capacity for sensing others' emotions, a holdover from hunting in packs. Covallon society developed to an early information technology level by the time of the Galactic Civil War, although most Covallon were comfortable with more advanced technology. The Covallon Dælar vuv Tertarrnek served the Alliance to Restore the Republic as a spy, having been given to Imperial Moff Harlov Jarnek as a pet. From that position vuv Tertarrnek fed the Alliance with strategic information on Imperial troop and fleet movements in the Tandon sector."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Covallon were a sentient species. They were quadrupeds, having evolved from a swift plains-based predator species. They preferred to walk on all four limbs, although they were physically capable of walking upright when the need arose. On all fours, they averaged a height of 0.9–1.2 meters at the shoulder; while standing on their hind legs, they averaged between 1.8–2.2 meters. Their lower limbs ended in three-toed feet, while their upper limbs ended in four-fingered hands; the digits on both hands and feet were tipped with a sharp claw. Their hands were dexterous and capable of fine manipulation. The Covallon also had a long tail."},{"type":"paragraph","text":"The Covallon were largely bald, with a pattern of darker markings across their skin. However, a thick mane of hair grew around their shoulders and upper arms. The Covallon head was bald and had a central, backward-pointing horn. They had two small ears and a blunt muzzle with a jaw filled with sharp teeth, a reflection of their carnivorous nature. A number of thin tendrils grew out of each side of their jaws. Overall, the Covallon had a bestial appearance—at least to Human eyes."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Despite being an ancient species, Covallon society remained at an early information technology level; however, Covallon were also comfortable with more advanced galactic machines and technology. They took a long view of events, preferring to wait out adversity rather than take premature action. They invested a significant amount of time planning things before taking action. The Covallon ancestors hunted in packs. In modern Covallon, that manifested in a strong empathetic ability, enabling them to sense the emotions of others. As a consequence, Covallon worked very well in teams, functioning like a finely-crafted machine."},{"type":"paragraph","text":"Covallon did not feel the need to wear clothing; however, they generally wore clothing of some sort out of protection or for practical purposes. It was common for clothed and unclothed Covallon to mingle freely. The Covallon could understand Galactic Basic Standard. Covallon naming conventions included the use of \"æ\" (the Aurebesh letter Enth) as well as two-part surnames in which the first particle was de-capitalized."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Covallon were an ancient species that evolved from a quadruped predator. They developed a low-level information technology society at which point development largely plateaued. They were rarely seen away from their homeworld, and as a consequence, few beings were familiar with their species. Those Covallon who did venture forth from their homeworld often encountered condescension from more humanoid species, who viewed them more as creatures than intelligent beings."}],"images":[]},{"title":"Covallon in the galaxy","level":2,"content":[{"type":"paragraph","text":"During the Galactic Civil War, the Covallon Dælar vuv Tertarrnek served the Alliance to Restore the Republic as a spy. The Alliance arranged for vuv Tertarrnek to be given to Imperial Moff Harlov Jarnek, ruler of Tandon sector, as a pet. Jarnek was unaware of the intelligence of vuv Tertarrnek and, consequently, became very fond of his \"pet.\" Vuv Tertarrnek accompanied Jarnek almost everywhere, including high-security conferences. From that position, vuv Terkarrnek obtained confidential information relating to Imperial troop and fleet movements within and through the sector, as well as top-priority codes. Vuv Tertarrnek then relayed that information to the Alliance in coded bursts from a long-range, tight-beam communication hidden within Moff Jarnek's palace on Spirador. By 4 ABY, the Rebel Alliance was preparing a plan to arrest Jarken on Spirador, considering him a threat based on the large number of Star Destroyers under his control."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Covallon were created by Stephen Crane for the West End Games sourcebook Cracken's Rebel Operatives, published in 1994. It contained one illustration of a Covallon, drawn by Mike Vilardi."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Cracken's Rebel Operatives","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. III ","elements":[]}]}],"images":[]}]}