{"sections":[{"title":"Cephalon","level":1,"content":[{"type":"paragraph","text":"Cephalons were a long-lived sentient alien species that had ganglionic intelligence, with multiple sub-brains that sent information to a central brain. Cephalons had no visible sensory organs, and to communicate with other beings they had to use computers to translate their thoughts. They also perceived the galaxy in four dimensions, resulting in an inability to specify past or future-tense ideas."},{"type":"paragraph","text":"Cephalons were present in the galactic community by 19 BBY. At least one Cephalon opposed the Empire as a member of the resistance movement known as Whiplash."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Cephalons were a sentient alien species with ganglionic intelligence, meaning that they had a large, sessile, central brain that was connected to multiple semi-autonomous sub-brains. Each of these secondary brains collected information and sent it to the main brain, which was the only intelligence center capable of conceptualization. Cephalons were sessile and globe-shaped, with a random array of tentacles, antennae, and chelae. They had no visible sensory organs common to other species, such as eyes or noses, and they observed their external surroundings by means of electroceptive matrices. They lived in large tanks of sulfate and methane, and their mouth consisted of a baleen plate that strained microorganisms from the tank around it."},{"type":"paragraph","text":"Cephalons were a long-lived species. A Cephalon's consciousness perceived the galaxy in a four-dimensional hypermanifold, seeing time in the way that most other species saw space. Their viewpoint allowed them to predict events in the immediate future with great accuracy. Nevertheless, their sense of time prevented them from specifying past or future tenses. To communicate with other beings, their thoughts had to be translated by a computer and projected onto a monitor. However, because of their complex, four-dimensional perception, computers were often unable to effectively translate their thoughts, and the resulting statements were often very confusing to non-Cephalons."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Cephalons were a part of the galactic community by 19 BBY. Due to their inability to speak, they didn't have a name for themselves, and thus were only called Cephalons—which meant \"head\" in Oldspeak Basic—by the other beings of the galaxy. They were studied extensively by the Galactic Empire, whose scientists managed to detect nine distinct emotional states in Cephalons, of which only three remotely resembled those experienced by humanoids. It was also rumored that an Imperial Inquisitor had driven himself insane trying to understand the fluctuating states of the Cephalons' four-dimensional mind."},{"type":"paragraph","text":"The Cephalon Aoloiloa lived on the galactic capital of Coruscant around 19 BBY. The Cephalon was opposed to the newly-established Empire and joined Whiplash, an underground resistance movement on Coruscant dedicated to helping enemies of the Empire flee the planet. Aoloiloa was visited by two Whiplash members, the Gray Paladin Laranth Tarak and ex-journalist Den Dhur, who hoped to receive the Cephalon's assistance in finding the best route to get their clients offworld. However, due to the Cephalon's complex perception of the galaxy, they were unable to effectively communicate with Aoloiloa."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Michael Reaves created the Cephalons for his 2008 novel, Coruscant Nights II: Street of Shadows, the second installment in the Coruscant Nights trilogy. The species was later mentioned in the novel Shadow Games, written by Reaves and Maya Kaathryn Bohnhoff and released in 2011."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Coruscant Nights II: Street of Shadows","elements":[]},{"text":"The Last Jedi","elements":[]},{"text":"Shadow Games","elements":[]}]}],"images":[]}]}