{"sections":[{"title":"Celestial","level":1,"content":[{"type":"paragraph","text":"The Celestials, also known as the Architects, were an ancient civilization who were present long before the dawn of the galactic community and even the Rakatan Infinite Empire. Whatever was known of the Celestials was the subject of xenoarchaeology. It was theorized by both the Jedi and the Sith alike that the balance between the light and dark sides of the Force was actually under the guidance of the Celestials."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Origin","level":3,"content":[{"type":"paragraph","text":"Almost nothing was known of the mysterious race of aliens, who were also known as the Architects, due to the permanence of their cosmological constructions. They were considered one of the earliest and most potent cultures of their time that were identified by the colossal objects they had left behind. Their identities were considered largely a mystery due to lack of information on them. Evidence of their works led many to determine that the region of space was once visited by these stunningly powerful alien architects. They were noted for being an advanced race that ruled the galaxy, with these beings holding technology that allowed them to construct or even realign solar systems. A number of species were known to have coexisted with this ancient race as far back as 100,000 BBY. These included the Gree, Kwa, Sharu, Columi, Killiks, Humans, and Taung. Races such as the Columi, Gree, Sharu, and Kwa all had contact with the Celestials."},{"type":"paragraph","text":"More than thirty millennia before the Battle of Yavin, this spectacularly powerful species dominated the stars and conscripted the insectoid Killiks of Alderaan to serve as laborers and exploited them in this role. Killiks were seeded up and down the Perlemian to serve as slave-laborers and as servants. According to the Killiks, a connection was present between the Celestials and the group of Force wielders known as The Ones; it was believed that the Force wielders were descendants of the Celestials. Similarly, the Gree, Kwa, and the Rakata acted as servant races to the Celestials alongside the Killiks. Together, they worked to build astonishing technological projects that ranged from the assembly of star systems to the engineering of hyperspace anomalies."},{"type":"paragraph","text":"It was believed that the Architects were the same entities that had forced the Sharu of the Rafa system to enter into a period of intellectual dormancy. A brief expansion period by the Sharu saw their race push Coreward as far as Aargau. This was believed to have attracted the notice of the Celestials. Their presence was believed to have frightened the Sharu into adopting a forced culture of primitivism. where they sought refuge. It was further speculated that the frightened Sharu buried their cities and drained their intellects in a last-ditch effort at escaping Celestial attention. This seemed to be the reason for their race reverting into primitivism. Similarly, it was speculated that the Columi followed the Sharu's example and checked their expansion to avoid the retribution of the Celestials. It was in fact claimed that the Columi had retreated from the stars after encountering the Celestials."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130927221425\/starwars\/images\/thumb\/f\/f6\/CenterpointConstruction.jpg\/200px-CenterpointConstruction.jpg","caption":"Centerpoint Station, created by the Architects"}]},{"title":"Architects","level":3,"content":[{"type":"paragraph","text":"The Celestials were known to have created a number of projects that took place near Corellia, Kessel, and other sites in the eastern disk. Notable achievements of this race included assembling the Corellian system, the Vultar system, the Hapes Cluster, the Kathol Rift, and the Maw black-hole cluster, an unlikely proposition in the case of the latter. The Corellian system was in fact assembled at some unknown point from pre-existing planets that were brought together by a combination of buried planetary repulsors and the hyperspace tractor engine known as Centerpoint Station. It was believed that the Architects were responsible for seeding the Core Worlds with life and in particular with Humans, though some claimed this was the result of the Rakatan empire. These Architects were held to be responsible for populating the worlds in the Corellian system with Drall, Selonians, and Humans. While the Drall and Selonians were believed to be native to their worlds, it was possible that the Human Corellians were transplanted to their world by the Celestials."},{"type":"paragraph","text":"Killiks were believed to have had a hand in the construction of Centerpoint Station, which they called Qolaraloq. In addition, they witnessed the creation of other Celestial wonders such as the Maw and the Vultar system. Killik slaves were also present on Sinkhole Station where they created a pressure seal that was adapted from their own construction techniques that used technology of the station. A suspected Celestial sensory operations complex on Kessel contained planetwide underground machinery tended to by the Bogeys and contained a type of gigantic astronomical observatory detailing the location of gravity wells across the entire galaxy. Their servant races were tasked with the creation of hyperspace anomalies made west of the Deep Core and possibly the barrier surrounding the galaxy. The ancient creature known as the Mnggal-Mnggal claimed to had witnessed the golden age of the Celestials. Speculation holds that the Celestials had crafted the hyperspace anomalies that bisected the galaxy in order to separate and isolate the influence of the predatory creature."},{"type":"paragraph","text":"Around 35,000 BBY, the domain of the Celestials was usurped when the Rakata slave race revolted whereupon they waged a war against the other servant races. Some hypotheses over the hyperspace turbulence in the Unknown Regions also claimed that it was created to serve as a barrier between the Celestials and the upstart Rakata. By 30,000 BBY, the Celestials were nowhere to be found. Their influence had similarly waned sufficiently to allow a new galactic power in the form of the Rakatan Infinite Empire to rise. No trace of their kind was found after the peak of the Rakatan empire. Similarly, the Killiks vanished from the galaxy and relocated beyond the veil of the Unknown Regions which was an act presumed to be attributed to the Celestials. After the construction of Centerpoint Station, it was claimed by the Killiks that the Celestials had grown angry with their Kind and had emptied them from their homeworld of Alderaan. It was theorized that the Celestials drove the Killiks into the Unknown Regions after they devoured their own homeworld and attempted to lay claim to another planet. The Mnggal-Mnggal similarly claimed that it had witnessed the sudden withdrawal of the Celestials from the galaxy in this era."}],"images":[]},{"title":"Legacy","level":3,"content":[{"type":"paragraph","text":"Despite their achievements, little evidence remained of where the Architects came from and what was their eventual fate. Many of their extraordinary works and machines were known to have survived the ages with some races claiming the engineering marvel that was Centerpoint Station was a product of their own civilization. The barren Tion Cluster world of Foran Tutha became famous following the discovery of the Foran Tutha star probe. Scholars debated for centuries on whether the fragments of this ancient starship were a remnant of Celestial, Rakata, or an example of early Core technology. This argument continued for five centuries with the true origin of the probe being unknown. In the years of Darth Plagueis, some believed that the Celestials were a higher order of Force beings that guided the events of the galaxy though many Sith Lords dismissed this theory as such a theoretical line of thinking that had no bearing on their desire to make the subservient to their will since it meant that this was only in the realm of the enlightened elite."},{"type":"paragraph","text":"At some point after the Yuuzhan Vong War, the Jedi Jacen Solo traveled the galaxy to learn from various Force sects. On these travels, he met with the Mind Walkers of Sinkhole Station who offered him to enter into the Pool of Knowledge, but he refused as he did not want to become like the Celestials and hold all the knowledge of the universe. In 35 ABY, the Unu Joiner Raynar Thul stated that the Celestials had emptied Oroboro on Alderaan, around ten thousand Killik generations ago, approximately twenty thousand years in Human time. He also claimed that the Killik Colony had built Centerpoint Station and shortly after the construction of Qolaraloq, the Celestials had become angry with them over an unspecified matter. Later, in 41.5 ABY, Jaden Korr encountered debris from a large structure the creation of which he attributed to either the Celestials or the Rakata."},{"type":"paragraph","text":"Two years later, ancient machinery was discovered on Kessel which prompted Han Solo to wonder if it was a creation of the Celestials. The lowest levels of the planet had massive amounts of this technology, and almost destroyed the entire planet. Afterwards, Grand Master Luke Skywalker and his son Ben Skywalker discovered Sinkhole Station within the Maw Cluster. Ben Skywalker theorized that the Celestials may have constructed Centerpoint Station and created the Maw in order to contain Abeloth, who was believed to have some connection to the Celestials. Sinkhole Station, a similar structure to Centerpoint, also had possible ties to the Celestials. Once there, they discovered the body of a dead Killik slave who was involved in the station's construction. The Mind Walkers would tell a transcended Luke Skywalker that they had invited Jacen Solo to bathe in the Pool of Knowledge, but that he declined, stating it would make him too much like the Celestials."},{"type":"paragraph","text":"After travelling to the Celestial Palace, the Thuruht hive explained what they knew from their hive mind of the Celestials. This led to Raynar Thul wondering whether Abeloth was a member of this mysterious race, though the Thuruht did not know the answer to that question. The Killiks debated on whether Abeloth was the Bringer of Chaos because of the Celestials desires or because she took such a role after defying the wishes of the Celestials. Ultimately, the Thuruht concluded that the true nature of the Celestials could not be comprehended or grasped by a mortal mind nor could one discern their will."}],"images":[]},{"title":"Overview","level":2,"content":[{"type":"paragraph","text":"By the modern age, little was known about the Celestials. Only vague references to the ancient race remained, their appearance unknown, yet it was stated that they had possessed incredible knowledge. These were beings of astonishing power and held a malleable form. One theory held that they were a group of discorporate entities who had perhaps merged themselves with the Force thousands of generations earlier and continued to guide the fate of the galaxy ever since. Some, including the Obroan Instute researcher Insmot Bowen in 1 BBY, believed that the Celestials used advanced technology such as the Cosmic Turbine to move entire planets and stars as well as creating hyperspace barriers in the galaxy. Bowen also noted serpents or vines being common images made by civilizations that encountered the ancient race with these species being destroyed in the contact. It had also been theorized by Bowen that a further legacy of Celestial involvement was the construction of pyramids that the Kwa and Sharu adopted. In addition, Bowen mentioned that the grimoires of the Gree Enclave refer to the Celestials as the Ancient Masters that were undone by curses unleashed by the Soul Hunters that was a name given to the Rakata. These curses were called the Gray Swallowing or Hollower of Beings and Faceless Mouths or Eater of Worlds. His findings concluded that the Celestials disappeared from the galaxy but considered the possibility of their return. Those that believed in this view held that the Celestials were a higher order of intermediaries whose powers were beyond the understanding of mortal beings. The Killiks claimed that the Celestials were in the Force and that the Force users known as the Ones were what Celestials became in time. The Thuruht hive were unsure on whether the Celestials were the kind of beings to hold a plan. Ultimately, they believed that the Force was the dominion of the Celestials and then their power was usurped when the Bringer of Chaos emerged. It was claimed that no objects were more spectacular than those created by the Celestials. They were known for their demonstrable and nearly immeasurable level of power."},{"type":"paragraph","text":"Their technology was said to had been able to move entire star systems with the Rakata's being almost on par with it. Leftover machinery of the Celestials, such as Centerpoint Station and the Cosmic Turbine, had the ability to manipulate gravity on a interplanetary scale. This was done through the use of tractor beams, repulsor pulses and hyperspace wormholes. The gravitic tractor seen on Centerpoint was, in theory, able to move planets or suns and capable of either collapsing or destroying entire solar systems. The hyperspatial anomaly that bisected the galaxy was considered easily within the capabilities of the Celestials. The destructive energy of an Infinity Wave was based on Celestial principles. The suspected Celestial machines on Kessel included an antenna-like super electromagnet that, when activated, spun with such a force that it ripped off the other devices in the caverns from kilometers away and dragged them towards itself as part of a self-destruct process."},{"type":"paragraph","text":"Joiner Raynar Thul claimed that when the Killiks created the Maw, they used the Force to change the state of matter. Leia Organa Solo was skeptical of this claim, accounting for the Killik's muddled sense of history and wondering whether this was more likely a trait of their Celestial masters. In actuality, the Killiks had created the Maw under the instruction of the Son and the Daughter, members of The Ones who joined the hive mind and lent the hives their knowledge and their enormous power in the Force. It is believed that after they completed their labors, the siblings left the hive mind and somehow removed the Force powers that they had shared with the hive."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"\"Hyperspace aliens\" is a fanon nickname of the otherwise undescribed aliens who according to Star Wars: The Roleplaying Game, gave the hyperspace technology to Humans."},{"type":"paragraph","text":"According to The New Essential Chronology, the Rakata were the originators of the technology, from where the Corellians adopted it, although the book refers to the Architects separately from the Rakata, signifying they were only a part of the Architects' \"myth.\""},{"type":"paragraph","text":"In The Essential Atlas, the Architects were equated with the Celestials and several star clusters and astronomical phenomena were identified as being a result of their manipulation. In Darth Plagueis, Darth Plagueis muses on the possibility that the Celestials were the ones who, according to Jedi and Sith legend, merged into the Force to control its path."},{"type":"paragraph","text":"In The New Essential Guide to Alien Species, it is stated that the Rakata are the Architects and were the builders of Centerpoint Station, but this can be attributed to the fact that the Guide came out before much of the new information on the Celestials came out."},{"type":"paragraph","text":"According to Jason Fry's endnotes for The Essential Guide to Warfare, a piece of cut content would have involved a transcript where Dr. Insmot Bowen of the Obroan Institute explained that the barrier west of the Core was a remnant of Celestial technology. In addition, he explained that a war was fought between the Celestials and the Rakata."},{"type":"paragraph","text":"In Part 1 of Star Wars: The Essential Guide to Warfare: Author's Cut, one of the revealed cut concepts, a debriefing that was originally supposed to act as the prologue of the book, dealt with the Celestials, including the Celestial-Rakata War."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"Darth Plagueis","elements":[]},{"text":"Lando Calrissian and the Mindharp of Sharu","elements":[]},{"text":"Star Wars: Rebellion","elements":[]},{"text":"Dark Nest I: The Joiner King","elements":[]},{"text":"Dark Nest III: The Swarm War","elements":[]},{"text":"Legacy of the Force: Betrayal","elements":[]},{"text":"Riptide","elements":[]},{"text":"Fate of the Jedi: Outcast","elements":[]},{"text":"Fate of the Jedi: Abyss","elements":[]},{"text":"Fate of the Jedi: Apocalypse","elements":[]},{"text":"Crucible","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The New Essential Chronology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 29","elements":[]},{"text":"Xim Week: The History of Xim and the Tion Cluster on Hyperspace","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":"\"Apocalypse... Now!\"—Star Wars Insider 132","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: The Clone Wars: Who Are the Jedi?","elements":[]},{"text":" \"Star Wars: The Essential Guide to Warfare: Author's Cut — The Celestials,\" The Official Star Wars Blog","elements":[]},{"text":" \"The Imperial Warlords: Despoilers of an Empire, Part 1,\" The Official Star Wars Blog","elements":[]},{"text":" \"Galactic Architecture 101 and the history of Centerpoint Station,\" The Official Star Wars Blog","elements":[]},{"text":"Suns of Fortune","elements":[]},{"text":"Dangerous Covenants","elements":[]}]}],"images":[]}]}