{"sections":[{"title":"Chironian","level":1,"content":[{"type":"paragraph","text":"The Chironians were a sentient species distinguished by their centauriform anatomy; while their torso, arms and head resembled those of a humanoid, their lower body was that of a four-legged equine. Another distinctive Chironian feature was the two transparent, smooth horns grown each year from the forehead. These horns started as small velvet-covered knobs, which eventually broke through as fully-fledged horns. If the velvet was cut prematurely, the wound could prove fatal. At least some juvenile Chironians were red-gold in color with white spots on their flanks and back; this color darkened with age and the spots faded. Chironians could grow long manes and tails."},{"type":"paragraph","text":"The Chironian species was native to the planet Chiron. This world was located in a portion of the Outer Rim Territories known as the Ash Worlds following the sacking and bombardment of many of its star systems by forces of the Hutt species, circa 24,500 BBY. Thousands of years later, many of the Ash Worlds were interdicted for weapons testing by the Galactic Empire. After the collapse of the Empire, at least one Chironian, Lusa, was kidnapped by the Empire Reborn movement, which sought to revive the Empire under the leadership of Lord Hethrir. Lusa was eventually rescued and reunited with her family. For a time, she joined the radical, anti-Human, Diversity Alliance, until she quit after being exposed to the Alliance's violent tendencies. Lusa sought help from Jedi Master Luke Skywalker, and aided the New Republic in suppressing the Alliance. She later became a Jedi Knight in the New Jedi Order, and was killed while on her homeworld during the brutal Yuuzhan Vong War of 25 ABY to 29 ABY."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Chironians were a warm-blooded,sentient species with centauriform anatomy; that is, they had the head and torso of a humanoid and the lower body of an equine animal. The Chironian lower body had four legs, similar to that of a horse, and each ended in a dainty, cloven hoof. A Chironian could sit down by folding his or her horse-like legs underneath the body. Chironians were tall, and even while sitting in this manner, they could reach the height of a Human adult. A Chironian could also kick backward with both hind legs; this strong kick was sufficient to knock over other beings. A Chironian's pace could vary between a walk, a canter, and a gallop."},{"type":"paragraph","text":"At least some young Chironian had red-gold colored bodies, with white spots on the flanks and back. As Chironians aged, the body color darkened to a rich reddish-brown, like polished cinnamon, and the dappled markings on the flanks faded away. Chironians grew long tails, which they often flicked. The Chironian torso had two arms, which ended in dexterous hands capable of skipping stones across water, administering field medicine, and wielding weapons such as stun sticks."},{"type":"paragraph","text":"The Chironian head had two wide, round eyes, which could be red-gold in color, and could weep. The eyes were lidded and had eyebrows. The Chironian head had a nose with two nostrils, and a mouth with full lips. Chironians grew long, curly manes on their heads, hair which was sometimes grown to nearly waist-length and flowed down their backs. Chironian manes darkened with age to a rich reddish-brown color."},{"type":"paragraph","text":"Each year, the Chironian head grew two horns above the temples. These horns started as small knobs covered by red-furred velvet; a vascular tissue. Once the knobs had grown sufficiently, they broke through the velvet naturally, emerging as transparent horns, as bright as diamond, cool to the touch and with smooth ridges. However, if the velvet was cut artificially, Chironians could die from the injury. Over time, the horns grew long and sharp enough that adolescent Chironians could use them to gore opponents."},{"type":"paragraph","text":"Chironians were strong enough to carry a Human on their backs. Chironians produced a scent that, to Humans at least, smelled of woods and spices. The species had at least one sex, females, and at least some Chironians had the capacity to use the Force."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Chironians expressed emotions through the mannerisms of their hooves: when impatient, they stamped them; when excited, they tapped them in a quick dance, or cantered in a spot. The centauriforms frequently shook their heads and manes, and when angry, their faces flushed a deeper shade. Young Chironians, when frightened, were known to rub or press their velvet-covered horns against the foreheads of other beings to whom they were emotionally close. Chironians could swim, and shook themselves dry after such an exertion."},{"type":"paragraph","text":"Chironians had expressive, husky voices, and could speak Galactic Basic Standard, although some spoke the language with a heavy accent. At least some young Chironians, such as Lusa, a Force-sensitive member of the species, wore no clothing on their bodies, shoulders, torsos or midriffs. In her adulthood, however, Lusa wore a robe on her torso."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Chironian species was native to the planet Chiron. Chiron was located in the galactic east of the Outer Rim Territories, and fell within the borders of the Kiirium Reaches, a portion of the space that was incorporated into Xim the Despot's empire as early as 25,127 BBY. Legends related that, at the order of Kossak the Hutt, many worlds in the region surrounding the Chironians' homeworld were bombarded and poisoned several hundred years later so as to create a desolate buffer between the remains of Xim's empire and Hutt Space to the galactic south. From this destruction, the Chironians' home sector, which they shared with the Abyssins and the Nyny natives, came to be known as the Ash Worlds."},{"type":"paragraph","text":"It was not until 5000 BBY that Chiron fell within territory widely explored by the Galactic Republic, the next major galactic power, although during the Jedi Civil War of 3959 BBY to 3956 BBY, the Chironians' planet fell within Darth Revan's Sith Empire. Chiron was in unaligned territory during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems; however, after the Republic transitioned into the Galactic Empire, many of the Ash Worlds were interdicted and used for weapons testing and other shadowy activities."},{"type":"paragraph","text":"Following the rise of the New Republic in 4 ABY, Chiron fell under its polity. During this time, at least one Chironian was kidnapped as a slave by the Empire Reborn, a secretive movement that sought to recreate the Empire following its defeat by the New Republic. Many years later, during the Yuuzhan Vong War, a conflict between the New Republic and the Yuuzhan Vong, a species of extra-galactic invaders, Chiron was thought to be beyond the reach of the aggressors. However, the Yuuzhan Vong succeeded in sending to their world a pack of voxyn—creatures shaped by the Yuuzhan Vong to be naturally inclined to hunt and kill Jedi. The voxyn beset the Chironian Jedi Knight Lusa while she was running through a meadow and killed the woman."},{"type":"paragraph","text":"By 137 ABY, following the ascendency of Darth Krayt's Galactic Empire against the Galactic Federation of Free Alliances—the New Republic's successor state—the Chironians' homeworld fell within one of only a few areas of the galaxy still under the influence of the Galactic Alliance."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20120523031459\/starwars\/images\/thumb\/1\/1d\/MonCalamariSpace-TEA.jpg\/180px-MonCalamariSpace-TEA.jpg","caption":"Chiron and surrounding star systems"}]},{"title":"Chironians in the galaxy","level":2,"content":[{"type":"paragraph","text":"In 14 ABY, the Chironian Lusa was kidnapped from her family on Chiron at a young age and pressed into service by the Empire Reborn. Lusa and many other children of diverse species were taken to a worldcraft, the Rebirth, owned by the leader of the Empire Reborn, Lord Hethrir. There, Hethrir ostensibly tested Lusa and the other children for Force-sensitivity; however, Hethrir only selected Human children as Force-sensitives in order to reflect the Humanocentric vision of the Empire. The rest of the children were to be sold as slaves to his loyal supporters."},{"type":"paragraph","text":"While on the worldcraft, the Chironian became friends with Jaina Solo, the kidnapped child of the New Republic Chief of State, Leia Organa Solo, before Lusa was eventually sold to a wealthy backer of the movement. Lusa was taken by her new owner to the Crseih space station to witness a decisive ritual to advance the Empire Reborn. However, this plot was foiled and the Chironian girl freed through the intervention of Organa Solo, her husband Han Solo, and the Jedi Master Luke Skywalker."},{"type":"paragraph","text":"Lusa was returned to her family on Chiron; however, the anger and trauma from her experience never passed, and, in 22 ABY, she joined the Diversity Alliance, a fervent anti-Human organization. Over the course of two years, she became radicalized, and carried out various missions for the Alliance, until asked to kill the crew of a scout vessel. Backing out of the mission, Lusa sought help from Master Skywalker on Coruscant in 24 ABY. He invited her to spend some time at his Jedi Praxeum on Yavin 4, where the Chironian reunited with her childhood friend Jaina. Lusa's experience with the Diversity Alliance ultimately contributed to its defeat: she reported to the New Republic Senate on its activities and accompanied a fact-finding mission to its headquarters on Ryloth. Lusa went on to train at the Jedi Praxeum, and attained the rank of Jedi Knight. She became closely involved with fellow Jedi Knight Raynar Thul, but in 27 ABY, during the course of the Yuuzhan Vong War, she visited her homeworld, where she was killed by a pack of voxyn."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090314142229\/starwars\/images\/thumb\/2\/21\/Lord_Hethrir.png\/180px-Lord_Hethrir.png","caption":"Lord Hethrir sold Lusa into slavery."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Vonda N. McIntyre created the Chironian species along with the Chironian character Lusa for The Crystal Star, a novel published by Bantam Spectra in 1994. She left the species unnamed, describing Lusa alternatively as a centauriform and a centaur, after the creature from Greek mythology. Lusa was later used by Kevin J. Anderson and Rebecca Moesta in six books of their young adult series, the Young Jedi Knights, published between 1997 and 1998. Lusa's involvement in the Diversity Alliance was a key driver of the plot in that story arc, but she only made cameo appearances in the succeeding Black Sun story arc. Anderson and Moesta similarly left the species unnamed."},{"type":"paragraph","text":"Lusa received an entry in 1998's Star Wars Encyclopedia, authored by Stephen J. Sansweet, who added that Lusa was from the planet Chiron. In Greek mythology, Chiron was the oldest and wisest of the centaurs. In 2001, Lusa's death was mentioned in Troy Denning's The New Jedi Order: Star by Star, part of The New Jedi Order series, and Denning was the first to identify the species as Chironians. This name has been reiterated in both the article \"Who's Who in the New Jedi Order,\" published in Star Wars Insider 53—which also included the first, partial image of a Chironian, by Dan Veesenmeyer—and in The Complete Star Wars Encyclopedia."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Crystal Star","elements":[]},{"text":"Young Jedi Knights: Delusions of Grandeur","elements":[]},{"text":"Young Jedi Knights: Jedi Bounty","elements":[]},{"text":"Young Jedi Knights: The Emperor's Plague","elements":[]},{"text":"Young Jedi Knights: Return to Ord Mantell","elements":[]},{"text":"Young Jedi Knights: Trouble on Cloud City","elements":[]},{"text":"Young Jedi Knights: Crisis at Crystal Reef","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Chronology","elements":[]},{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. II ","elements":[]}]}],"images":[]}]}