{"sections":[{"title":"Chagrian","level":1,"content":[{"type":"paragraph","text":"Chagrians were a sentient species of amphibious humanoids native to the water planet of Champala."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Chagrians were born as tadpoles in clutches of three or more, and raised in tubs of water in a family's private home. During this time, their arms, legs, and air-breathing lungs were developed. Adult Chagrians were truly amphibious, retaining their ability to breathe underwater while also able to function without difficulty in air. They also possessed acute low-light vision."},{"type":"paragraph","text":"The average Chagrian stood taller than a Human with blue skin ranging in tone from light blue to indigo. They were distinguished by two fleshy growths protruding from the sides of their heads, which they called lethorns. As they aged, the lethorns would thicken. Males also sported two horns growing from the top of their skulls. These were once used in underwater duels to attract a mate, and were seen as a sign of the males' strength and virility. Females lacked the superior cranial horns, but had more pronounced and longer posterior head plates. These could reach halfway down their back. Chagrians also had very long black forked tongues."},{"type":"paragraph","text":"Because of frequent exposure to Champala's oceans, Chagrians lost their sense of taste by adulthood. As a result, they regarded eating as an unfortunate nuisance rather than something to be looked forward to and enjoyed. As they had little interest in eating, Chagrians consumed nutritional substances to replace meals. They carried sensors designed to scan for maximum nutritional value when forced to eat actual food."},{"type":"paragraph","text":"Chagrians had a natural resistance to radiation. This dated back to a period of solar instability coinciding with the early evolution of life on Champala. The entire star system was bombarded with intense radiation, and only those lifeforms most able to withstand the bombardment survived."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20061201134120\/starwars\/images\/thumb\/5\/5e\/ChagrianNEGAS.jpg\/180px-ChagrianNEGAS.jpg","caption":"A male Chagrian."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"As a species, Chagrians were generally peaceful and law-abiding to the point of becoming stoic and obstinate. Many Chagrians were motivated only by basic desires such as sustenance, shelter, and health-care. Chagrian government ensured that every citizen was cared and provided for, so the standard of living for the poorest Chagrian was high compared to the members of other species."},{"type":"paragraph","text":"Education was valued in Chagrian society and many Chagrians would travel off-world for advanced university studies. Most Champala-based Chagrians did not speak Basic, however those who traveled off-world learned it quickly."},{"type":"paragraph","text":"Many Chagrians believed the god-king Aram Acheron would one day burst forth from Logue Rock and lead his faithful to victory over their enemies."},{"type":"paragraph","text":"During times of war, Chagrians would wear red. New Republic lawyer Sul Dekkon often wore decorative spheres--made of materials such as polished ebonium-on the tips of his lethorns."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Civilization on Champala originated in long strips of coastline, where sea levels fluctuated wildly with the tides. Buildings in these ancient cities were entirely submerged at high tide, and Chagrians swam between them. Some multi-story buildings were not equipped with staircases or elevators at all; inhabitants simply waited until high tide, then swam to higher floors. Once the Chagrians made contact with other species, they constructed starports and trade cities on high plateaus accessible by aircar."},{"type":"paragraph","text":"Around 529 BBY, a number of needy Chagrian locals were approached by recruiters sent by Hugo Bartyn. Bartyn wanted amphibian fishermen to settle a new city in Lamaredd and tempted these poverty-stricken individuals with promises of untouched seas in a new frontier. Once they arrived, however, they became slave laborers. A few years later, one of these Chagrians, Sirrik Olyeg, founded the Sailor's Union and was responsible of the liberation of all the slaves."},{"type":"paragraph","text":"During the Galactic Civil War, many Chagrians were moved to join the Rebel Alliance. They applied their aquatic expertise to the liberation of Imperial-dominated water worlds and played a major role in liberating Mon Calamari."},{"type":"paragraph","text":"Champala was one of the first planets to join the Alliance of Free Planets, and later the New Republic, and remained a staunch supporter."},{"type":"paragraph","text":"Chagrians in the galaxy had many different occupations. Mas Amedda served as Chancellor Palpatine's right-hand man during the final years of the Galactic Republic. Sul Dekkon was a Chagrian lawyer who prosecuted the ex-Jedi Tahiri Veila in 44 ABY as one of his most famous court cases. Some Chagrians in Lamaredd obtain certain notoriety, including Sirrik Olyeg; \"Bantha\" Burloo, a large Chagrian bouncer at Miss Mylla's Saloon; and Ackrahbala, also known as \"Crazy 'Bala\", the manager and owner of Ackrahbala's Swoops & Speeders."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In Star Wars: Knights of the Old Republic 1: Commencement, Part 1, there is what appears to be a red skinned Chagrian."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Power of the Jedi","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":" \"Bartyn's Landing\"—Star Wars Gamer 7","elements":[]},{"text":"You Can Draw: Star Wars","elements":[]},{"text":"\"Blaster\"—Star Wars Insider 106","elements":[]},{"text":"The Clone Wars Campaign Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Legacy Era Campaign Guide","elements":[]},{"text":"Star Wars: The Clone Wars Character Encyclopedia","elements":[]},{"text":" Mas Amedda in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Chagrian on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}