{"sections":[{"title":"Cerean","level":1,"content":[{"type":"paragraph","text":"Cereans were a sophisticated and cultured humanoid mammalian species hailing from the planet Cerea in the Mid Rim. They were famed for their extraordinary thinking abilities, made possible by large binary brains housed in tall tapering heads, enabling them to focus on many things at the same time. Aside from this unique feature, Cereans were physically similar to Humans, although they each possessed two hearts, which supplied extra blood circulation to support their brains."},{"type":"paragraph","text":"Cerean males aged more quickly than the females, who had similar lifespans to Humans. Thus, there were fewer males than females. Polygamous marriage was a necessity in order for the species to survive. Each male usually had one primary \"bond-wife,\" and between four and ten \"honor-wives.\""},{"type":"paragraph","text":"Cereans were often found among the ranks of the Jedi Knights, but due to the species' low birth rates, Cerean Jedi were exempt from the Order's vow of non-attachment. One such Jedi, Ki-Adi-Mundi, served on the Jedi High Council during and prior to the outbreak of the Clone Wars."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cereans' enlarged skulls, extending up to twenty centimeters above their foreheads, housed complex binary brains, provided with sufficient blood by an extra heart in their heads. The binary structure of Cerean thinking helped them to ponder two sides of an issue at once. It also enabled them to process information and solve problems rapidly and provided a highly advanced capacity for concentration and meditation. Because of their thoughtful nature, they tended to be calm, rational and analytical, preferring peaceful philosophies and a lifestyle which worked in harmony with nature. Though the quick-thinking Cereans had equally quick reflexes, they were commonly not as well coordinated as Humans. Because of the weight of their enlarged skulls, Cereans often had back problems."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20081013190218\/starwars\/images\/thumb\/9\/90\/Force_adept_TotG.jpg\/180px-Force_adept_TotG.jpg","caption":"A female Cerean Force Adept"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Cereans developed a low–tech society on their homeworld and preferred to live in isolation from the wider galaxy. During the years leading up to the Invasion of Naboo, a generational dispute erupted on Cerea when the younger generation took up a rebellious stance against their low–tech society. Many Cerean youths wished to own such technology as was commonplace in the Galactic Republic, like starships and speeder bikes. This unrest was ultimately quelled by Jedi Knight Ki-Adi-Mundi, who traced the instigator of the movement, Ephant Mon, to Tatooine."},{"type":"paragraph","text":"Many Cereans used specially-forged Kasha crystals as a meditational tool. By focusing one's thoughts while in contact with such crystals, distractions were eliminated, creating an exceptional meditation environment. Cerean Jedi sometimes incorporated these crystals into their lightsabers, providing great focus, even during intense physical combat."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070930185700\/starwars\/images\/thumb\/9\/9e\/KiAdiMundi.jpg\/150px-KiAdiMundi.jpg","caption":"Jedi Master Ki-Adi-Mundi"}]},{"title":"Cereans in the galaxy","level":2,"content":[{"type":"paragraph","text":"Ki-Adi-Mundi served as Jedi Watchman for his home system, though he relinquished this post during the Clone Wars to fellow Cerean Tarr Seirr. When Seirr was also called away, the Cereans were left undefended and their planet was attacked by the Confederacy of Independent Systems. The death toll of the Battle of Cerea reached over one million, and included the family of Ki-Adi-Mundi. This led to the Cereans becoming even more removed from galactic affairs with the rise of the Galactic Empire."},{"type":"paragraph","text":"By the time of the Yuuzhan Vong War, the Cereans had developed a unique Force tradition, known as the Ner Yan. This group used the Force to link their minds, although in a haphazard manner. Ka-Tu-Un was an adept of this tradition and was mistaken for a Jedi by the Yuuzhan Vong."}],"images":[]},{"title":"Appearances","level":2,"content":[],"images":[]},{"title":"Non-canonical appearances","level":3,"content":[{"type":"list","elements":[{"text":"Star Wars: Demolition","elements":[]},{"text":"LEGO Star Wars: The Video Game","elements":[]},{"text":"LEGO Star Wars: The Complete Saga","elements":[]},{"text":"LEGO Star Wars III: The Clone Wars","elements":[]},{"text":"Star Wars Episode I: I Am a Jedi","elements":[]},{"text":"\"The Lesson\"—Star Wars Tales 14","elements":[]},{"text":"Star Wars: Republic Commando: Order 66 game","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Episode I toy line","elements":[]},{"text":"Star Wars: Power of the Jedi","elements":[]},{"text":"Star Wars: Episode I Insider's Guide","elements":[]},{"text":"Star Wars Gamer 6","elements":[]},{"text":"The Dark Side Sourcebook","elements":[]},{"text":"Star Wars Roleplaying Game Revised Core Rulebook","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"\"Who's Who in the Jedi Order\"—Star Wars Insider 62","elements":[]},{"text":"Ultimate Adversaries","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"A Cularin Presence","elements":[]},{"text":"The Resistance Within","elements":[]},{"text":"A Revelation","elements":[]},{"text":" Profile of an Assassin on Wizards.com","elements":[]},{"text":" Manifesto My Foot on Wizards.com","elements":[]},{"text":"The Official Star Wars Fact File 135","elements":[]},{"text":" \"Hive of the Infidel\"—Star Wars Gamer 8","elements":[]},{"text":"Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide","elements":[]},{"text":" Sneak Preview: Miniatures on Wizards.com","elements":[]},{"text":"\"Unknown Soldier: The Story of General Grievous\"—Star Wars Insider 86","elements":[]},{"text":"\"Order 66: Destroy All Jedi\"—Star Wars Insider 87","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars Roleplaying Game Saga Edition Core Rulebook","elements":[]},{"text":"Rebellion Era Campaign Guide","elements":[]},{"text":" Star Wars Galaxy Series 5","elements":[]},{"text":" Star Wars Galaxies Trading Card Game – Champions of the Force","elements":[]},{"text":" Ki-Adi-Mundi in the Databank","elements":[]},{"text":" Tarr Seirr in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":" The Creatures of Episode III on StarWars.com","elements":[]},{"text":"Star Wars: Obi-Wan Kenobi, Jedi Knight","elements":[]},{"text":"Star Wars: The Legendary Yoda","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]},{"text":" Jedi Order in the Encyclopedia","elements":[]}]}],"images":[]}]}