{"sections":[{"title":"Coynite","level":1,"content":[{"type":"paragraph","text":"Coynites were a sentient species from the planet Coyn."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Coynites were large bipeds, and typically quite strong. They had fine gold, white, or black hair over their entire bodies. Their heads were crowned with a shaggy mane, with bony forehead ridges in place of eyebrows. Their faces possessed protruding chins, wide flared noses, and deep set eyes. They possessed clawed hands."},{"type":"paragraph","text":"Coynites could conceivably live up to 250 standard years, but their warrior culture resulted in an average life span of a mere 53 years. Coynites reached physical maturity in their early twenties. Coynite children were born in var'sairk (birth-group or litter; capitalised when referring to noble families) of two to six children. All children of a litter were of the same sex."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"They spoke the language Coyn, but could learn to speak Galactic Basic Standard or any other language. As a society, they were known for being quite militaristic and feudal in outlook. Their society was highly class-based and rigid."},{"type":"paragraph","text":"Their society was led by a single ruler known as the En'Tra, who made all the major decisions for the planet and its people."},{"type":"paragraph","text":"Nobles were called Ag'Tra. There were 29 Ag'Tra who answered directly to the En'Tra. Each Ag'Tra has at least 58 Kroyn - elite warriors of exceptional honor and status. Each Ag'Tra sent one Kroyn to serve as the En'Tra's bodyguard for one year. Thus, the En'Tra always had 30 Kroyn as a personal eliteguard (one from each noble's holdings and one from the En'Tra's own family)."},{"type":"paragraph","text":"The vast majority of noble families were so appointed thousands of years ago, although every few centuries, a new family would be added to the nobles bloodlines by the En'Tra's decree. It was possible that a family could have its noble status stripped by decree of the En'Tra, but this has never happened. This may be due to the likelihood that the dishonored family would attempt to unite disgruntled factions and lead a revolution; few En'Tras have felt secure enough in their power to risk a full-scale civil war. To help prevent this kind of war the Coynites followed a law called the En'Tra'Sol (King-Law), a ridged code of conduct for all Coynites to adhere to."},{"type":"paragraph","text":"En'Tra'Sol was an extraordinarily strict code, forbidding virtually any display of \"weakness\" - cowardice in battle being the primary example of this. While subterfuges and behind-the-scenes skulking were not a permissible part of Coyn life, nobles were permitted to indulge in a little political wrangling, and some of this involved setting up unfavorable circumstances for rival nobles, or even large battles with uneven odds. Even so, if any hard evidence of such behind-the-scenes planning came to light, the noble would be branded af'harl. In an extreme case, the entire noble family could be branded af'harl, in which case a new family from within that territory would be selected to be the new noble bloodline. Those who broke this code were known as af'harl, and lost all standing in Coynite society. Most Coynites would rather die in battle than flee and be branded af'harl. Any Coynite who was labeled as such were to be hunted down and killed or enslaved without repercussion."},{"type":"paragraph","text":"En'Tra'Sol also dictated that the length of mane was directly related to social status. The more respected and successful a warrior, the longer the mane and the more intricate the braids. The type of braid was also indicative of family and Ag'Tra that the Coynite swore loyalty to."},{"type":"paragraph","text":"Coynites valued long hair, since in their culture long hair was a sign of great combat ability and honor. Aliens with long hair or shaggy coats (such as Wookiees) were treated with respect. Beings who were bald, or hairless, were shunned as deformed beings."},{"type":"paragraph","text":"Because of their code of honor and a society which prized strength, Coynites saved displays of affection for their own families in private surroundings."},{"type":"paragraph","text":"Coynite names and words had an important social and status depending on the way they were written. Names were not just words, but stories. By literally translating the meaning of the phrases, it was often possible to know the history of an item, a person, or a location. The longer the name, the more honored a being was or more noble their family. However, Coynites seldomed use their full names except when first establishing who had higher standing, such as upon first meeting. As a concession to off-world customs, Coynites would allow aliens to use shortened versions of names, but only if the alien confered the appropriate level of respect upon the Coynite. To deride an object of great importance or be disrespectful was an unforgivable offense. Many Coynite warriors of noble birth had very long names, which an example might be translated as \"Trel'tak, honorable warrior who defeated a noble of higher standing, of Clan Muls'rak, leaders of the War of Unification\". When syllables of a Coynite name are capitalised, it meant that the object, place or person was worthy of great respect. All things associated with the En'Tra are always capitalised. Likewise, proper names were capitalised. Some phrases or names were never capitilised; this indicated a relationship with af'harl."},{"type":"paragraph","text":"The Coynites found Jedi to be fascinating. The Coynites never doubted that the Jedi were powerful warriors, with their own code of honor, not unlike themselves. However, Jedi were supposed to find peaceful resolutions, and use violence only as a last resort. This dichotomy baffled the Coynites, but they continued to respect the Jedi nonetheless."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080830103527\/starwars\/images\/thumb\/8\/82\/Coynite_PG3.jpg\/250px-Coynite_PG3.jpg","caption":"Coynite warriors fighting."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"During ancient times, the Coynites were on the verge of extinction. A Coynite named Toral, considered to be the strongest and most influential member of his clan, began to unite Coynites from across the planet to bring peace and stability to their world. Eventually, he was able to unite all the clans, banished the use of biological weapons, and became the first En'Tra. He created the En'Tra'Sol code, which would govern Coynite society for the rest of its history."},{"type":"paragraph","text":"Toral's son, Arl'Toral, continued his reign and furthered his quest for planetary peace."},{"type":"paragraph","text":"During the time of the Galactic Empire, the Ag'Tra were split regarding their loyalties. Of the 29, 9 were sympathetic to the Empire, 5 were sympathetic to the Rebellion, and the remaining 15 were neutral. Zal Tuag Th'Trar was an Ag'Tra who supported the Rebellion, while his rival, Zal Afreg Kt'Aya, supported the Empire."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20120505135605\/starwars\/images\/thumb\/2\/28\/Coynite.jpg\/250px-Coynite.jpg","caption":"Tra'Parr'Sratt, an honored Coynite warrior, on Coyn"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" Proposed Galaxy Gladiator Federation Falling Apart—HoloNet News Vol. 531 53","elements":[]},{"text":"\"Out of the Cradle\"—Star Wars Adventure Journal 2","elements":[]},{"text":"\"When the Domino Falls\"—Star Wars Adventure Journal 3","elements":[]},{"text":"\"Uhl Eharl Khoehng\"—Star Wars Adventure Journal 8","elements":[]},{"text":"\"Special Military Unit Intelligence Update\"—Star Wars Adventure Journal 15","elements":[]},{"text":" Star Wars Galaxies: An Empire Divided","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Planets of the Galaxy, Volume Three","elements":[]},{"text":"Galaxy Guide 11: Criminal Organizations","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"Operation: Elrood","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Cradle Law","elements":[]},{"text":"Mercenary Guild of Coyn","elements":[]},{"text":"Rols'Kus","elements":[]},{"text":"Tris","elements":[]},{"text":"Coyn language","elements":[]},{"text":"Tawws'Kroyn","elements":[]}]}],"images":[]}]}