{"sections":[{"title":"Croke","level":1,"content":[{"type":"paragraph","text":"The Croke were a species of sentient, multi-legged beings who were extremely long lived; one individual enjoyed a lifespan of more than 20,000 years. In their natural form, the species resembled bristly-legged snails that were diminutive enough to be held in a Human hand. However, Croke were naturally skilled in illusion casting, a Force ability that allowed them to appear in larger guises."},{"type":"paragraph","text":"The Croke developed on a planet known as Crakull in the Unknown Regions and colonized a larger area of the Unknown Regions known as the Croke Reach. They had a reputation in the galaxy for being unpleasant and vicious. At one point, the Croke fought a long and debilitating civil war. The destruction worsened greatly when one of the factions introduced a voracious species known as the Lugubraa—commonly employed as mercenaries in the Unknown Regions—as a weapon into the Reach's worlds. Many Croke-settled planets, such as Explume Minor, were destroyed by the Lugubraa, whose unfettered reproductive rate led them to feed voraciously. To wipe out the invasive species, the Croke purchased a genetically modified strain of Lugubraa, known as blind berserkers, from the cloners of Kamino. These clones, however, proved to be just as problematic as the original Lugubraa, and caused further devastation to the Croke Reach. The Croke species was nearly wiped out."},{"type":"paragraph","text":"One Croke, Rokur Gepta, left his homeworld and began a reign of terror in the galaxy. Gepta massacred a group of mystics known as the Sorcerers of Tund and later allied himself with the ruler of the Galactic Empire, Emperor Palpatine, who gave Gepta control of an area of space known as the Centrality. Gepta came into conflict with the smuggler Lando Calrissian, whom the Croke swindled into doing his bidding. The young smuggler eventually turned on Gepta and cost him control of a powerful artifact known as the Mindharp. After Calrissian became trapped by an Imperial blockade, Gepta attempted to kill him and all members of a species known as the Oswaft with a biological weapon. Gepta's plans were foiled on both accounts, and Calrissian personally shot the Croke and crushed him to death."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Croke were tiny compared to most other sentient species; an individual could fit into a Human hand, and no member of the species grew larger than a Wookiee's fist. The beings were either arthropods or mollusks, and their appearance was grotesque and unattractive by Human standards. The Croke body resembled that of a snail or slug, with oily skin that ranged from black to gray. A Croke crept about on spindly, hairy, black legs; a single individual might have sported as few as a dozen or as many as several thousand such appendages. As tiny creatures, Croke were vulnerable to being squashed by larger beings, and they exuded a greasy slime when crushed. Croke were able to survive in a vacuum for extended periods. At least one member of the species lived an extremely long lifespan; he died from injury after reaching more than 20,000 standard years of age."},{"type":"paragraph","text":"Croke had a natural ability to disguise themselves behind illusions. The mechanics of this power were ill understood by members of other species—one point of contention was whether such illusions merely affected the minds of living beings or were also able to fool electronic sensors. In reality, the power was based on manipulation of the Force. With this natural ability, the Croke were masters of disguise, able to hide their true form indefinitely and able to trick even the most keen minds and perceptive targets. Indeed, no one viewing a Croke in illusory form was able to penetrate the disguise unless the Croke became stunned or lost consciousness. Using such natural camouflage, a Croke could take on the shape or appearance of anything up to three meters in height. A Croke did not need to appear identically to all who saw the illusion maker; the Croke might spin separate illusions for different viewers simultaneously. For instance, the Croke Rokur Gepta presented himself as a dwarf to some who encountered him, and as a three-meter giant to others. Such illusions fooled all of their target's senses, making such disguises seem completely real even to touch. Nevertheless, such disguises did not grant the Croke additional strength, speed, or other abilities. Camouflaged Croke had to be physically present somewhere within an illusory form; an individual might appear to be Humanoid and hide in the form's foot, for instance. Only damage sustained in the region where the Croke's physical body was located affected the actual Croke. Despite such disguises' artifice, Croke were able to wield weapons and objects as if their illusory form were real. At least some members of the species also were able to disguise smaller objects, such as Croke young."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Croke homeworld was the planet Crakull in the Unknown Regions. The species also occupied a group of Unknown Regions worlds known as the Croke Reach. Explume Minor was one such planet. These Croke settlements could communicate with one another via transmissions. Croke settlements protected their young, who were referred to as \"nestlings,\" and certain individuals in Croke society were known as shell conjurers. The species was in contact with groups who lived beyond the Croke Reach, such as the Kaminoans."},{"type":"paragraph","text":"Groups who knew of the Croke considered them one of the many dangers of the Unknown Regions. The diminutive beings were known to have vicious personalities characterized by mean-spiritedness and blatant pursuit of personal ends. Croke compensated for their tiny size with their natural mastery of the Force and the casting of illusions over their true form. The species spoke a language also known as Croke, although individuals were capable of learning to read and write languages such as Basic, Sith, and Tundan as well. Some Croke swore hexes when vexed."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Croke expanded from their homeworld, Crakull, to occupy multiple worlds within an area that came to be known as the Croke Reach. During this expansion, the species came into contact with non-Croke, including the cloners of Kamino. For several decades, the Croke resisted incursions into their territory by the sentient entity known as Mnggal-Mnggal."},{"type":"paragraph","text":"Approximately 300 years before the Galactic Civil War, the Croke were engaged in a civil war of their own. Some factions employed biological weapons in the form of a species known as the Lugubraa, hulking creatures whose natural fecundity and unvarnished appetites led them to overwhelm entire ecosystems. The Croke who employed these weapons unleashed small populations of Lugubraa on planets controlled by their rivals. The tactic proved too successful, and the diminutive species found itself faced by hordes of Lugubraa long into the period after the Battle of Yavin. Facing the extinction of their very species, the Croke eventually solicited the aid of Kaminoan cloning experts to engineer a genetic variant of the Lugubraa that might wipe out the hordes menacing Croke worlds. The Kaminoans provided a soldier type known as the \"blind berserker.\" Nevertheless, this new force, dubbed the \"Leech Legion,\" proved just as destructive to Croke settlements. At some point during these campaigns, Lugubraa attacked the planet Explume Minor. Shell Conjurer Firtha sent a transmission to order the Croke to cloak and evacuate their nestlings before his transmission cut out."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110111192937\/starwars\/images\/thumb\/3\/3a\/Lugubraa-tur.jpg\/180px-Lugubraa-tur.jpg","caption":"Croke factions employed Lugubraa mercenaries during a civil war and nearly wiped themselves out."}]},{"title":"Crokes in the galaxy","level":2,"content":[{"type":"paragraph","text":"Some Crokes left the bounds of the Croke Reach and made their way into the known galaxy. Such members of the species typically used their natural abilities of camouflage and disguise to their advantage so as to conceal their true form from outsiders and pass unnoticed among them. One of the more notorious members of his species to leave the Unknown Regions was Rokur Gepta, who regularly presented himself as a 1.8-meter-tall humanoid dressed in gray robes and a turban, an outfit that left only his eyes exposed. Gepta infiltrated a group of mystics known as the Sorcerers of Tund in 5 BBY, learned their secrets, and then wiped them out. Gepta came to the attention of Galactic Emperor Palpatine, who allowed the sorcerer free reign in the Centrality region and special power over the local representatives of the Galactic Empire in exchange for arcane knowledge that Gepta had learned from the sorcerers."},{"type":"paragraph","text":"Nevertheless, Gepta was unsatisfied and desired to rule the whole galaxy. To that end, he sought a powerful artifact called the Mindharp. In his quest, Gepta enlisted the aid of a Human gambler named Lando Calrissian. When Gepta was betrayed by his lieutenant, Duttes Mer, the Croke blamed Calrissian for this failure and attempted to take out his vengeance on the gambler. After killing a wealthy man named Bohhuah Mutdah, Gepta impersonated him as he sent Calrissian on a drug-running mission to the asteroid Oseon 5792. There, the sorcerer tortured his nemesis, but the Human escaped. Rokur Gepta next pursued his target to the ThonBoka nebula. There, the sorcerer threatened to destroy a species known as the Oswaft with a biological weapon unless Calrissian agreed to a face-to-face duel. Calrissian reciprocated, and Gepta confronted Calrissian in the vacuum of space, both combatants clad in flight suits. Calrissian shot the Croke's illusory form in the ankle, where Gepta's actual body was located, and then crushed the Croke in his hand."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100607015257\/starwars\/images\/thumb\/6\/66\/LandoGepta.jpg\/180px-LandoGepta.jpg","caption":"Lando Calrissian faced the Croke Rokur Gepta, who was disguised as a tall humanoid in a turban."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Author L. Neil Smith created the Croke for his Lando Calrissian trilogy of novels: Lando Calrissian and the Mindharp of Sharu, Lando Calrissian and the Flamewind of Oseon, and Lando Calrissian and the Starcave of ThonBoka, all published in 1983. Gepta maintains an illusory form through most of Neil's trilogy; his true form is only revealed during the climax of the third book during his final confrontation with Calrissian. Later sources, such as The Dark Side Sourcebook (2001) and The Unknown Regions (2010), have expanded on the Croke and their history. For example, The Dark Side Sourcebook, written by Bill Slavicsek and J. D. Wiker for the Star Wars Roleplaying Game from Wizards of the Coast, includes game statistics for the species. These rules refer to the species' natural illusion-making power as \"Croke illusory presence.\" The book also grants Croke characters bonuses to all uses of disguise or illusion. Meanwhile, The Unknown Regions establishes the Croke's relations with the Lugubraa in a section written by Daniel Wallace. In an entry for his blog, Wallace lamented that he did not have the opportunity to expand on the Croke further."},{"type":"paragraph","text":"Another roleplaying book, 2009's Jedi Academy Training Manual, written by Eric Cagle, Patrick Stutzman, Rodney Thompson, and Robert Wieland, claims that all members of the Sorcerers of Tund were Croke, a statement that conflicts with other sources. For instance, a web enhancement written by Abel G. Peña for the 2008 book Knights of the Old Republic Campaign Guide introduces a Sorcerer of Tund named Karnak Tetsu who is a Sith Offshoot. Similarly, The Essential Atlas (2009) implies that when Rokur Gepta infiltrated the Sorcerers of Tund, they did not know he was a Croke. Finally, The Jedi Path: A Manual for Students of the Force (2010) claims the Sorcerers descended from pure-blooded members of the Sith species. This article follows these later sources and assumes that the Jedi Academy Training Manual is in error."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Lando Calrissian and the Mindharp of Sharu","elements":[]},{"text":"Lando Calrissian and the Flamewind of Oseon","elements":[]},{"text":"Lando Calrissian and the Starcave of ThonBoka","elements":[]},{"text":"Rebel Dawn","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Chronology","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"The Dark Side Sourcebook","elements":[]},{"text":"\"Unseen Planets of Episode I\"—Star Wars Insider 56","elements":[]},{"text":"The New Essential Guide to Characters","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Jedi vs. Sith: The Essential Guide to the Force","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Jedi Academy Training Manual","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"\"Authors of the Expanded Universe: L. Neil Smith\"—Star Wars Insider 145","elements":[]}]}],"images":[]}]}