{"sections":[{"title":"Cilare (species)","level":1,"content":[{"type":"paragraph","text":"The Cilare were a species of humanoids that subscribed to martial values. Around 25 ABY during the Yuuzhan Vong War, their homeworld was invaded by the Yuuzhan Vong who exterminated the entire species except for Arbeloa during a one-sided engagement."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cilare were a tall humanoid species with powerfully-built bodies. They had yellow skin and brown hair. Their facial features were broad yet in most ways similar to that of a Human."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Cilare society was built solely around warfare, and they valued strength more than anything. They instilled martial values in their children from birth, and trained them to fight as soon as they were physically able, even pitting them against much larger opponents. Their scientists disdained medicines in favor of war matériel. Despite being primitive in many aspects, including wearing metal armor and fur garments derived from a canine species, they also possessed advanced weaponry, such as blaster rifles, tanks, and holoprojectors."},{"type":"paragraph","text":"They also spoke Basic, alluding to at least some contact with other sentient species."},{"type":"paragraph","text":"The Cilare believed themselves to be strong and impregnable to any threat since they had mastered all native predators on their homeworld."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20091009095025\/starwars\/images\/thumb\/a\/a7\/SWICanine.jpg\/150px-SWICanine.jpg","caption":"Training of a Cilare youngling."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Completely isolated from the galaxy for their history, the Cilare's isolated existence came to an end with the break-out of the Yuuzhan Vong War in 25 ABY. Following the Battle of Dantooine, a large Yuuzhan Vong invasion force landed on their world and immediately began to wage war on the warrior species. The Cilare gladly met this threat head-on, assembling their armies and marching toward the invasive threat. Despite their strength and their experience, however, they were easily wiped out by the onslaught of the Vong's Fire Breathers."},{"type":"paragraph","text":"The warrior species were quickly exterminated as the Yuuzhan Vong pacified their homeworld. Only one warrior, Arbeloa survived to tell the story, and transmitted a signal before he was taken captive aboard a Yuuzhan Vong slaveship Tsam P'ah. During his captivity, the signal was eventually picked up by the two-men crew of the exploratory ship Pythea—the Chiss Panha and her Wookiee companion Sarkkin. Panha and Sarkkin listened intently as the warrior related the nature and culture of his species before going to warn them of the depredations of the Yuuzhan Vong."},{"type":"paragraph","text":"The warrior's species had been devastated in the attack; he urged recipients of the message to flee the oncoming Yuuzhan Vong invasion force while they still could, as attempting to fight the species was futile. Given that Panha's species, the Chiss, had fought the Yuuzhan Vong before, she understood the nature of their threat to the galaxy. Picking up the presence of a Yuuzhan Vong fleet near them in hyperspace, they powered up the Phythea and fled to the nearest world Artorias in an attempt to warn the Artorians."},{"type":"paragraph","text":"Despite their warning, they were pursued by Yuuzhan Vong vessels, who quickly caught up with them. The Chiss explorer attempted to communicate with Artorias, but the message was intercepted by an advance infiltrator, who ensured that it did not get through. After fighting off a Yuuzhan Vong boarding party, the two friends agreed they would not face capture and drove their starship into the prow of the Yuuzhan Vong cruiser, immolating themselves and their vessel."},{"type":"paragraph","text":"Later, Arbeloa joined forces with the Artorian princess Kaye Galfridian and other slaves to revolt against the commander Sha'kel."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20091009095345\/starwars\/images\/thumb\/0\/0d\/WarSpec1.jpg\/200px-WarSpec1.jpg","caption":"A Cilare shows his hunting prowess."},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20091009095702\/starwars\/images\/thumb\/c\/cd\/WarArmy.jpg\/250px-WarArmy.jpg","caption":"The Cilare go to war."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Invasion 0, Part 1","elements":[]},{"text":"Star Wars: Invasion 0, Part 2","elements":[]},{"text":"Star Wars: Invasion: Refugees 4","elements":[]},{"text":"Star Wars: Invasion: Rescues 6","elements":[]},{"text":"Star Wars: Invasion: Revelations 1","elements":[]},{"text":"Star Wars: Invasion: Revelations 2","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Jason Fry's tumblr account - EG to Warfare Endnotes Pt. 15","elements":[]}]}],"images":[]}]}