{"sections":[{"title":"Codru-Ji","level":1,"content":[{"type":"paragraph","text":"The Codru-Ji were a race of four-armed humanoids that inhabited the planet Munto Codru. Born as six legged canines known as Wyrwulves, they encased themselves in a cocoon at puberty, emerging weeks later as a two meter tall adult humanoid. Codru-Ji slept standing up, and communicated on a hypersonic level."},{"type":"paragraph","text":"As their homeworld had very few significant exports, the Codru-Ji were able to stay isolated from the affairs of the Galactic Empire and the New Republic. This allowed them to concentrate on their own complicated internal politics. Leading Codru-Ji families were often the target of \"coup abductions\", ritualized kidnappings of children by political rivals. These abductions almost always ended with the payment of ransoms and the safe return of the children."},{"type":"paragraph","text":"Ornate stone castles were scattered across Munto Codru. These castles were produced not by the Codru-Ji, but by an unknown extinct civilization. Many Codru-Ji avoided these castles, considering them to be haunted. However, they were sometimes used as provincial capitals."},{"type":"paragraph","text":"In 137 ABY, the citizens of Munto Codru were forced to join their tribes under the rule of the Empire controlled by Darth Krayt of the One Sith. A Sith Lord named Darth Kruhl personally visited the planet to coerce the Codru-Ji leaders into accepting Imperial rule and assassinate any opposing figure."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Codru-Ji had a highly differentiated two-stage life cycle separating adults from adolescents. Codru-Ji children were born as meter long canids with the six limbs that were distinctive of all Codru-Ji. These pups, known as Wyrwulves, were frequently mistaken by outsiders as no more than family pets, an impression aided by their inability to speak in anything more than snarls and growls. The juveniles were sociable, often licking guest as a sign of greeting, however, they could also deliver a strong bite to deter attackers. Wyrwulves were given affectionate nicknames such as \"Hrika\" or \"Lirri\" and did not receive their real names until adulthood. Wyrwulves mature for 8 years before entering a cocoon. They remained in this rubbery blue cocoon for a period of a few weeks before emerging in adult form."},{"type":"paragraph","text":"Adult Codru-Ji appeared as humanoids, albeit with four arms. They lost the thick pelt of their earlier form, but retained other features such as their strong skin. Codru-Ji hearing extended to a supersonic level undetectable to many species. The mature form averaged 1.6 meters in height. Of their four limbs, Codru-Ji had one primary hand, with which they were most skilled. The remainder were “off hands”, though still utile. An unusual trait of the Codru-Ji was that they slept standing upright. They developed sleeping harnesses to secure adults in this position. Adults could learn quickly using one hand they could then duplicate their ability with all their limbs. They could go days without food and water and had senses that allowed them to scan the surrounding area."},{"type":"paragraph","text":"Some scientists speculated that the Codru-Ji were descended from a highly advanced, yet extinct, species that left a number of ruins on Munto Codru."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20060329211210\/starwars\/images\/thumb\/c\/c6\/Codru-Ji.JPG\/180px-Codru-Ji.JPG","caption":"Codru-Ji - humanoid form (right), wyrwulf form (left)."},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080912031118\/starwars\/images\/thumb\/c\/cd\/Codru-Ji_clan_leader.jpg\/150px-Codru-Ji_clan_leader.jpg","caption":"A female clan leader in 137 ABY."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Highly xenophobic, Codru-Ji were reluctant to allow members of other species access to their society. Although not particularly afraid of off-worlders, the Codru-Ji were concerned that outside influences would \"rub off\" on their society. Several aspects of their culture, such as ritual kidnapping of children of political rivals, were considered barbaric by galactic standards, and as such the Codru-Ji thought it best to remain removed from the greater galactic scene."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Codru-Ji were created by Vonda N. McIntyre for her novel The Crystal Star, published in 1994 by Bantam Spectra. Since that appearance, their backstory was expanded on in such reference works as The Essential Guide to Alien Species, The Essential Guide to Planets and Moons, and the Ultimate Alien Anthology. After a number of cameo and background appearances in subsequent novels, the Codru-Ji again had a prominent role in the Dark Horse comic Star Wars: Legacy 13: Ready to Die published in 2007."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Anakin: Apprentice","elements":[]},{"text":"Boba Fett: Pursuit","elements":[]},{"text":"The Clone Wars: Wild Space","elements":[]},{"text":"Star Wars Dark Times: Blue Harvest, Part 1","elements":[]},{"text":"Tatooine Ghost","elements":[]},{"text":"\"The Trouble with Squibs\"—Star Wars Insider 67","elements":[]},{"text":"The Crystal Star","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"Edge of Victory: Rebirth","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Legacy of the Force: Inferno","elements":[]},{"text":"Legacy of the Force: Invincible","elements":[]},{"text":"Millennium Falcon","elements":[]},{"text":"Star Wars: Legacy 13: Ready to Die","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Chronology","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Legacy Era Campaign Guide","elements":[]},{"text":" \"Drawing from the Imagination: Mythological Creatures in Star Wars, Part 2,\" The Official Star Wars Blog","elements":[]},{"text":" Hiding in Plain Sight: Star Wars Shapeshifters on StarWars.com","elements":[]}]}],"images":[]}]}