{"sections":[{"title":"Chadra-Fan","level":1,"content":[{"type":"paragraph","text":"Chadra-Fan were short, rodent-like humanoids, usually no more than one meter tall, with bat-like faces. They hailed from the watery planet Chad."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Chadra-Fan had seven different senses—sight, touch, taste, sound, smell, infrared sight, and chemoreceptive smell—all of which were much more acute than Human senses.. They were usually no more than a meter tall, some depicted with plantigrade two-toed feet, while others seemed to have four-toed feet. The metabolism of Chadra-Fan was amazingly fast, allowing them to work almost constantly. They only slept in two hour naps during the day. Because of their metabolism, the average Chadra-Fan matured by age fifteen and rarely lived more than forty years."},{"type":"paragraph","text":"Chadra-Fan had two hearts, but would die in three days if one of the hearts failed."},{"type":"paragraph","text":"Chadra-Fan were covered from head to foot in fur. Their species evolved from small, arboreal rodents. The two different sexes of Chadra-Fan were indistinguishable to other species, though the Chadra-Fan could readily tell the difference using their powerful sense of smell. If a male and a female Chadra-Fan were interested in one another, they released special pheromones that relayed their feelings. Chadra-Fan also had involuntary pheromones that conveyed information about their family line and created an aura of attractiveness. Other voluntary pheromones often conveyed a Chadra-Fan's state of emotion-anger, fear, or joy. Chadra-Fan even created more complex messages using their pheromones, though the pheromones when mixed sometimes caused confusion. They were unique in the fact that they had clear blood."},{"type":"paragraph","text":"The race were small but quick witted creatures that resembled rodents. Their combination of infrared sight, hypersensitive sense of smell as well as keen hearing made them physically and mentally perceptive beings."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20100601204841\/starwars\/images\/thumb\/4\/45\/Chadra-Fan_TUR.jpg\/180px-Chadra-Fan_TUR.jpg","caption":"A Chadra-Fan pilot for Hoersch-Kessel Drive, Inc."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Chadra-Fan culture was greatly affected by the tendency of hurricanes and tsunamis to wash away their bayou homes (as happened in 10 BBY, when a \"Death-Wave\" wiped out much of their civilization). As a result Chadra-Fan slept during the midday in their temporary dwelling that hung from cyperill trees. They all had an instinctive fear of drowning in water. They regarded very few things as permanent, seeking only to enjoy themselves in the moment. Many Chadra-Fan that left their homeworld went to arid planets, in order to escape any chance of drowning."},{"type":"paragraph","text":"Chadra-Fan loved to tinker with mechanical devices, often disassembling and reassembling them into something completely different. Chadra-Fan living in the greater galaxy sometimes worked in industrial research, by creating unique devices which engineers of other species with more conventional talents attempted to duplicate. Their inventions were even considered collectible and pieces of art. Chadra-Fan constructed many of their creations individually, though they were capable of mass-production."},{"type":"paragraph","text":"The Chadra-Fan language relied on the ability of each Chadra-Fan to recognize differences in pitch. If a Chadra-Fan was tone deaf, he or she was unable to speak coherently. Their language also depended on the ability of each to understand pheromone messages."},{"type":"paragraph","text":"It was uncontroversial for Chadra-Fan to move about naked, at least at the during the Galactic Civil War. At the time, many Chadra-Fan wore no clothes at all in public without drawing the attention of bystanders or disturbing them. In contrast, clothed Chadra-Fan were just as common throughout history, with many of them wearing more-or-less elaborate robes."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070415165312\/starwars\/images\/thumb\/d\/d1\/Tekli2.jpg\/160px-Tekli2.jpg","caption":"Tekli, a Jedi Knight of the New Jedi Order"}]},{"title":"Society","level":3,"content":[{"type":"paragraph","text":"The society of Chadra-Fan is divided into a clan structure in which every member was responsible for parenting the clan's children and a fact of life was that every household was open at any time. Leadership within the clan was a temporary role that was passed from one individual to another as the situation called for a particular expertise. Children were the centerpiece of a Chadra-Fan community, and only left when wed, however the new Chadra-Fan couple remained with the smaller clan so it was possible that a Chadra-Fan never left his or her home."},{"type":"paragraph","text":"Chadra-Fan, if left alone, suffered from strong depression that would kill them in a matter of weeks. Thus, Chadra-Fan were not very picky when it came to friends and preferred complete strangers to loneliness. Many Chadra-Fan were taken offworld as slaves, but they took this positively by thinking of it as a big adventure. They were also a jovial race, who almost always got on well with others. Only the most evil acts against them would make them think otherwise. Chadra-Fan were generally excellent team members and were extremely forgiving or so ignorant that they forgot any failings within a group. Chadra-Fan, thus, could be found with various criminals because they were so unobservant or accommodating."},{"type":"paragraph","text":"A deity called the Big Green Fish figured in Chadra-Fan religion."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060519172717\/starwars\/images\/thumb\/b\/b6\/Kabe2.jpg\/150px-Kabe2.jpg","caption":"Kabe, a Chadra-Fan"}]},{"title":"Chadra-Fan in the galaxy","level":2,"content":[{"type":"paragraph","text":"Kabe was an orphan taken in by the Talz Muftak and a regular at Chalmun's Spaceport Cantina."},{"type":"paragraph","text":"Tekli was a Jedi apprenticed to Cilghal. She became a member of the Myrkr strike team during the Yuuzhan Vong War. At the end of the war she became an Magister-in-training for the Yuuzhan Vong on Zonama Sekot. After a few years on Zonama Sekot, she left for the Unknown Regions with other surviving members of the Myrkr strike team and temporarily was a Joiner. After treatments by Cilghal she decided to remain a Jedi."},{"type":"paragraph","text":"Tili Qua was a member of the Jedi High Council in 137 ABY."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 1: A New Hope","elements":[]},{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Dark Force Rising Sourcebook","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"The Movie Trilogy Sourcebook","elements":[]},{"text":"Star Wars: The Power of the Force (1995)","elements":[]},{"text":"Shadows of the Empire Planets Guide","elements":[]},{"text":" Star Wars Customizable Card Game – Jabba's Palace Limited","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"The Essential Guide to Droids","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":" \"Rogues Gallery: Fringers\"—Star Wars Gamer 7","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Star Wars Galaxies: An Empire Divided Quick Reference Guide","elements":[]},{"text":"Star Wars Galaxies: The Total Experience: Prima Official Game Guide","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Art of Star Wars Episode III: Revenge of the Sith","elements":[]},{"text":"Obsessed With Star Wars","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Legacy Era Campaign Guide","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Essential Guide to Characters","elements":[]},{"text":"Fate of the Jedi: Dramatis Personae","elements":[]},{"text":" Star Wars Galaxy Series 5","elements":[]},{"text":" Star Wars Galaxy Series 6","elements":[]},{"text":"The Unknown Regions","elements":[]},{"text":"\"Jedi Archive\"—Star Wars Insider 124","elements":[]},{"text":"\"Rogues Gallery: The Unusual Suspects: Who's Who in Mos Eisley\"—Star Wars Insider 130","elements":[]},{"text":" Star Wars Galaxy Series 7","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" \"The Not-So Magnificent Seven,\" The Official Star Wars Blog","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Chadra-Fan on SWG Wiki","elements":[]}]}],"images":[]}]}