{"sections":[{"title":"Carosite","level":1,"content":[{"type":"paragraph","text":"The Carosites were a mammalian, sentient species who hailed from the planet Carosi IV in the Outer Rim Territories. However, when the star Carosi began to rapidly expand, they were forced to evacuate their entire population to the outer planet Carosi XII and rebuild their civilization."},{"type":"paragraph","text":"Carosites were renowned throughout the galaxy for their medical skills. Their medical academies attracted some of the galaxy's greatest doctors to study and teach, drawn by their significant advancements in the treatment of mental illnesses and in medical droid technology. Carosites were generally pacifists, although on occasion they flew into berserker rages to protect their patients. Their reverence for life and medical acumen culminated in their famous hospital ship, the Sudden Restoration. Throughout the Galactic Civil War, it provided free health care to all, without regard to political affiliation."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Carosites were a species of sentient, humanoid mammals, standing between 1.3 and 1.7 meters tall. Their heads, on unusually long necks, sported long snouts and small beady eyes. Carosites were slim in build and had extremely nimble hands due to the peculiar arrangement of their digits; two opposable thumbs flanked three central fingers. Their bodies were covered in short, fine fur that kept them warm, and they often grew long goatees on their chins. Carosites had particularly acute senses."},{"type":"paragraph","text":"Carosites could only reproduce twice in their lifetimes, on each occasion producing a litter of up to six young. Families were the only social unit in their communities, and often included older relatives unable to live independently. The Carosite lifespan was 120 standard years."}],"images":[]},{"title":"Society and culture","level":2,"content":[],"images":[]},{"title":"Healing and medicine","level":3,"content":[{"type":"paragraph","text":"Due to their infrequent reproduction, the Carosites developed a great reverence for life; each being's life was regarded as sacred. The attitude influenced their society in numerous ways, most particularly in their strong medical tradition. They made advances in the recognition and treatment of mental illnesses, with their sanitariums known for their emphasis on healing the individual rather than confinement. They also made innovations in the field of medical droid programming. As such, upgrading medical droids on the planet Carosi XII cost only a fraction of what it did elsewhere. To maintain their medical facilities, the Carosites traded heavily with the Ebranites for lu-ramin, an oil vital for several of their medicines. Carosites charged for their healing services commensurate to the patients' ability to pay. One distinctive feature of their care was their refusal to install cybernetic enhancements, but they were willing to install prosthetics which did not enhance patients' abilities."},{"type":"paragraph","text":"Carosites enjoyed passing on their medical heritage, so medical academies were established on their planet, such as the Carosi XII Academy of Medicine. These institutions attracted famous doctors, scientists, and surgeons to study or teach. The Carosite language was influenced by such heritage, with medical metaphors commonly used to describe business deals, galactic politics, and other non-medical areas of life."},{"type":"paragraph","text":"Their reverence for life produced a strongly pacifist culture, although an exception was made for the protection of the feeble, the helpless, and their patients. Under such circumstances, Carosites were known to fly into a berserker state, sometimes called a \"life-saving fanaticism.\" Furthermore, the Carosites abhorred any form of interrogation or brainwashing, regarding private thoughts as inviolate. However, a vocal minority argued for more aggressive action against oppressors such as the Galactic Empire. This group called themselves \"The Preventers,\" and argued that assertive action would save lives in the long run."},{"type":"paragraph","text":"The Carosites were aware of the Force, and desired to learn more about it. However, no Carosite was ever trained as a Jedi, as their curiosity revolved around using it to promote healing and recovery, rather than for other purposes. Their attitude toward the Force was typical of the innovative species, some of whom even tried to find ways to harness blaster technology to promote healing."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070502232254\/starwars\/images\/thumb\/2\/2a\/Carosite_with_droid.PNG\/140px-Carosite_with_droid.PNG","caption":"Some Carosites upgraded medical droids."}]},{"title":"Government","level":3,"content":[{"type":"paragraph","text":"The Carosites developed a form of democracy whereby every ten years they elected a leader who held absolute authority. This leader relied on eleven counselors for advice, selected from the species' eleven major families. Carosite society valued truth, and so considered verbal and written agreements completely binding. As a manifestation of their eternal optimism, they extended this expectation to offworlders, who frequently abused such trust and failed to uphold their bargains."},{"type":"paragraph","text":"Carosites disliked alcohol due to its harmful effects on sentients, both in the short and the long term. The disdain led their government to tax liquor sales heavily and minimize the number of liquor outlets on their planet. Their paternalistic attitude led Carosites to frequently offer unsolicited dietary advice. Visitors often regarded such doting as worse than that typical of protocol droids."},{"type":"paragraph","text":"The sole city on Carosi XII was Newlife Point, which was home to most of the two million Carosites living on the planet. The city was established on the shores of the Avuae Sea, where the original refugee ships had landed. The sea was rich in marine life, which provided a good source of protein, and the Carosites were fond of swimming in the icy waters. Just south of this city were a number of hot pools, heated by underground volcanic activity. The hot springs were known to aid in the healing process and so the Carosites linked it to Newlife Point with an underground transrail system."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Carosite species evolved on the planet Carosi IV in the Carosus system, part of the Nembus sector of the Outer Rim Territories. Their homeworld was located near the Hydian Way, a vital hyperlane through that part of the galaxy, and in an area of space that was explored between 5,000 to 3000 BBY. Carosites traveled offworld as early as 3640 BBY, a period that included the Galactic War between the Galactic Republic and the resurgent Sith Empire."},{"type":"paragraph","text":"In 200 BBY, the sun in the Carosites' homesystem began an unusually rapid expansion that threatened their homeworld. The situation led to a major upheaval in Carosite society, and over the course of twenty years, they evacuated their entire civilization to Carosi XII, an ice planet further out in the system. The expanding sun consumed the first five planets of the system and soon increased the temperature of Carosi XII to merely \"cool,\" rendering the world more hospitable. The Carosites slowly terraformed Carosi XII over the next two centuries, making use of scientists and other specialists to rebuild their world."},{"type":"paragraph","text":"The Carosites were deeply affected by their turbulent dislocation and struggled to find their bearing in the galaxy for many generations. It caused many to value old traditions and rituals, producing a veneration of the past. However, a small fragment of their society pushed for the forging of new traditions to meet their new circumstances. This caused heated debate among the population."},{"type":"paragraph","text":"During the Galactic Civil War, the Carosites were loyal to the Rebel Alliance, but their respect for life led them to be undiscerning in whom they treated, prompting Carosite physicians to provide medical care for Imperial survivors as much as Rebels. The Carosites had little military strength and maintained only a small navy and merchant fleet. In 0 ABY, the Alliance made a significant strike against the Empire in the Carosus system. After the Rebel Alliance transitioned into the New Republic, the Carosite relationship with that government was further strengthened by Omo Taj, the Carosite leader at the time. He authorized the construction of a  secret base on Carosi XII, and he subsequently maintained good relations with the base commander, Balderik Rajana. However, the base did draw Imperial attention to Carosi XII. On one such occasion, an agent trained rinacats, native predators, to hunt the base operatives."},{"type":"paragraph","text":"Later during the New Republic era, the Carosites established pleasure domes on Carosi XII, some making use of expensive synthdroids, which increased travel to the planet such that the starport was in constant use. The Loronar Corporation established a synthdroid factory on the moon of Carosi XII, which was visited by Chief of State Leia Organa Solo."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060329203453\/starwars\/images\/thumb\/6\/69\/Carosite.jpg\/140px-Carosite.jpg","caption":"A Carosite holding a medical tool"}]},{"title":"Carosites in the galaxy","level":2,"content":[{"type":"paragraph","text":"Carosites were most frequently encountered in the galaxy as physicians and doctors, such as the pair that worked as medics at the Galactic Outdoor Survival School. A notable Carosite physician was Tamo Lan. Trained in medicine on Carosi XII, Lan joined the Rebel Alliance after killing a Twi'lek who threatened one of his patients. He served the Alliance on Baes Logia and the Massassi Temple on Yavin 4 before joining Shroud Team as a medic. When his best friend, the Aqualish Karlon, was killed on Bresnia, he took in Karlon's sister, Gondara. Another esteemed Carosite doctor went on a mission during the Galactic War, and disappeared. He resurfaced more than five years later, in 3640 BBY, without any memory of where he had been, and was thought to have been kidnapped."},{"type":"paragraph","text":"Not all Carosites were so selfless; the cyberneticist Dr. Parnath was a notorious exception. Exiled from Carosi for his unethical practices and relentless pursuit of credits, he moved to the Vergesso Asteroids where he performed any cybernetic enhancements requested of him, provided the payment was good."},{"type":"paragraph","text":"Even more prominent than these individuals were the Carosite physicians aboard the hospital ship the Sudden Restoration. A modified Kuat Drive Yards HS-1 hospital ship, it traveled the galaxy providing free medical care to all, and acquired a legendary patient recovery rate. It was given its name because it often visited the sites of recent battles, appearing out of nowhere to care for the wounded and civilian populations. The ship's reputation was tarnished somewhat when one of its physicians was blackmailed by the Empire into serving as their agent. He was putting Republic officers into comatose states and then jettisoning their \"dead\" bodies into space, where the Imperials later picked them up for interrogation."},{"type":"paragraph","text":"The Sudden Restoration offered medical care to the sick and wounded, regardless of their political affiliations. Because of this liberal approach, it was largely free from attack, with pirates known to hunt down any who dared menace the ship. However, on one occasion the ship was attacked by a bounty hunter. He had been hired by a crime lord to assassinate an Imperial officer who was receiving treatment on the ship. Afterward, the New Republic insisted on stationing X-wings aboard to provide small fighter cover to the ship. The ship was so successful that the Carosites considered producing more like it. Many of its patients were later transferred to Carosi Alpha Hospital on Carosi XII itself."},{"type":"paragraph","text":"The Sudden Restoration was open to different methods of healing, and for a time the Ewok shaman Keoulkeech served aboard it. A Carosite transport on its way to Yir Tangee had encountered the Ewok while on a stopover at Salfur's Trading Post on Endor. Recognizing his ability, they had transferred him to the Sudden Restoration."},{"type":"paragraph","text":"During the Galactic Civil War, the Empire captured a Carosite smuggler. Darth Vader then used the dark side of the Force to burn his mind, transforming him into a feral beast, driven by fear, and used him as a fanatical guard. In 12 ABY, New Republic agents Han Solo and Chewbacca encountered him on Belsavis in the underground catacombs. Carosite beakers were also used by the genetic terrorist Zeta Magnus during his occupation of the planet Skye during the Clone Wars."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070503200756\/starwars\/images\/thumb\/5\/5c\/Tamo_Lan.png\/140px-Tamo_Lan.png","caption":"Tamo Lan, Rebel Alliance physician"},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070502232202\/starwars\/images\/thumb\/f\/fc\/Carosite_physicians.PNG\/180px-Carosite_physicians.PNG","caption":"Carosite physicians worked aboard the Sudden Restoration."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Carosites first appeared in Planets of the Galaxy, Volume Two, produced by West End Games in 1992. The species then received mentions in a succession of other sourcebooks produced for WEG's Star Wars: The Roleplaying Game. Two Bantam Spectra novels, Children of the Jedi and Planet of Twilight, also referenced the species and their homeworld."},{"type":"paragraph","text":"In 2009, the Carosi system was placed by The Essential Atlas; this placement shed light on the context of the species and planet's history. Star Wars: The Old Republic: Rise of the Hutt Cartel, an update released in 2013, created a Carosite doctor as a possible quest for players to assign one of their companions on individual quests."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"SkyeWalkers: A Clone Wars Story","elements":[]},{"text":"Children of the Jedi","elements":[]},{"text":"Planet of Twilight","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Planets of the Galaxy, Volume Two","elements":[]},{"text":"The Star Wars Planets Collection","elements":[]},{"text":"Alliance Intelligence Reports","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Heroes & Rogues","elements":[]},{"text":"\"Cracken's Rebel Operatives\"—Star Wars Adventure Journal 10","elements":[]},{"text":"Shadows of the Empire Planets Guide","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}