{"sections":[{"title":"Chikarri","level":1,"content":[{"type":"paragraph","text":"The Chikarri were sapient rodents from Plagen. They were a sentient species with mammalian features. They had two arms and two legs with a long tail which made them very agile on their feet."},{"type":"paragraph","text":"Chikarri tended to be very inquisitive in nature. They had been known to disassemble pieces of technology quickly and rapidly discern its function. They then adapted the new technology to their own. This knowledge of a wide range of technology made them valued as mechanics and technicians."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Averaging between one to one and one half meters tall, Chikarri resembled a humanoid squirrel. They had short, squat bodies covered in thick fur including their tail. They had two short arms ending in clawed hands, and two legs with large clawed feet. In addition, they had a long tail that allowed them to balance well where others would have been precarious. Chikarri were exceptional climbers and extremely stable on their feet. Having developed in the forest canopy of their world, they were known to be at home in high places."},{"type":"paragraph","text":"Chikarri had a high metabolism, which required them to eat a large quantity of food daily. This metabolism also affected their speech and movement as they spoke very quickly and their movement was fast and jerky."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Chikarri evolved on the planet Plagen, a forested world with a large number of lakes and plateaus. They descended from tree-dwelling rodents native to their world and continued to live in cities in the trees."}],"images":[]},{"title":"Society and Culture","level":2,"content":[{"type":"paragraph","text":"Early on in the history of their species, Chikarri quickly became fond of technology. Their evolution from fire and the wheel to nuclear power and space flight spanned just over 1,000 years. Once they expanded out into the galaxy, they became fixated on the technology available to them and quickly incorporated into their own. Despite their aggressive technological prowess, the Chikarri embraced the concept of eco-friendly. They well understand the connection between the planet and themselves. As such, their technology was typically advanced toward making no impact on the biology of their homeworld. This advancement had led to their standing as makers of low radiation starship drives."}],"images":[]},{"title":"Chikarri in the Galaxy","level":2,"content":[{"type":"paragraph","text":"The Chikarri, though fascinated with alien technology, were very centered around their homeworld and had yet to venture far into the galaxy. A few however had taken it upon themselves to explore further into the galaxy and as such were sometimes seen on a variety of worlds far from their home."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Twin Stars of Kira","elements":[]},{"text":"Alien Encounters","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Alien Encounters\"—Star Wars Adventure Journal 11","elements":[]}]}],"images":[]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Treeker Security Systems","elements":[]}]}],"images":[]},{"title":"Notes and references","level":2,"content":[],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070131044712\/starwars\/images\/thumb\/7\/7f\/Plako.jpg\/200px-Plako.jpg","caption":"Plako, a Chikarri mechanic."}]}]}