{"sections":[{"title":"Cor","level":1,"content":[{"type":"paragraph","text":"The Cor were a feline sentient species native to the jungle world Gargolyn IV. The planet was chosen for settlement by the Karflo Corporation, which tried to forcibly relocate a Cor tribe despite legends warning of peril if this occurred. The following day, a large monster erupted from the ground, destroying Karflo's chosen site. Only the return of the Cor tribe was able to subdue the beast."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cor were a sentient species of felines. They were small in stature, growing to about one meter in height. They had a long, thin tail, and four limbs that each ended in five sharp claws. Each Cor had a tapered snout and long pointed ears. They were covered in fur except for their tail, which appeared bald."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Cor were a primitive people. They had traditional tribal lands in which they lived together in villages. Their homeworld, Gargolyn IV, had no native predators, and the Cor themselves were a non-violent people, preferring to use peaceful protest, exemplified when the Karflo Corporation tried to forcibly relocate one group from their village."},{"type":"paragraph","text":"Although unaware of the existence of the Force, members of the species were in fact Force-sensitive and attuned to the light side of the Force. They had shamans who utilized this affinity."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Cor evolved on Gargolyn IV, a planet located in Wild Space, where they achieved sentience and created a primitive society. In the dim past, one particular Cor tribe was frequently attacked by a monster that killed many who tried to stop it. Eventually, a shaman managed to subdue the beast, binding it to the land. A legend developed that so long as the shaman's people lived on that spot, the beast would remain bound and captive."},{"type":"paragraph","text":"Some time later, the planet was scouted by the Karflo Corporation, who decided to establish a colony on Gargolyn IV. They sought settlers to built a temporary spaceport and provide other aid to the project. Karflo also wanted to build a manufacturing facility on Gargolyn, with a Cor village chosen as the ideal site for the construction. That necessitated relocating the Cor tribe, which refused to budge. Karflo authorized force to move them, despite legends warning against any such relocation."},{"type":"paragraph","text":"A day after the tribe's eviction, a significant explosion erupted at the factory site, and a gigantic beast emerged. It utterly destroyed any settlement Karflo tried to build there. The settlers were forced to venture into Gargolyn's jungles to track down the displaced Cor tribe and return them to their ancestral lands; only in this manner, was the beast able to be subdued."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20060206183812\/starwars\/images\/thumb\/f\/f7\/Karflo_Corp.jpg\/180px-Karflo_Corp.jpg","caption":"The Karflo Corporation tried to colonize Gargolyn IV."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Cor were created by Bill Olmesdahl for the Star Wars Gamemaster Screen, a West End Games product for the second edition of their role-playing game. Published in 1992, the book contains a number of adventure hooks to be fleshed out by game masters. The Cor adventure is titled \"A Perfect World.\" In addition to the main proposed storyline, Olmesdahl offers alternative versions: one, where the beast is actually under the control of the Cor, and another where an agent for a rival corporation is trying to sabotage Karflo's colonization efforts. The adventure hook is alluded to in The Complete Star Wars Encyclopedia, published in 2008, in its entry for Gargolyn IV."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"A Perfect World\"—Star Wars Gamemaster Screen","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}