{"sections":[{"title":"Caarite","level":1,"content":[{"type":"paragraph","text":"The Caarites were a sentient porcine species indigenous to the planet Caarimon."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The species typically displayed broad grins, bearing a double row of flat, wide, and perfectly white teeth. Because of their native habitat, the species was well-suited for surviving in hot climates. Since extreme cold was unknown to this species, their ability to survive in such environments was hindered more than most species."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"They were typically sly, ingratiating beings with an eye for profit. Their penchant for crooked business dealings was regularly cloaked by their friendly demeanor. This caused them to suffer from a poor reputation though, making outsider trust of the species a rare thing. When dealing with large groups of individuals directly, their charm was often described as \"child-like,\" exemplifying their guise of innocence. They were often described as \"friendly, entertaining, and humorous.\""},{"type":"paragraph","text":"Every Caarite knew the native Caarimala language, Galactic Basic Standard, and at least one other language. Communication was considered a fundamental skill for their society. This was especially true as the species favors nonviolent means of dealing with an adversary in a face-to-face encounter. Caarites were occasionally Force-sensitive, though their inherent greed prevented them from truly embracing the ways of the Jedi."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Caarites were members of the Trade Federation. When the Federation blockaded Naboo, the Caarites were convinced it would cause the end of the Federation, so convinced the Filordi to split off with them in forming the Metatheran Cartel. Of the two member species of the Cartel, the Caarites served as the public face."},{"type":"paragraph","text":"As the Caarites were well-known in the Cularin system, the alien ever-smiling crew of the local Dorumaa Resort were jokingly known as \"Neo-Caarites\", even though they were Gungans, Humans and Twi'leks."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"A Cularin Presence","elements":[]},{"text":"The Resistance Within","elements":[]},{"text":"A Revelation","elements":[]},{"text":"An Uneasy Peace","elements":[]},{"text":"Clouded Paths","elements":[]},{"text":"Tilnes Rising","elements":[]},{"text":"Oblivion's Kiss","elements":[]},{"text":"An Official Engagement","elements":[]},{"text":"Philosophy","elements":[]},{"text":"Philology","elements":[]},{"text":"Force Convergence","elements":[]},{"text":"Caaried Away","elements":[]},{"text":"Open Aarms","elements":[]},{"text":"Belly of the Beaast","elements":[]},{"text":"Excursion","elements":[]},{"text":"Paarty On!","elements":[]},{"text":"Contract AA23","elements":[]},{"text":"Decision: Coruscant","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Living Force Campaign Guide","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":" Stories of Caarimon on Wizards.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Clone Wars Campaign Guide","elements":[]}]}],"images":[]}]}