{"sections":[{"title":"Chubbit","level":1,"content":[{"type":"paragraph","text":"The Chubbits were a species of bipedal, sentient reptiles indigenous to the desert world of Aridus in the Expansion Region. The average Chubbit stood shorter than a fully grown Human. Their skin was green or yellow, although some featured red or black spots. Their nervous system was easily crippled by ultra-strong frequency waves. On their dry homeworld, the Chubbits made use of indigenous technology such as wind-runners, wheeled vehicles that were propelled by large sails."},{"type":"paragraph","text":"The Chubbits suffered after the rise of the Galactic Empire. In 19 BBY, numerous Chubbits were held as slaves by gangs on the planet Telerath and one of its moons. The fugitive Jedi Dass Jennir freed many of these Chubbits. Meanwhile, Imperial troops on Aridus found valuable natural resources there. However, when mining outfits attempted to extract these raw materials, Aridus's ionized atmosphere rendered their equipment inoperable. The Empire thus approved construction of the Iron Tower, a massive power transformer and signal amplifier to rectify the technological problems; the Empire paid little heed when the tower's strong frequency waves crippled the nervous systems and even killed many of the planet's natives."},{"type":"paragraph","text":"The Chubbits responded by waging a guerrilla war on the Empire, armed with blasters, repulsor tanks, and crawler tanks supplied by sympathetic Yutrane-Trackata workers and the Alliance to Restore the Republic. Other offworlders provided support as well, including the Human Wrenga Jixton and a man who claimed to be the Human Jedi Master Obi-Wan Kenobi. In 0 ABY, the Kenobi impersonator destroyed the Iron Tower when the devotion shown him by the Chubbits and the Rebel Alliance hero Luke Skywalker prompted him to thwart a ploy by the Sith Lord Darth Vader to lure Skywalker into a trap at the Iron Tower. In the aftermath of the structure's fall, Jixton swore his services to Vader in exchange for an Imperial retreat from the Chubbit homeworld, and in 4 ABY, the New Republic sought an alliance with the species. The Yuuzhan Vong later conquered Aridus around 27 ABY during their invasion of the galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A species of smallreptiles—the average adult came up to a typical Human's waist—Chubbits were sentient lizards. The Chubbit body followed a roughly humanoid plan, with a head, torso, two arms, and two legs. Each hand featured either five or four digits, including an opposable thumb, while their feet gave the species a digitigrade gait on wide, splayed toes. While some Chubbits sported a stocky build, others had a lanky frame. Skin coloration varied from light green to yellow, with the top of the head often sporting mottling of another color, such as red or black."},{"type":"paragraph","text":"Each Chubbit possessed a broad, flat head that tapered to a blunt snout in the front. Two nostrils pierced the top surface of the muzzle, and a wide mouth split its anterior surface. This toothless maw housed a pointed, green tongue and pink gums. The two Chubbit eyes were placed far apart on either side of the head. They were colored either white, green, or red and their pupils could appear as either small circles or vertical slits. With some Chubbits, a red tympanic membrane was visible directly behind each eye. While many Chubbits were bald, others sported a tuft of hair at the back of the head, tresses that came in shades of black, red, blond, or white."},{"type":"paragraph","text":"The Chubbit anatomy included a nervous system that was susceptible to powerful technological emanations of the sort given off by the Iron Tower, a structure built by the Galactic Empire on the Chubbits' homeworld of Aridus. The effects of these invisible forces crippled the Chubbit neurological system and eventually proved fatal for many individuals."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140109180422\/starwars\/images\/thumb\/f\/f5\/Chubbit_nervous_system_%28CSW10%29.png\/180px-Chubbit_nervous_system_%28CSW10%29.png","caption":"Chubbit nervous systems were affected by emissions from the Iron Tower."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Chubbits inhabited the deserts of the planet Aridus, a remote world considered a backwater by the rest of the galaxy. Members of the species traveled the sands on domesticated long-necked lizards known as droffi steeds, which Chubbit riders controlled via saddles, stirrups, and bridles. Others used wind-runners, large, ground vehicles that rolled about on wheels and were propelled by winds caught in their large sails. By 0 ABY, the Chubbits were at ease with advanced weaponry, including blaster rifles and proton grenades, although these arms had to be smuggled onto their world."},{"type":"paragraph","text":"On Aridus, Chubbits often wore loose-fitting clothing, which included cloaks, cowls, baggy trousers, headwraps, and boots. Others wore clothing typical of spacefaring species, including long-sleeved shirts, trousers, vests, and boots. Offworld Chubbit regalia was similar, with the addition of loose tunics, belts, short pants, and slippers. Chubbits who grew out their hair often bound it into a topknot."},{"type":"paragraph","text":"Chubbits could be suspicious of outsiders, but they were intensely loyal to those who earned their trust. Indeed, their appreciation for those who helped them could border on adoration. The Chubbit language was known as Chubbini. The tongue was characterized by the widespread use of \/S\/ and \/Z\/ sounds."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140109180706\/starwars\/images\/thumb\/e\/e9\/Aboard_the_wind-runner_%28CSW10%29.png\/180px-Aboard_the_wind-runner_%28CSW10%29.png","caption":"Chubbits operated large ground vehicles known as wind-runners."}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Early history and Imperial occupation","level":3,"content":[{"type":"paragraph","text":"The Chubbits were native to Aridus, a world of deserts and lava flows in the Flarestar system. The system was first reached by galactic explorers during the Great Manifest Period; it had become part of the known galaxy by 15,000 BBY. The Chubbit homeworld eventually became part of the Narvath sector of the Expansion Region, and it was reachable via the Gamor Run hyperlane. From 1004 to 1000 BBY, as the New Sith Wars raged, the Chubbit home planet was located in territory controlled by the Galactic Republic. Centuries later, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Aridus was again allied with the Republic."},{"type":"paragraph","text":"The Republic's fall and resurrection as the Galactic Empire in 19 BBY brought Aridus to newfound prominence. The Chubbits could only stand by idly as the Empire scouted out valuable mineral resources on Aridus and then sent teams of miners to exploit them. When the offworlders discovered that their equipment—everything from mole miners to comlinks—was useless on the world due to the planet's ionized atmosphere, they obtained Imperial approval to construct an enormous structure, dubbed the Iron Tower, to act as a signal amplifier, power transformer and power source for Imperial hovertrains, which transported the ore. Mining started back up, and the Chubbits discovered that the Iron Tower's emissions had a devastating effect on their nervous systems; the neurological effects were so critical that many Chubbits even died."},{"type":"paragraph","text":"Rather than remain passive victims, the Chubbits formed a resistance movement to fight the Empire and drive it from Aridus. They struck a deal with the Alliance to Restore the Republic, which clandestinely smuggled weapons and munitions to the Chubbit freedom fighters. Some of the board members of the Aridus-based company Yutrane-Trackata secretly supported the Chubbit resistance after taking clandestine payments from the Alliance; while the company made mining gear specifically for Imperial operations on Aridus, it provided T2-B repulsor tanks and other matériel to the Chubbit freedom fighters by turning a blind when Chubbit forces raided its factories. Other outsiders supported the Chubbit cause as well; for instance, the Human smuggler Wrenga Jixton, hiding out on Aridus, befriended the natives."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140109175713\/starwars\/images\/thumb\/2\/24\/Chubbit_freedom_fighters_%28CSW10%29.png\/180px-Chubbit_freedom_fighters_%28CSW10%29.png","caption":"Chubbit resistance fighters"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140109181042\/starwars\/images\/thumb\/2\/2a\/Chubbits_and_gunrunner_%28CSW10%29.png\/180px-Chubbits_and_gunrunner_%28CSW10%29.png","caption":"The Rebel Alliance smuggled guns to the Chubbit resistance."}]},{"title":"The Iron Tower","level":3,"content":[{"type":"paragraph","text":"In 0 ABY, the Chubbit resistance provided a convenient cover story for a ruse by the Sith Lord Darth Vader to trap Luke Skywalker, the young Human who had destroyed the Empire's Death Star battlestation in the Battle of Yavin. Vader had an actor surgically altered to resemble Obi-Wan Kenobi, Skywalker's deceased Jedi Master. The actor then joined the Chubbit resistance and ingratiated himself with the reptilians. The Chubbits accepted the fake Kenobi as the genuine article, and his exploits with them earned their awe and admiration. When Imperial stormtroopers broke up a Rebel arms deal with the Chubbits, Vader's gambit escalated; the actor stepped in, apparently to let the Rebel gunrunner escape. In reality, the man's escape enabled him to flee back to the Rebel base on the moon Yavin 4 and to tell Skywalker about his encounter with \"Ben Kenobi.\" Skywalker took the bait and traveled to Aridus."},{"type":"paragraph","text":"As a band of Chubbit resistance fighters attempted to assault an Imperial hovertrain, Skywalker and his protocol droid, C-3PO, joined them and threw bags full of proton charges at the target, causing it to crash. Skywalker was injured in the attack, so the Chubbits and the Kenobi impersonator tended to his wounds. The fake Kenobi put Skywalker aboard a Chubbit wind-runner for his safety and then led the Chubbits in a raid on an Imperial outpost—another calculated fraud to gain Skywalker's trust."},{"type":"paragraph","text":"When Skywalker and his droid rejoined the Chubbit resistance fighters, the actor insisted that the time had come to target the Iron Tower—a task he and Skywalker would accomplish alone. To that end, he ordered the Chubbits to bring C-3PO back to Skywalker's starship lest the droid detect the technological fakery that enabled the actor to approximate the real Kenobi's Force powers. The gambit was designed to bring Skywalker to Vader, who was waiting in the Iron Tower, but the awe shown Kenobi by both Skywalker and the Chubbits caused the actor misgivings about the plan."},{"type":"paragraph","text":"The Chubbits ignored the actor's orders to stay behind to instead secure an elevated position and attack the Imperial forces at the tower to provide cover for the two infiltrators. However, the Chubbits failed to spot an incoming Imperial landspeeder headed for their location. Although the actor urged Skywalker to hurry into the tower, the Rebel's insistence on saving the Chubbits broke the actor's resolve; since the real Kenobi would help the small reptiles, he disabled the speeder and saved the freedom fighters. During the subsequent mission within the Iron Tower, the actor's betrayal of Vader was complete: to help the Chubbits, he pulled a control lever and disabled the tower's systems. The decision cost the actor his life."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20140110115803\/starwars\/images\/thumb\/e\/ec\/Iron_Tower_%28CSW11%29.png\/140px-Iron_Tower_%28CSW11%29.png","caption":"The Empire's Iron Tower caused untold harm to Aridus's Chubbit population."}]},{"title":"Later history","level":3,"content":[{"type":"paragraph","text":"The ensuing explosion knocked Vader unconscious from his perch within the tower. Wrenga Jixton found the Sith Lord's body and brought him aboard a starship that enabled Vader to escape. Jixton then used the leverage his act earned him to strike a deal with the Dark Lord: the Empire would abandon its operations on Aridus in exchange for Jixton's services in the future. Vader agreed, with the caveat that if Jixton ever failed to live up to his end of the bargain, Vader would rain death upon the desert world."},{"type":"paragraph","text":"The Chubbits survived Vader's threat; in 4 ABY,months after the Dark Lord died and the Galactic Empire fragmented, the Chubbits received a diplomatic delegation from the Empire's successor as galactic hegemon, the New Republic. That government sought to enter an alliance with the Chubbits so that the New Republic could protect the species from the remnants of the Empire. The Human diplomat Leia Organa, daughter of the deceased Vader, led the delegation, fully aware that the Chubbits were still wary of offworlders due to the turmoil they had experienced under Imperial rule. Vader's other offspring, Luke Skywalker, also accompanied the expedition, and during initial talks, Organa learned that many of the Chubbits still fondly remembered Skywalker's exploits on Aridus. Nevertheless, the New Republic Jedi left the delegation to seek out more information about his father on the planet Tatooine."},{"type":"paragraph","text":"The Flarestar system had between one and ten million sentient inhabitants circa 25 ABY. By 26 ABY, the planet had fallen under the control of the Yuuzhan Vong during their invasion of the galaxy; it remained so in 27 ABY. By 137 ABY, Aridus fell within territory controlled by the Sith Lord Darth Krayt as part of his Galactic Empire."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20080626152532\/starwars\/images\/thumb\/d\/d1\/WrengaJixton.jpg\/140px-WrengaJixton.jpg","caption":"Wrenga Jixton struck a deal with Darth Vader to get the Empire off Aridus."}]},{"title":"Chubbits in the galaxy","level":2,"content":[{"type":"paragraph","text":"Several years before 19 BBY, a war was fought on a desert planet over possession of a legendary artifact known as the Jebble Box. Chubbits fought in the war using blaster rifles, and some perished in the conflict."},{"type":"paragraph","text":"By 19 BBY, several Chubbits toiled as slaves on the archipelago of Noua on the planet Telerath in the Inner Rim. The Chubbits were held captive by rival gangs, including a band of Chagrian slavers and a group of T'surri spice runners. While the Chagrians used their Chubbit captives to act as retainers and carry their swords, the T'surri forced them to perform hard labor such as lifting and carrying goods."},{"type":"paragraph","text":"The Human Jedi Knight Dass Jennir discovered the plight of Telerath's Chubbit slaves when he fled to the world to escape Imperial persecution after the declaration of Order 66, making the Jedi enemies of the Empire. He was hired by the Human woman Ember Chankeli to take out the slavers, but she was secretly allied with the spice-runners, who wanted complete control of the Noua underworld. During Jennir's first encounter with the Chagrian slavers, he feigned interest in joining them. When Jennir met the gang's leader, the Chagrian Mors Demanna, a Chubbit slave carried Demanna's sword; another Chubbit later ran to the aid of the Human fisherman Dado when Demanna chopped off the boy's hand for daring to think he could join the gang. When Jennir began to suspect that the spice-runners kept slaves as well, he infiltrated one of their camps on Telerath's second moon, where he found large numbers of Chubbits and Nosaurians forced into hard labor. The Jedi wreaked havoc on the gang's spice refineries at the base, making the destruction seem like a gang attack. The Chubbit and Nosaurian captives fled in the slavers' ships upon Jennir's urging. Jennir later returned to Demanna's slaver gang and asked to join; the same Chubbit retainer took his sword from him before his meeting with Musori, the gang leader. However, the Musori gang discovered Jennir's machinations and beat him severely. Meanwhile, Ken-Kiba's gang took the offensive and captured and killed all of Musori's gang but Demanna himself. When Ken-Kiba's T'surri gangmembers herded various townspeople and the prostitutes who worked for Chankeli into Chankeli's brothel; there enslaved Chubbits continued to serve their T'surri masters. Jennir infiltrated the establishment, killed the T'surri guards, and freed the inmates, including the Chubbits, telling them to flee the town."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140109181803\/starwars\/images\/thumb\/4\/45\/Chubbit_and_Nosaurian_slaves_%28DT14%29.png\/180px-Chubbit_and_Nosaurian_slaves_%28DT14%29.png","caption":"Chubbits were enslaved alongside Nosaurians on a moon of Telerath."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140110120942\/starwars\/images\/thumb\/3\/31\/Chubbit_and_pal_%28DT13%29.png\/140px-Chubbit_and_pal_%28DT13%29.png","caption":"The planet Telerath was home to many Chubbits."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Writer Archie Goodwin and artist Al Williamson created the Chubbits for \"The Return of Ben Kenobi,\" a storyline for their weekly Star Wars comic strip; the Kenobi story was distributed to newspapers by the Los Angeles Times Syndicate from May 17 to July 5, 1982. In 1993, Dark Horse Comics colorized, reformatted, and reprinted the strips in comic book form as part of its Classic Star Wars series. The colors, provided by Steve Buccellato, revealed the skin pigmentation of the Chubbits, a detail not present in the original newspapers strips. Williamson's Chubbits closely resemble a character named Gribbet, who plays a prominent role in another Goodwin–Williamson serialized story, The Bounty Hunter of Ord Mantell, syndicated from February 9 to April 19, 1981. However, a poster released with the magazine Star Wars Galaxy Magazine 6 in 1996 identifies Gribbet as a member of the Rybet species."},{"type":"paragraph","text":"Author Ryder Windham borrowed elements from Goodwin and Williamson's tale for two of his own Star Wars stories: the comic book Shadow Stalker, first published in 1997, and the young adult novel A New Hope: The Life of Luke Skywalker, first published in 2009. In the former, Windham brought in the Human smuggler Wrenga Jixton, first introduced in the 1996 comic Shadows of the Empire 2, written by John Wagner, and explained the fate of the Chubbit's home planet, Aridus, after the events of Goodwin and Williamson's story. In The Life of Luke Skywalker, Windham tied up more loose ends from the comic strip story by framing the bulk of the book—a biography of Luke Skywalker—as a diplomatic visit from the newly formed New Republic to the Chubbits. Nevertheless, the book does not reveal the outcome of the diplomatic talks."},{"type":"paragraph","text":"In 2009, artist Douglas Wheatley designed a more detailed visual depiction of the species when he included Chubbit characters in the Star Wars: Dark Times comic book for Dark Horse Comics. His version of the species mostly resembles Williamson's, but he added more detailed features, such as wrinkled skin around the lips, more elaborate mottling on the head, skin folds around the eyes, and tympanic membranes behind each eye.Star Wars: Dark Times 11: Vector, Part 5 features two Chubbits fighting in a war over the Jebble Box. The characters appear in a flashback, and the world is not named; however, its depiction is consistent with that of Aridus, the Chubbit homeworld."},{"type":"paragraph","text":"The 2008 reference work The Complete Star Wars Encyclopedia mentions the Chubbits in several entries, but it does not capitalize the word chubbit in the main entry for the species. However, the entries for the planet Aridus and the Iron Tower do capitalize the species' name."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140109180127\/starwars\/images\/thumb\/0\/06\/Chubbit_figure_study_%28DT0%29.png\/140px-Chubbit_figure_study_%28DT0%29.png","caption":"Concept sketch of a Chubbit by Douglas Wheatley"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Dark Times 11: Vector, Part 5","elements":[]},{"text":"Star Wars: Dark Times 13: Blue Harvest, Part 1","elements":[]},{"text":"Star Wars: Dark Times 14: Blue Harvest, Part 2","elements":[]},{"text":"Star Wars: Dark Times 15: Blue Harvest, Part 3","elements":[]},{"text":"Star Wars: Dark Times 16: Blue Harvest, Part 4","elements":[]},{"text":"Star Wars: Dark Times 17: Blue Harvest, Part 5","elements":[]},{"text":"The Return of Ben Kenobi","elements":[]},{"text":"Classic Star Wars 10","elements":[]},{"text":"Classic Star Wars 11","elements":[]},{"text":"Shadow Stalker","elements":[]},{"text":"A New Hope: The Life of Luke Skywalker","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"\"The Unseen Planets of Star Wars\"—Star Wars Insider 36","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"\"ComicScan: Coming Full Circle\"—Star Wars Galaxy Collector 3","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"Star Wars: Empire at War: Forces of Corruption: Prima Official Game Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: Dark Times: Blue Harvest 0","elements":[]},{"text":" T2-B Repulsor Tank in the Databank","elements":[]}]}],"images":[]}]}