{"sections":[{"title":"Clantaani","level":1,"content":[{"type":"paragraph","text":"The Clantaani or Clantaanis were a species of sentient, long-eared humanoids from the arid world of Clantaano III. The Clantaani lived in marauding, nomadic tribes that fought endlessly over the limited resources of their homeworld. In the galaxy at large, Clantaani preferred to live on planets similar to Clantaano III, such as Tatooine—a place that also drew them due to its disproportionate number of criminals. Clantaani pirates and bandits stole regularly from crime lords such as the Hutts and returned home with their booty. A Clantaani known as Longo Two-Guns ran a criminal gang headquartered on Tatooine; after the bandit angered Jabba Desilijic Tiure, the Hutt placed a bounty on Two-Guns, dead or alive, in 32 BBY. The bounty hunter Jango Fett claimed the reward, along with other bounties placed on Clantaani members of Two-Guns's gang."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Clantaani, or Clantaanis, were a species of sentient, wiryhumanoids with skin that varied in coloration from blue to orange, mottled with pink and white. They had four-fingered hands. The species featured two sexes, male and female. The Clantaani face was characterized by a heavy yet expressive brow that overhung two small eyes. A pinkish nose extended from close below the eyes and above the long jaw. The puggish snout ended in a mouthful of pink flesh and white, peglike teeth. A pair of long, floppy, pointed ears jutted from either side of the head. Some Clantaani grew white mustaches."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Clantaani lived in nomadic tribes who used brigandage and warfare to fight for their planet's scant resources. Clantaani wore clothing standard for humanoid species in the galaxy; for instance, the Clantaani Longo Two-Guns sported rings, a leather vest and chaps, trousers, boots, and twin blaster pistol holsters. A common Clantaani accoutrement was a leather guard that hung from the back of the head. Clantaani were capable of learning to speak Basic. Their ears twitched as they talked, and members of the species laughed when amused."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Native to the dry planet of Clantaano III, the Clantaani evolved to tolerate arid conditions. The world was located in the Clantaano system, which was integrated into the greater galaxy at some point between 1000 and 25 BBY. The world was eventually incorporated into the Albanin sector of the Outer Rim Territories, reachable via the Triellus Trade Route, and considered part of the Slice. By 20 BBY, Clantaano III was in a region of space controlled by the Hutts, but Hutt influence had retracted by 14 BBY. Circa 25 ABY, the average population per system in the Clantaani's region was a mere 10 to 100 million beings. By 137 ABY, Clantaano III fell within an area known as the Hutt dependencies."}],"images":[]},{"title":"Clantaani in the galaxy","level":2,"content":[{"type":"paragraph","text":"A common practice among Clantaani was to leave their homeworld to ply the spacelanes, raid the stores of galactic criminals, and return with the spoils. When away from Clantaano III, Clantaani preferred planets with dry conditions similar to those of home. Similarly, due to their natural propensity to maraud and pillage, members of the species preferred worlds with large criminal elements; both considerations made Tatooine a popular destination. Clantaani pirates were active in the galaxy by 32 BBY."},{"type":"paragraph","text":"By that year, the Clantaani Longo Two-Guns had established a reputation as a top-notch gunslinger; in fact, he claimed to be the \"fastest gun in the galaxy.\" True to his name, the Clantaani wielded a blaster pistol in each hand. After building up notoriety as a gang leader on Clantaano III, Longo established a base on Tatooine, from which he led a band of outlaws made up mostly of his cousins, including long-time associates Radd Hardwikk and \"Deadeye\" Klintee. He attracted non-Clantaani as well, such as Nikto, Trandoshans, and Weequay. The gang operated throughout the Outer Rim, with activities in such locales as Mos Espa, Nal Hutta, and Mos Gamos. Two-Guns and his cronies raided other criminal enterprises and poached business from them; they took regular jobs from Gardulla the Hutt."},{"type":"paragraph","text":"In 32 BBY, rumors circulated that Two-Guns had the criminal empire of Jabba the Hutt in his sights and that Gardulla had hired the Clantaani to target towns on the periphery of Jabba's control as part of a death stick distribution scheme. Jabba reacted by posting a bounty on Two-Guns. Meanwhile, several of Two-Guns's associates earned bounties of their own for antagonizing the crime lord: Jabba targeted \"Black-Eye\" Cahoon for the kidnapping of Twi'lek slaves, Klintee for a similar kidnapping and for killing three of the Hutt's personal slaves,\"Dusty\" Rengo for skimming money from the profits earned by a Tatooine protection agency,Clem \"Trigger\" Vaneer for defaulting on a sixty percent loan, and \"Wrong-Way\" Wint for skimming money from the profit earned by a Mos Espa protection agency, and Hardwikk for passing out explosive chubas at a podrace in a bid to assassinate Jabba in Mos Eisley. This final affront, in conjunction with suspicion of involvement in the distribution of illegal goods and communication technology, also earned Hardwikk a bounty from the Mos Eisley Security Force. The gang evaded Jabba's hired thugs for a time, and Longo grew cocky, claiming himself the \"fastest blaster on Tatooine\" and bragging of his plans to swipe more territory from the Hutt. Jabba upped the bounty on the Clantaani gunslinger to 50,000, dead or alive."},{"type":"paragraph","text":"Bounty hunter Jango Fett took notice and set out to claim the reward, thus earning himself an audience with Jabba to seek further information on the Bando Gora cult. Fett pursued the Clantaani crooks to their hideout, the Mos Gamos township on Tatooine. Fett neutralized Longo Two-Guns's men one by one: Wint in a docking bay, Hardwikk in an arena, Rengo in a building, Vaneer and Cahoon in courtyards, and Klintee in a cantina. The pursuit required Fett to fight through Clantaani thugs and muscle from other species. The bounty hunter finally reached Two-Guns, who was camped out in a podracer hangar. In the ensuing fray, Fett bested the Clantaani gunslinger and claimed Jabba's bounty on him, bringing him in alive. Rumors circulated that Jabba ended the Clantaani's life by sicking his Gamorrean executioner Lomrokk on him."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110728145723\/starwars\/images\/thumb\/4\/4c\/Yellow_Clantaani.jpg\/140px-Yellow_Clantaani.jpg","caption":"Clantaani thugs made up much of Longo Two-Guns's posse."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110408215900\/starwars\/images\/thumb\/2\/26\/GivePoppaLongoAHug_%28cropped%29.jpg\/300px-GivePoppaLongoAHug_%28cropped%29.jpg","caption":"Longo Two-Guns and his gang faced off against Jango Fett."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"An image of Longo Two-Guns published in April 2002—part of a preview for the LucasArts video game Star Wars: Bounty Hunter—marks the earliest official depiction of the Clantaani species. The game itself, first released in December 2002, features Clantaani in its fifth level, which pits the bounty hunter Jango Fett against the gang run by Longo Two-Guns on the planet Tatooine. Although defeating Two-Guns himself represents the level's ultimate goal, several of his associates appear as optional, secondary bounties. One of them, \"Deadeye\" Klintee, bears the name of an effects artist who worked on the game.The Complete Star Wars Encyclopedia, published in December 2008, includes entries for the species itself, Hardwikk, Klintee, and Two-Guns. The entries confirm that Fett claimed the bounties on Hardwikk and Two-Guns, but they do not stipulate whether he caught them dead or alive. As Hardwikk's bounty is higher for a capture rather than a kill, the above scenario assumes such an outcome. The defeat of the other Clantaani depends on total completion of Star Wars: Bounty Hunter, and the above scenario assumes that each bounty was claimed in the fashion—dead or alive—that proved more lucrative. In the cases of Wint, Rengo, Cahoon, and Klintee, capturing the target alive provided Fett a larger reward. However, for Vaneer and Two-Guns, the rewards were identical."},{"type":"paragraph","text":"In researching the Expanded Universe lore surrounding Tatooine and the Gamorrean species while preparing the background story for their character Lomrokk, the Sideshow Collectibles artistic team incorporated one version of Longo Two-Guns' fate as part of their non-canonical Star Wars Mythos line of statues. In the fiction vignette and illustrations associated with the Gamorrean executioner, Jango Fett brings Longo to Jabba the Hutt to claim the bounty on his head. Jabba drops Longo into the pit before his throne, where the Clantaani encounters Lomrokk and meets his end. In \"So Uncivilized: Great Gunslingers in Star Wars,\" an article posted on the StarWars.com Blog, author Ed Erdelac mentions the story in his description of Longo Two-Guns, albeit as a rumor about the Clantaani's possible fate."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20120927114609\/starwars\/images\/thumb\/2\/2f\/Sidshow_Lomrokk_vs_Longo.jpg\/180px-Sidshow_Lomrokk_vs_Longo.jpg","caption":"Longo meets his end."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Bounty Hunter","elements":[]},{"text":"Star Wars Mythos","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" \"Star Wars: Bounty Hunter\"—Star Wars Gamer 10","elements":[]},{"text":"Star Wars: Bounty Hunter: Prima's Official Strategy Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I, II, III ","elements":[]},{"text":" \"So Uncivilized: Great Gunslingers in Star Wars, Part 1,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}