{"sections":[{"title":"Chortose (species)","level":1,"content":[{"type":"paragraph","text":"The Chortose were a sentient species from a planet of the same name. They were covered in fur and had long, pointy ears. The Goo brothers were Chortose siblings who lived and worked in the Minos Cluster. These brothers had an innate ability to repair starships and were able to complete a job faster than trained technicians."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Chortose were a sentient species native to the planet Chortose. They had two eyes, a broad nose and two long, pointy ears. The Chortose were covered in fur—apart from their nose and ears—with longer tufts of fur forming eyebrows and beards. They had two arms, which ended in fingers capable of manipulating tools. The Chortose Porgo Goo, one of the Goo brothers, was short and plump, and wore suspenders over his other clothing."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Porgo Goo was a playful and sociable Chortose, particularly enjoying meetings in dangerous cantinas. He lacked a formal education, although he was not embarrassed by that fact. All the Goo brothers enjoyed a challenge, working extra hard if appropriately motivated."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Chortose were from Chortose, located in the Rseik sector of the southern Outer Rim Territories. In 1 ABY, the Goo brothers operated a starship repair yard in the neighboring Minos Cluster. Although never formally trained as engineers, the Goos discovered an intuitive understanding of mechanical devices. They proved exceptionally efficient, able to complete repairs up to three times faster than orthodox trained technicians, if given the right motivation—typically bets or dares as opposed to credits. The Goos had no compunction with installing devices outlawed by the Galactic Empire, provided that the items took their fancy."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Chortose were created by Mark Rein-Hagen and Stewart Wieck for the first edition of Galaxy Guide 6: Tramp Freighters, a roleplaying sourcebook published by West End Games in 1990. The sole illustration of a Chortose is by Allen Nunis."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 6: Tramp Freighters, First Edition","elements":[]},{"text":"Galaxy Guide 6: Tramp Freighters, Second Edition","elements":[]}]}],"images":[]}]}