{"sections":[{"title":"Colicoid","level":1,"content":[{"type":"paragraph","text":"Colicoids were a sentient insectoid species from Colla IV."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"In appearance, Colicoids were tall insectoid beings that held multiple appendages. Their bodies were chitinous and included a powerful stinging tail. A Colicoid's physiology allowed them to curl up into a protective ball and unfurl suddenly which allowed them to catch their prey unaware. This rolling method of locomotion was described as being second nature to the Colicoids. They had flat heads with multifaceted eyes that provided them with a superior level of vision and their long antennae gave them an acute sense of smell. An average adult Colicoid measured between 1.8 meters to 2 meters tall. A number of cousin species of the Colicoids were developed with the aid of the Balmorrans. These mutants were shown to be able to metabolize the toxic waste of the planet and made unpredictable though excellent living weapons."},{"type":"paragraph","text":"Some members of these insectoids were Colicoid Queens that were different than normal members as they were more than twice the size of even the largest warrior breeds. This made them extremely dangerous and were the only Colicoids that possessed a unique poisonous stinger. This combined with their strength and size made them deadly combatants, especially when within their nests. However, a Queen tended to only fight when her young were being threatened."},{"type":"paragraph","text":"Colicoid lifespan allowed them to live to over 65 years of age. Children ranged between 1 to 4 years of age while a young adult was between 5 to 7 years old. They reached adulthood by 8 years old where they remained in this part of their lifespan until 33 years of age. They reached middle age around 34 to 49 years of age whilst an old Colicoid was between 50 to 64 years. A Colicoid was considered of venerable age from 65 years and over."},{"type":"paragraph","text":"They were carnivorous, and sometimes cannibalistic. Colicoids wishing to protect themselves were capable of forming themselves into a tight ball, an ability the Colicoids emulated when designing the droideka, which they produced in their image. The only known predator of Colicoids was the hueche, which was so feared that the sight of one would cause any Colicoid to reflexively form itself into a ball and roll away. This fear was such a deeply ingrained instinct that it remained even after hueches were apparently driven to extinction, and even a holographic projection of a hueche would have the same effect on a Colicoid."},{"type":"paragraph","text":"The insectoid minds of the species provided them a natural defense against mind tricks. There were no known Force users amongst the Colicoids."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Though highly intelligent, Colicoids were emotionless and cannibalistic in nature. This was particularly the case when food was scarce. Their ruthless cunning served them well on the battlefield as it did on the negotiating table. It was known that long ago that they transferred these ruthless characteristics to their commerce activities. As a result, they were known to be brutally efficient in their business practices. They were noted for being vicious and calculating creatures that were driven by greed whilst showing little regard for others. The Colicoids had numerous successful commercial ventures and held strict business protocols though diplomatic disputes emerged as a result of them consuming any visitors to their homeworld. None truly desired to meet a Colicoid due to the fact that they were bloodthirsty cannibals."},{"type":"paragraph","text":"This insectoid species was native to the world of Colla IV that was located on the border of the Inner Rim and the Expansion Region. These highly intelligent voracious insectoids were relatively considered isolationists in the galaxy. Despite this being the case, their dedication to the art of droid design led to the creation of advanced technology that put them at the leading edge of scientific research. The Colicoids were the founders of the Colicoid Creation Nest amongst other companies."},{"type":"paragraph","text":"Whilst not strictly aggressive, they held little regard for other races despite holding robust mercantile operations. Their kind saw the trade of technology as a useful means to an end even if it were a midly distasteful one. These cannibalistic insectoids possessed a highly advanced technological society. Despite this being the case, they were noted as being one of the most hostile species in the galaxy. As few visited Colla IV, none realized that the Colicoids held even more dangerous droids on their homeworld. Though holding Queens, the Colicoids were not a rigidly hive oriented race as some insectoid species though fertile members of the race held a privileged positions in their society. Such fertile Queens were tended tirelessly by their drones, workers and warriors."},{"type":"paragraph","text":"The Colicoid consisted of clicking and humming noises that was generated from their antennae with their jointed legs. This was difficult for others to interpret and impossible for non-Colicoid species to reproduce. Despite this, the Colicoids were able to speak Basic with a definitive buzz. Though this was the case, the race tended to converse in their own language when in the presence of others where they could plot and scheme in front of others without them knowing what the Colicoids were speaking. Whilst this was their spoken tongue, the species lacked any form of written language and had to resort to using Basic. Examples of the Colicoid language being used in conjunction with basic were illustrated in the Droideka that merged the Basic term \"droid\" with \"eka\" that meant \"hireling\" or \"drone\"."},{"type":"paragraph","text":"Colicoids were known to occasionally stop any travelers going through their system and eat them. The Colicoids possessed a strong dislike for Jedi, which only intensified after the Invasion of Naboo."}],"images":[]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Old Republic era","level":3,"content":[{"type":"paragraph","text":"During the Cold War, the Creation Nest was responsible for providing Colicoid DNA as part of a series of experiments on Balmorra. This led to the creation of a mutant strain of the species with the Colicoids intending to gain the best mutations to improve themselves. Cessik was present on Balmorra at the time as a representative of the Creation Nest who was willing to continue the experiments. When the Sith Empire invaded the planet, the mutant Colicoid's were freed from Bugtown and attacked any intruders. At the time, Cessik met with a Sith representative about continuing the experiments and working with Project Hexapod to accomplish this goal."},{"type":"paragraph","text":"This insectoid alien species were known to specialize in the development of weapons and technology that they sold to others. However, throughout the Cold War they sold their products to both the Galactic Republic and Sith Empire. During the conflict, they showed a desire to align themselves to one faction, with the intention to determine which side was more deserving of their business. As a result, the Colicoids created an elaborate war game on a remote asteroid within the Outer Rim where both Republic and Sith representatives engaged in these trials. The factions sought to gain the favor of the Colicoids whilst denying the opposing side access to their valuable weaponry. These trials included many traps and even members of the Colicoids themselves."}],"images":[]},{"title":"Rise of the Empire","level":3,"content":[{"type":"paragraph","text":"A generation prior to the Clone Wars, the species engaged in an internal war. Afterwards, they settled into a rigid hierarchy of specialized nests. During the Gathering at Sojourn, a number of dangerous looking mistrustful Colicoids from the Colicoid Creation Nest attending the meeting who were being tasked with the development of new weapons. Prior to the Battle of Naboo, Viceroy Nute Gunray of the Trade Federation met with the Colicoid Sovereign Nest where the Neimoidian bartered fifty bargeloads of exotic flesh in exchange for an exclusive contract for the production of droidekas. The presence of Neimoidian lawyers aided in the Colicoid manufacturers of the droideka from facing costly death and damaging lawsuits."},{"type":"paragraph","text":"After the Battle of Naboo, the Colicoids took control of the spice mining operations on Kessel hoping to establish a strong inflow of credits. They also tried to acquire the rights to a spice processing plant on Nar Shaddaa but they had to deal with the slaver Krayn to obtain them."},{"type":"paragraph","text":"When the Clone Wars broke out, the Colicoids joined the Separatists, and provided them with many droid designs such as the droid tri-fighter. Colicoid Scorpenek annihilator droids were involved in the Clone Wars when the Republic Military assaulted Colla IV in order to attack the shielded factories. Afterwards, the Colicoids arranged for the Confederacy of Independent Systems to have a naval taskforce form an orbital screen around their homeworld so that the annihilator droids could be shipped onto freighters for the frontlines. The Separatists demanded increased droid output from Colla IV, the Colicoids turned their existing repair droids into weapons of sabotage thus creating the Pistoeka sabotage droid. These droids saw late usage by the end of the Clone Wars and the Colicoids were left with millions of unwanted units by the end of the conflict."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Darth Plagueis","elements":[]},{"text":"Cloak of Deception","elements":[]},{"text":"Star Wars: Republic 29: The Hunt for Aurra Sing, Part 2","elements":[]},{"text":"Jedi Quest: Path to Truth","elements":[]},{"text":"Jedi Quest 1","elements":[]},{"text":"Jedi Quest 2","elements":[]},{"text":"Jedi Quest 3","elements":[]},{"text":"Jedi Quest 4","elements":[]},{"text":"Legacy of the Jedi","elements":[]},{"text":"Labyrinth of Evil","elements":[]},{"text":"Millennium Falcon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Attack of the Clones: The Illustrated Companion","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Geonosis and the Outer Rim Worlds","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The Official Star Wars Fact File 5","elements":[]},{"text":"The Official Star Wars Fact File 74","elements":[]},{"text":"The Official Star Wars Fact File 132","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The New Essential Guide to Characters","elements":[]},{"text":"Star Wars Roleplaying Game Saga Edition Core Rulebook","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Galaxy at War","elements":[]},{"text":"Scavenger's Guide to Droids","elements":[]},{"text":"Galaxy of Intrigue","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]},{"text":"Star Wars: The Old Republic Explorer's Guide","elements":[]},{"text":"Book of Sith: Secrets from the Dark Side","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Force Collection","elements":[]}]}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20050911135004\/starwars\/images\/thumb\/2\/23\/Colicoid.jpg\/150px-Colicoid.jpg","caption":"A pack of colicoids"}]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Colicoid on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}