{"sections":[{"title":"Cathar (species)","level":1,"content":[{"type":"paragraph","text":"The Cathar were a species of feline, bipedal humanoids native to Cathar, a planet of savannas and rough uplands. They were known for their loyalty, passion, and temper. Quick and powerful, they were considered great warriors and dedicated, efficient predators. Cathar had high moral values, learned from both family and society. Their females were prized as slaves, whereas the males were generally regarded as too uncontrollable for slavery."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The baseline Cathar had fur-covered bodies with thick manes. They had prominent, retractable claws that could deliver powerful killing attacks on foes and prey. Their bodies also possessed rapid healing abilities. On average, Cathar were 1.5 to 1.9 meters tall. These traits made them the perfect hand-to-hand specialists."},{"type":"paragraph","text":"The Cathar species also had two additional subspecies, known as the Juhani and the Myr Rho. Both of these were notably less catlike than mainline Cathar. Cathar were born into a litter. The Cathar species was biologically similar to the Bothan species."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130620035225\/starwars\/images\/thumb\/b\/b1\/SylvarAndEscorts-TOTJR2.jpg\/250px-SylvarAndEscorts-TOTJR2.jpg","caption":"Sylvar, a Cathar female and two Cathar males of the more common subspecies."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The planet of Cathar was devastated by the Mandalorians during the Battle of Cathar, leading to the enslavement and near-extinction of the Cathar species. Over 90 percent of the species were killed by the Mandalorians in the battle. The few survivors were forced to flee off-world to survive. After the end of the Mandalorian Wars, Cathar began to resettle their world. By the time of the Galactic Civil War, it had fully recovered from the damage the Mandalorians had done."},{"type":"paragraph","text":"During the Cold War, many Cathar settled on Ord Mantell. Others attempted to settle on Taris to aid in its rebuilding, but were attacked by the Sith Empire just prior to the outbreak of hostilities."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"On their homeworld, Cathar lived in cities built into giant trees, and were organized into clans governed by \"Elders.\" Stories of their great heroes were often carved into the trunks of these tree-homes for following generations to see. The Cathar mated for life, to the extent that when one mate died, the survivor never had a relationship with another. Cathar clan society included great pageants and celebrations, especially for their heroes. Their religion included a ritual known as the \"Blood Hunt,\" in which Cathar warriors individually engaged in combat against entire nests of Kiltik in order to gain honor and purge themselves of inner darkness. The native language of the Cathar was Catharese, which included the emphasis of some spoken words with a growl."}],"images":[]},{"title":"Cathar in the galaxy","level":2,"content":[{"type":"paragraph","text":"Force-sensitive Cathar often became Jedi, even though the Jedi way tended to be in opposition to their natural tendencies. Sylvar and her mate Crado were famous Jedi who fought in the Great Sith War. The story of Crado's fall to the dark side of the Force under the influence by Exar Kun was well-known to all Cathar, just as the story of Sylvar, who was able to turn away from the dark path and regain the Jedi way. Another Cathar Jedi of that era was Juhani, who traveled with Revan and assisted him in the destruction of the Star Forge. Famous Cathar Jedi during the Second Imperial Civil War were brothers Rasi Tuum, Ahn and Zho."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In Knights of the Old Republic, the Cathar Jedi Juhani speaks Basic, albeit with a heavy Russian-like accent, with rolled \"r\"s and \"w\"s that sound like \"v\"s. Murghir, a bounty hunter and foe in the Great Hunt encountered by the Bounty Hunter class in The Old Republic, also speaks with such an accent. It is possible that this is meant to represent a Catharian accent. However, a Cathar companion of the Trooper class in TOR, Aric Jorgan, has no such accent. It is possible, however, this is because Jorgan was born and raised on the planet Rendili, not Cathar."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20051120061955\/starwars\/images\/thumb\/4\/45\/Juhani1.jpg\/150px-Juhani1.jpg","caption":"Juhani, a Cathar female of the less common Juhani subspecies."}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Technical Journal (Volume One)","elements":[]},{"text":"Tales of the Jedi Companion","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"Knights of the Old Republic Campaign Guide","elements":[]},{"text":"\"Blaster\"—Star Wars Insider 101","elements":[]},{"text":" Planet Hoppers: Cathar on Wizards.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Star Wars Galaxy Series 4","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 28","elements":[]},{"text":"Galaxy at War","elements":[]},{"text":" Myhr Rho in the Databank","elements":[]},{"text":"Star Wars: The Old Republic Explorer's Guide","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: The Old Republic Encyclopedia","elements":[]},{"text":"Star Wars: Edge of the Empire Core Rulebook","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Wizards of The Coast","elements":[]},{"text":"Cathar on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}