{"sections":[{"title":"Chiss","level":1,"content":[{"type":"paragraph","text":"The Chiss were a tall, blue-skinned Near-Human civilization from the planet Csilla in the Unknown Regions, best known to most Humans as the people to which Grand Admiral Thrawn belonged. Due to the remote position of their home territory in the Chiss Ascendancy they remained largely an enigma to the rest of the galaxy, and contact with outsiders was limited even in the days of the Galactic Alliance."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Chiss were a near-Human species distinguished by their blue skin and glowing red eyes, which grew darker depending on the oxygen content of their surroundings. The more oxygen present, the more intense the color of their eyes and skin tone. While their hair was typically jet black, it did on rare occasions go gray with age (most Chiss believed that the development of gray hair was an indication of the siring of exceptional children). Their physical form led to some speculation on whether they were an offshoot of humanity's ancient expansions into the galaxy or whether their physical form coincidentally matched that of Humans. However, genetic analysis indicated that they were an offshoot of humanity, and it was believed that moving underground led to a divergence between them and baseline Humans. Furthermore, this analysis indicated that their unique skin tone was the result of exposure to glacial minerals. Their blue skin, jet black hair and red eyes generally commanded attention once they were in a crowd of regular humanoids, and these features made them physically striking and instantly recognizable.. Male and female Chiss tend to be more powerfully built when compared to Humans but exhibit the same variances as Humanoid sexes. A Chiss stood between either 1.6 to 2.1 meters in height though an average height of an adult was believed to be 1.7 meters."},{"type":"paragraph","text":"The University of Sanbra concluded that the fact that all Chiss often appeared in very good physical shape was an indication that the species possessed an active metabolism which was responsible for their trim figure. Thus, this was believed to be responsible for preventing obesity that was commonly found within more sedentary humanoids. While the report concluded that they were indeed near-Humans, they had not determined a specific point of evolutionary divergence. There was, in fact, a Human sleeper ship colony established on Csilla around 27,500 BBY, though records of this were virtually nonexistent and it remained unknown how a remote area of the galaxy could have been trailblazed so far back. They did display, physiologically, very few signs of evolutionary adaptations to their icy environment with even their skin pigmentation not providing any apparent benefit. Beyond the obvious physical features, physiologically, the Chiss were similar to Humans to the point that they possessed a comparable circulatory, neurological, digestive and reproductive systems. The Chiss vocal mechanism was noted for being similar to Humans but there were apparent differences which was evident in their capacity to speak their native language."},{"type":"paragraph","text":"In addition, they experienced a greatly accelerated growth rate compared to Humans, which contributed to their reaching maturity faster than Humans. Thus a Chiss at the age of 10-years held the physical maturity of a 20-year old Human. This in turn resulted in a culturally-imprinted emotional maturity that was many times above that of their Human counterparts. They were capable of living up to 80 years old, at which point a Chiss was considered venerable; children were between ages 1-10, and they experienced a rapid adolescence from 11-12 and were considered full adults by 13-14. Middle-age followed between the ages of 51-62, and those aged 63-79 were considered old."},{"type":"paragraph","text":"Certain anthropologists believed that the Nagai were perhaps an offshoot of the Chiss but no legends or history records in either species indicated the validity of such a claim."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20051128115222\/starwars\/images\/thumb\/9\/97\/Chisswomen.jpg\/180px-Chisswomen.jpg","caption":"Female Chiss"},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20091215233139\/starwars\/images\/thumb\/4\/48\/TattooedChiss-TNR.jpg\/180px-TattooedChiss-TNR.jpg","caption":"A tattooed Chiss male."}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Beginnings","level":3,"content":[{"type":"paragraph","text":"The origins of the Chiss were largely unknown, even to the Chiss themselves, though some scientists thought that they were the result of a long forgotten Human colony that had been lost to time. This was the leading theory held by not only Chiss historians but scientists within the New Republic who held the view that this colony predated the formation of the Old Republic. A report by the University of Sanbra indicated that very little was known of Chiss history due to their own records being carefully guarded on their homeworld. However, scattered reports from many intrepid scholars suggested the Chiss were a forgotten colonization attempt; this theory was mostly based on their resemblance to Humanity. Genetic analysis later confirmed that the Chiss were indeed an offshoot of the Human species' earliest attempts at colonization. It was believed that sometime before 27,000 BBY, a lost colony of Humans settled in the Unknown Regions on the planet Csilla."},{"type":"paragraph","text":"According to Chiss legend, their homeworld was once a warm and tropical planet. However, the planet was later locked in an ice age with profound glaciation encompassing the terrestrial world. This forced the Chiss ancestors to travel along the ice front's leading edge in order to survive at the temperate front as glaciers began spreading across the planet. Though it was believed that the glaciation process occurred over an extended period of time, it was also at an age when the Chiss were already technologically advanced which allowed them to overcome these challenges to their survival by way of technological adaptations. This led many to conclude that the early Chiss existed on Csilla prior to it succumbing to an ice age. Thus, Csilla nearly became inhospitable by 5000 BBY, and it was only by living underground that this divergent species survived. These events furthered the genetic changes notably seen in their skin tone and eyes. Thus it was believed that by going underground, the race gradually began to diverge from the baseline Human species, the glacial mineral content beginning to alter their physiology into its more modern form."},{"type":"paragraph","text":"Xenosociologists believed that this period had a profound mental impact on the developing Chiss and led to the evolution to their current mindset. However, little was known of these early Chiss as certain legends indicated that a decadent culture had formed in the tropics that were unprepared for this ice age. Related parables even stated that northern dwelling Chiss slaughtered their decadent southern cousins when resources became sparse and chilling temperatures befell the planet. Regardless, it was known that the Chiss adapted well to their planet during its climatic change and began tapping into geothermal energy as a power source. This led to the building of several populous cities amongst the glaciers and were quick to develop a global government. Thus, they avoided the adolescence period common to developing worlds that saw nations compete with one another, along with adopting a planet-wide tongue. Eventually, their species mastered star travel independently with some speculation that they tapped into the ancient memories of the colonization effort that first brought them to Csilla."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20101030034624\/starwars\/images\/thumb\/1\/18\/Chiss_TOR.jpg\/190px-Chiss_TOR.jpg","caption":"A Chiss during the reign of the Old Republic"}]},{"title":"The Ascendancy","level":3,"content":[{"type":"paragraph","text":"The initial Chiss star-travel era involved their scientists attempting to create hyperfields over vehicles designed to carry passengers. At the same time, automated drones were launched into the Unknown Regions with specialized beacons that led to the creation of a network of navigational anchor-points. As the Chiss began to expand into space, a Syndic by the name of Jer'Jo Cam'Co was responsible for the formation of the Chiss Expansionary Defense Force. He proposed the creation of this group after explorations efforts yielded several resource rich worlds. Much of their expansion was governed by the need to gather resources without upsetting their homeworld's ecosystem. Though their territory later managed to suffice for their growing population, the Chiss continued to expand into space. However, this was not out of exploration of the unknown or out of greed but a leading theory indicated that they sought to impose order over a chaotic region of space. The government on Csilla controlled 28 major colony worlds scattered across Chiss space, united in a political federation known as the Chiss Ascendancy. This species remained a complete mystery to most of the galaxy and were completely removed from the various galactic governments. Thus, over the course of thousands of years, the Chiss began to develop socially and technologically in isolation."},{"type":"paragraph","text":"Though the Chiss were not widely known to the greater galaxy, examples of their technology were known to exist as far back as 3951 BBY when samples of their charric weapons were being sold on the planet Onderon. When the Sith Empire returned to fight the Republic once more during the Great Galactic War and the Cold War, the Chiss Ascendancy was the only actual ally of the Empire, unlike all the species that the empire subjugated, and some Chiss were known to serve as Imperial Agents or bounty hunters. A few rare Chiss even achieved official rank in the Imperial military. In this time, Chiss agents were sent on loan to the Imperial Military forces on Hoth where they aided the Ministry of Logistics by providing cold weather training and equipment for skirmishes on the icy world. In addition, the Chiss established a secret outpost on the planet known as Zero Station where Aristocra Saganu of House Miurani oversaw his peoples efforts in aiding their Sith allies against the Republic."},{"type":"paragraph","text":"Around 1000 BBY, the forces of Lord Kaan's Brotherhood of Darkness encountered the Chiss in the Unknown Regions and managed to bring a legion of them to the planet Thule. The Chiss that were born there spread into the wider galaxy although they were still relatively unknown to many. It was known that the law against pre-emptive strikes and aggression had been in place for a thousand years. Between 1000 BBY and 990 BBY, a Chiss by the name of Cyndra was known to have operated in the wider galaxy where she was a member of the Anti-Republic Liberation Front."},{"type":"paragraph","text":"In the year 178 BBY, the Chiss began studying a dense cluster within their territory known as the Redoubt Cluster. The initial surveys into the deadly maze of space cost the lives of several Chiss explorers surveying it at the time. Under normal circumstances, the Ascendancy's relations with the rest of the galaxy were governed by a strict, formal policy of non-aggression backed up by strong defensive preparations; although the Chiss did not, as a rule, intervene in the affairs of others, outsiders were discouraged from encroaching on the untapped resources of the Ascendancy's territory by the threat of severe military reprisals against attackers. Although overt hostile action was formally required as a trigger for retaliation, simple territorial transgression could be interpreted by some Chiss patrol commanders as enough to constitute a violation. Differences of opinion over the rules of engagement evidently existed among the Chiss military and civilian hierarchy, but most outsiders seem to have been unaware of this."},{"type":"paragraph","text":"By 37 BBY, the barbarian Vagaari were raiding volumes of space close to the Ascendancy's frontier, but far more serious concerns were raised by the direct incursion of a force from another alien race a few years later. Although the aliens were destroyed by a fleet led by Admiral Ar'alani, it quickly became apparent that what had been encountered was only a small scouting force, probing ahead of a massive alien invasion force. It should be noted that the living planet Zonama Sekot, itself fleeing from a Yuuzhan Vong assault, took refuge in a remote area of Chiss space at around the same time, and its arrival was detected by a CEDF deep space probe. The Chiss, however, did not understand the greater significance and identity of the planet, and thus dismissed it as a natural system capture of a rogue planet. A Chiss pirate by the name of Swagg was known to have operated in the Mid Rim prior to 32 BBY until he was killed by Roos Tarpals on Naboo during an attempt to steal ancient Gungan art."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060218151315\/starwars\/images\/thumb\/7\/79\/Chiss_Females.JPG\/180px-Chiss_Females.JPG","caption":"Two Chiss females."}]},{"title":"The rise of Thrawn","level":3,"content":[{"type":"paragraph","text":"In response to the threat of invasion, a vast interstellar fortress began to be prepared in the Redoubt Cluster in 28 BBY with the pace of the project growing in urgency as a safe haven for their people if they were ever invaded. This was prior to any renewed contact with the Republic. In this era arose a young officer in the Expansionary Fleet known as Thrawn who began to press for the abandonment of the hallowed doctrine that outlawed preemptive strikes. He believed that the Chiss could not place themselves in a situation where they were forced to fight against the Vagaari and the Yuuzhan Vong simultaneously, but while others like Admiral Ar'alani and his brother Syndic Thrass acknowledged the danger, they viewed his enthusiasm for combat and aggressive scouting with some concern."},{"type":"paragraph","text":"In 27 BBY, Thrawn's patrol encountered Corellian traders - the crew of the smuggler ship Bargain Hunter—marking what seems to had been the first modern contact between the Ascendancy and the Old Republic. Although initially suspicious of these outsiders, Thrawn decided that they were no threat, and he came to regard two of them, Jorj Car'das and Maris Ferasi, as friends."},{"type":"paragraph","text":"Far more dangerous incursions from the Republic followed within a few months. Outbound Flight, a massive exploration mission consisting of six Dreadnaught Cruisers led by Jedi Master Jorus C'baoth, had unwittingly scheduled a sublight flythrough of a system on the edge of Chiss space, and it was here that a powerful Trade Federation battlegroup stationed itself in order to intercept and destroy them, led by Kinman Doriana, a personal agent of Darth Sidious. Thrawn, investigating the Trade Federation ships and despite being hopelessly outgunned on paper, defeated them through superior tactics. Leaving the command ship intact in a move to secure face-to-face communication, Thrawn boarded the Trade Federation Battleship, which led to a meeting with Doriana—and a HoloNet discussion with Sidious, himself—who persuaded Thrawn that the Jedi expedition could not be allowed to blunder into the Yuuzhan Vong. Although none at the time would know it, Thrawn's highly favorable first impression made on Palpatine would ultimately change the galaxy and its perception of the Chiss people forever."},{"type":"paragraph","text":"Thrawn engineered a clash between the Vagaari and Outbound Flight, weakening both sides to the point at which his small patrol force could effectively end both threats, but the resulting battle did not unfold according to his plan: while C'baoth was attempting to kill Thrawn using the Force, a remnant of the Vagaari force was able to flee to hyperspace, and a series of Chiss radiation bombs designed for the Vagaari command craft were unintentionally detonated aboard the Dreadnaughts. Although this killed the Jedi Master before he could kill Thrawn, the damage to the Republic expedition was disastrous. Of the fifty thousand personnel aboard Outbound Flight, only fifty-seven survived. The aftermath of Outbound Flight also revealed tensions within the Chiss power structure, as Aristocra Chaf'orm'bintrano tried to claim Outbound Flight for the Fifth Ruling Family."},{"type":"paragraph","text":"This was not the only impact the Chiss had on the galaxy as in 22 BBY, a female Chiss by the name of Sev'rance Tann left her people and joined Count Dooku as one of his Dark Acolytes during the Separatist Crisis and led a Droid Army in the Clone Wars as well . Her lover, Vandalor, also served as a bounty hunter during the conflict. During the war, a diplomatic effort was launched by the Galactic Republic under the direction of Supreme Chancellor Palpatine to make contact with the Chiss Ascendancy. This saw Aristocra Sev'eere'nuruodo being dispatched to Defense Force Station Ifpe'a where they awaited the Republic delegation consisting of Chiss Jedi Padawan Nuru Kungurama and the clone troopers of Breakout Squad. The Aristocra, however, conveyed the message that the Chiss were staying neutral in the conflict at which point the station came under attack from Separatist forces led by a Skakoan known as Umbrag. This saw the Aristocra taken away to safety whilst the Chiss forces battled the CIS fleet and afterwards she was returned back to Chiss Space."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110127020906\/starwars\/images\/thumb\/e\/e6\/Thrawn_NEGTC.jpg\/180px-Thrawn_NEGTC.jpg","caption":"Thrawn"},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20050530151027\/starwars\/images\/thumb\/c\/cd\/Sevrance_tann.jpg\/180px-Sevrance_tann.jpg","caption":"Chiss Dark Jedi Sev'rance Tann."}]},{"title":"The Household Phalanx","level":3,"content":[{"type":"paragraph","text":"Thrawn continued to persist in his challenges to the first-strike doctrine of the Ascendancy in the belief that it made his people weak. This approach did lead to a disagreement with the Chiss ruling houses who did not approve of a pre-emptive strike against an unconfirmed enemy. It was this approach and similar such actions that put Thrawn at odds with the ruling families. Ultimately, they decided to brand him a renegade and banished him to a primitive jungle world on the fringes of known Chiss space. In 19 BBY, he was discovered and recruited by the Empire. For almost three decades, however, his true capabilities, and his true status within the Imperial hierarchy, were kept carefully hidden even within the ranks of the military. Despite being exiled and rejected by his people, Thrawn was known to have remained very protective of his kind. This was evident by the fact that he never revealed the whereabouts of the Chiss to outsiders. After rising to the rank of Grand Admiral, Thrawn was seemingly exiled from the Imperial court for a breach in the practices of the Imperial Palace. In truth, this was actually a cover story orchestrated by Emperor Palpatine in order to explain the departure of his greatest tactician. Thrawn afterwards began an Imperial campaign of subjugation of the Unknown Regions in the name of the Galactic Empire with this secondary duty seeing him disappearing for long periods at a time."},{"type":"paragraph","text":"Sent with a task force into the Unknown Regions, this group was given the secret mission of exploring the area and conquering new systems for future Imperial expansion. Whilst mapping large portions of space, Thrawn re-established contact with his comrades within Chiss territory. By this time, the Chiss had been battling the many dark threats that surrounded them and saw hope in Thrawn's manner of leadership. As a result, many Chiss ended up flocking to his banner in order to preserve their way of life. Within a few short years, Thrawn had opened up large expanses of territory and placed them under the command of his Imperial forces as well as those handful of Chiss that remained loyal to him. In addition, the intense secrecy of the project meant that few outside of Palpatine and those assigned to Thrawn's forces were aware of their existence. With his fleet of Imperial Star Destroyers, the Imperial forces were known to have worked alongside the native forces of Thrawn's own Household Phalanx. The territory conquered in these campaigns quickly became the basis of a new power that became known as the Empire of the Hand. This new government formed a stand-off relationship with the Chiss Ascendancy with an uneasy relationship between the two sides. Though considered a renegade by his people, many Aristocras secretly supported Thrawn's actions as they believed his proactive stance ultimately kept the Chiss people safe."},{"type":"paragraph","text":"Whilst largely unknown, there were Chiss involved in other events in the galaxy. Notable instances included Droma Ordo and the trader Tyrral who resided at Station Gamma in 1 ABY. During the Galactic Civil War, one Chiss who had joined the Alliance to Restore the Republic, known as Captain Voldez, participated in the Battle of Restuss. Another Chiss by the name of Laen Pieweto led a group of poachers during hunts at the Rodian Hunting Grounds on the planet Kashyyyk."},{"type":"paragraph","text":"There were no other recorded encounters of the Chiss although they were known to have fought against the Ssi-ruuvi, a potent reptilian species who were a military threat as fearsome as the Nagai and the Yevetha. This event occurred a few months after the Battle of Endor when a preemptive strike carried out by Thrawn's Empire of the Hand attacked the Ssi-ruuvi Imperium. This initial clash allowed the CEDF to directly intervene and invade Ssi-ruuvi territory in response to their attacks on Ascendancy colonies. The short resulting war between the two powers left the Ssi-ruuk crippled with the victorious Chiss becoming the ultimate power within the Unknown Regions. By this point, the Far Outsiders had been arriving in the Unknown Regions and the Chiss responded by constructing stellar fortresses to combat this threat."},{"type":"paragraph","text":"In 9 ABY, Thrawn left the Unknown Regions to take supreme command of the Empire's war machine, and launched his campaign against the New Republic. In spite of his death at Bilbringi, his legacy endured, not least in the form of the House Phalanx and their allies in what became known as the Empire of the Hand. After Thrawn's death, the New Republic managed to successfully capture a number of logs from surrendered Imperial vessels which provided a few points of interest on the otherwise mysterious Chiss. Among these records included a log by Emperor Palpatine himself on his first encounter with Thrawn."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20080620162209\/starwars\/images\/thumb\/4\/4a\/Spiker_unmasked.jpg\/250px-Spiker_unmasked.jpg","caption":"Chiss gangster Spiker."}]},{"title":"Thrawn's Empire","level":3,"content":[{"type":"paragraph","text":"The secrecy of Thrawn's project served it well, and, by 19 ABY, the Empire of the Hand controlled a vast region of space whilst being completely unknown to the Imperial Remnant that was based at nearby Bastion within the Rim frontier. It was the result of the events that led to the Caamas Document Crisis that led to the Jedi Master Luke Skywalker learning of the existence of the Chiss, the Empire of the Hand being based on the largely uninhabited world of Nirauan where the fortress structure known as the Hand of Thrawn served as their official base of operations. At this time, the Empire of the Hand also recruited General Baron Soontir Fel who served in the higher echelons of the Empire of the Hand's government. Chiss paranoia was such that even in the Remnant's highest echelons, his mission and location were apparently largely unknown, and the Baron's sons, Davin and Jag, were required to enroll as cadets to a Chiss military academy, primarily as a hostage to ensure their father's integrity. Following the discovery of the Empire of the Hand, Supreme Commander Gilad Pellaeon with his trusted advisers became aware of them and maintained limited contact with Admiral Parck's Nirauan offshoot regime. In addition, Leia Organa Solo along with the top officials of the New Republic were also aware of the existence of the Chiss and the Empire of the Hand, though they did not know the true extent of the territory of the latter, which was kept a secret by Jedi Master Luke Skywalker and Mara Jade. Similarly, the Chiss knew virtually nothing of the New Republic or its worlds while maintaining the policy that Thrawn was a renegade that brought dishonor to the rest of his people. This era would also see their haven in the Redoubt Cluster nearing completion."},{"type":"paragraph","text":"By 22 ABY, Aristocra Chaf'orm'bintrano began to experiment with Thrawn's military doctrines in order to find a means of dealing with the resurgent threat of the Vagaari without challenging the rule against preemptive strikes. This was partly to end their campaign of terror in the Unknown Regions but also because the Chiss had learned that the Vagaari had already made alliances with forces more dangerous than them. A fortunate turn of events came when a Chiss patrol in the Redoubt discovered the remains of the Outbound Flight and quickly reported its findings. Their data was forwarded to the Nine Ruling Families who held a quick debate in order to determine the next course of action. After declaring the area off-limits, they placed Aristocra Formbi in charge of the recovery mission in order to return the ruined vessel to the New Republic. To that end, he created an elaborate plan involving the Outbound Flight mission that was now located within the Redoubt. First, he contacted Admiral Voss Parck and through him sent a message to Luke Skywalker to arrive at Crustai in order to board the Chaf Envoy as part of an apparent mission to return the ruined Outbound Flight back to its owners. This message was intercepted by Dean Jinzler who masqueraded as an ambassador of the New Republic with the help of Jorj Car'das as a personal favor to him. While transporting the \"ambassador\" to the Chaf Envoy, Aristocra Formbi was given a brief but detailed description on the appearance of the Vagaari as part of his plans. The message sent to Admiral Parck that was meant to request Jedi Master Skywalker's presence had enough transmission leakage in order to attract the attention of the Vagaari in a region of space where they were building up their strength. In addition, the 501st Legion under the command of Chak Fel, was dispatched to provide assistance though none of the parties except for Formbi and his assistant, Feesa, were aware of the true extent of his plans."},{"type":"paragraph","text":"Meeting with their respective parties, the Chiss convoy was met seemingly with the Geroon Remnant; survivors of a world that had been pillaged by the Vagaari. What no one was truly aware of was the fact that these Geroon were actually Vagaari in disguise, which Aristocra Formbi was aware of based on Car'das's descriptions though he did not take General Drask into his confidence. As part of his plan, the Aristocra had hoped that the Vagaari would attempt to steal the Chaf Envoy en route to Outbound Flight and thus had made arrangements for the crew to take shelter at hidden stations when their foes revealed their true nature. Furthermore, they only intended for a few Vagaari to be present and conduct an act of theft, which would have complied with the Chiss rules of engagement. The reason for not bringing anyone else into the scheme was to ensure that the fault of the manipulation would lie solely on the hands of Chaf'orm'bintrano. This was also the reason why he did not reveal the true capabilities of Master Skywalker to the \"Geroon\". However, the Vagaari did not act when expected and instead traveled to the Outbound Flight Colony where the Chiss were surprised to discover that there were survivors. At this point, the Vagaari discarded their Geroon disguise and unleashed their Wolvkils that were in suspended animation while they themselves attempted to steal one of the Dreadnaughts. The Vagaari were ultimately thwarted by the actions of Master Skywalker and his wife, Mara Jade Skywalker."},{"type":"paragraph","text":"With Estosh's strike force thwarted, sufficient justification was made for hostilities to emerge with the Vagaari for their multiple merciless attacks with a state of war existing between the Chiss Ascendancy and the Vagaari race. At this point, the Chiss began assembling a strike force for this new conflict while their scout ships began searching for their enemy's bases. After the completion of their mission, Master Skywalker and Mara Jade discussed the deceptive means that Aristocra Formbi had made in order to provoke the Vagaari into instigating hostilities commenting on the similarities to techniques used by Thrawn. This led to the two suspecting that there was perhaps another clone of Thrawn that was perhaps in hiding and involved in this incident though this was simple speculation by the two Jedi."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20051203052341\/starwars\/images\/thumb\/5\/5a\/Chiss_bartender.jpg\/180px-Chiss_bartender.jpg","caption":"A Chiss bartender, Baldarek, from Nar Shaddaa."}]},{"title":"New Jedi Order era","level":3,"content":[{"type":"paragraph","text":"The Chiss were known to had been involved in a long war with the Vagaari that culminated in the form of the Third Vagaari War. At some unknown point and for reasons unknown, the Empire of the Hand was absorbed by the Chiss Ascendancy. As a result of this conflict, the Ascendancy suffered from labor shortages and thus alternate means were sought. This led to the Chiss deciding to hire Killik laborers to work for them and deemed them not a serious threat after centuries of being observed by the reconnaissance corps of the Defense Fleet. The decision was seen as a sound one as the Killiks were plentiful, industrious and were not afraid of risks. At the same time, the Chiss took steps that ensured that they did not take advantage of the hive-minded insectoids as well as took stringent precautions under their own control to prevent any of their kind from becoming Joiners. Unknown to the Chiss, someone began sabotaging their precautionary measures for the Killiks which was suspected to had been the result of interfamily rivalries that led to two entire families becoming Joiners. In addition, three other families had become critically dependent on Killik labor leading to a dispute that brought about a disagreement amongst the Chiss. Among those involved was Soontir Fel who spared several members of the destroyed families with the consequences of this incident reverberating following the disagreement despite it being seemingly resolved."},{"type":"paragraph","text":"In the year 25 ABY, the extragalactic race of aliens known as the Yuuzhan Vong began their invasion of the galaxy. This led to Grand Admiral Gilad Pelleaon of the Imperial Remnant calling upon all Imperial forces to rendezvous with his forces at Ithor which was the site of the next attack. This saw a three squadron unit designated Force Spike which consisted Chiss fighters from Thrawn's Household Phalanx being dispatched under the command of Jagged Fel. Force Spike participated in the Battle of Ithor which saw Commander Shedao Shai's battlefleet destroyed but at the cost of Ithor itself. In the aftermath, the Chiss forces along with their Beacon ship were recalled back to their own territory. However, Jagged Fel managed to convince his father Soonitor Fel to conduct a fact finding mission as the Yuuzhan Vong invasion forces spread throughout the galaxy in 27 ABY. This led to Fel along with Shawnkyr Nuruodo departing and eventually arriving at Hapes where they assisted against the invading Yuuzhan Vong. Despite orders not to get involved, the two were responsible for creating Vanguard Squadron and actively aiding the ruined New Republic in battling the extragalactic conquerors."},{"type":"paragraph","text":"During the Yuuzhan Vong War, agents of the Chiss were involved in a secret project known as Alpha Red and liased with Dif Scaur. Their intention was the creation of a bioweapon known as Alpha Red which was to be used against the extragalactic Yuuzhan Vong invaders. However, before it could be initially deployed, the biotoxin was transformed into a harmless substance due to the intervention of Vergere. Afterwards, in 28 ABY, an expedition was launched from the Galactic Alliance which was led by Jedi Master Luke Skywalker in order to locate the fabled living world of Zonama Sekot that was believed to be the key in ending the conflict with the Yuuzhan Vong. This saw them journeying into the Unknown Regions and encountering the Chiss Ascendancy. Upon being intercepted by Commander Hess'irolia'nuruodo patrol ships, the Jedi were escorted to Csilla in order to meet with the Ruling Families so that the petition could be heard on whether they could continue their search or be forced to depart Chiss Space. They ultimately allowed Master Skywalker's forces access to the Expeditionary Library archives where they were assisted by the librarian Tris. During this time, Ina'ganet'nuruodo acted upon a conspiracy with Peita Aabe in order to eliminate Syndic Fel only for it to be thwarted by the Jedi."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070118132329\/starwars\/images\/thumb\/0\/02\/Org_esp_chiss.jpg\/180px-Org_esp_chiss.jpg","caption":"A male Chiss soldier and female pilot."}]},{"title":"Killik Crisis and Aftermath","level":3,"content":[{"type":"paragraph","text":"From 28 ABY onwards, the Chiss began to notice startling changes within the insectoid Killiks who had previously shown a disregard to their own lives by letting sick members of their kind to die or allowing entire nests to starve for greater benefit of the Killik Colony. However, the Killiks behavior began to change as they started caring for their sick as well as used trade to alleviate food shortages thus bringing about a population increase within the Colony. In time, it began to grow with satellite nests emerging near the Chiss border and the Ascendancy recognizing the threat posed by the Killiks. Thus, prior to 35 ABY, the Ascendancy began to take a visible course of action to curb the threat of the Colony by starving the nests near Chiss space such as the one present on Qoribu. This action brought them into conflict with the Killiks and also saw a Chiss Intelligence agent known as Daer'ey'ath become a Prime of the Taat nest. The Chiss strategy, however, proved to be effective until UnuThul used his connection to the Myrkr strike team to draw them to his side in the conflict. This arrival of Jedi fighting on the side of the Killiks led to the Chiss dispatching Aristocra Mitt'swe'kleoni to the Galactic Alliance in order to determine why they had intervened in the conflict. The Chiss ambassador first met Chief of State Cal Omas and later with Jedi Master Luke Skywalker whereupon he determined that the Myrkr Jedi were acting on their own. This saw the Chiss dispatch Jagged Fel as the commander of the Chiss military forces in the region that were attempting to contain the Killiks. However, the arrival of a Hapan fleet under the command of Dukat Aleson Gray due to the intervention of Jacen Solo led to further hostilities but culminated in the Qoribu Truce that seemingly ended the conflict which saw the death of Welk."},{"type":"paragraph","text":"Despite the end of hostilities the Killik Colony being relocated to the Utegetu Nebula, the crisis did not end with rising hostilities emerging due to the intervention of the Dark Nest in the background. This would eventually lead to all out war against the species when Jacen Solo and his friends executed a sneak attack on Supply Depot Thrago to prevent Jacen's catastrophic vision from coming true. The result of this assault led to the start of what became known as the Swarm War with the Chiss taking an active fight against the Killik Colony. The Galactic Alliance would eventually be caught up in the mix once they realized it was the Dark Nest's influence on the colony that was provoking the war. The Chiss Ascendancy was responsible for assaulting the Killik Colony world of Tenupe with a massive ground engagement fought between the two sides. Whilst it seemed that the Chiss were committed to taking the planet with their fleet in place, they were aware of the presence of the Killik Moon Swarm. However, they had planned this defeat with the intention of launching a parasite bomb which would slowly infect the entire Killik race and destroy the Colony as a result as it spread throughout the species. However, the intervention of the Jedi prevented this from occurring though further hostilities ended when the Dark Nest along with its leader Lomi Plo were killed by Master Skywalker whilst Rayner Thul himself was taken into custody by the New Jedi Order. With their leaders either dead or separated from them, it was believed that the Colony would revert to its former base behavior thus negating the threat they posed to the Chiss Ascendancy."},{"type":"paragraph","text":"Afterwards, in 43.5 ABY, a Chiss by the name of Kthira'shi'ktarloo served Imperial Chief of State Jagged Fel as head of his nightly personal security force."}],"images":[]},{"title":"The New Empire","level":3,"content":[{"type":"paragraph","text":"The Chiss continued to operate in the years that followed and became close allies of the Galactic Alliance by becoming one of its Autonomous Allied Regions. These territories were allied with the Galactic Alliance but were free to manage their own regions of space. This continued till the year 127 ABY when they dispatched the diplomat Fehlaaur'aitel'loro to the planet Bastion of the new Galactic Empire. Serving the role of a diplomatic envoy, he was placed in the service of the Imperial Diplomatic Corps as a sign of solidarity between the Chiss Ascendancy and the Empire. During that time, the Galactic Alliance suffered greatly for the incident surrounding the Ossus Project which served as an incentive for the Empire to declare war against them. When the Chiss learnt of this, they attempted to recall Fehlaaur as they did not want to be dragged into the resultant conflict. However, Emperor Roan Fel decided to grant the title of Moff to Fehlaaur in order to secure the continued support of the Chiss Ascendancy. Furthermore, upon his appointment to the Council of Moffs, he was promoted as director of the Imperial Diplomatic Corps. In the aftermath, the Chiss Ascendancy faced a transition from becoming an Galactic Alliance Autonomous Allied Region into an Imperial independent affiliate."},{"type":"paragraph","text":"With the formation of Darth Krayt's Sith Empire, the Dark Lord of the Sith kept the allegiance of the Chiss Ascendancy by way of diplomacy. This involved promoting many members of various Chiss houses to high ranking positions within his Empire. Furthermore, he allowed the Chiss Ascendancy to retain its position as being a power within the Unknown Regions and thus they served as a proxy to his Sith Empire's rule over that area of space. During the later conflict against Roan Fel and the One Sith, it was suspected by Rulf Yage that the Chiss were sheltering Emperor Fel, though Fehlaaur denied this allegation in a session with the Moff Council."}],"images":[]},{"title":"Society","level":2,"content":[{"type":"paragraph","text":"Even in the era of the Galactic Alliance, the wider galaxy seems to have had no direct contact with Chiss civilians. What was known about them was, as mentioned above, mediated largely through encounter with military units, and through a few high-level contacts with political and diplomatic delegations. It is perhaps no surprise, then, that the military and the ruling class were the best understood aspects of Chiss society; or at least, the best documented."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20051222215631\/starwars\/images\/thumb\/d\/dc\/Chiss04.jpg\/250px-Chiss04.jpg","caption":"A male and a female Chiss."}]},{"title":"The Ruling Families","level":3,"content":[{"type":"paragraph","text":"Their society was highly structured and ordered with the rule of law being enforced by a group of affiliations known as the Ruling Families, also known as the Ruling Circle., that consisted of a number of clans or houses. These were not biological family groupings but instead different branches of their government. Among their ranks included the Csapla, Nuruodo, Inrokini and Sabosen families with some sources stating that they represented bloodlines that predated modern Chiss civilization. Every Chiss was known to have claimed affiliation to one of the four families which was determined by both tradition as well as place of birth. In reality, the family names were more of a cultural holdover as the bloodlines had grown so co-meddled that any Chiss could claim affiliation to any of the ruling families. As families themselves were not in competition, rivalries themselves were rare according to one report by the University of Sanbra as a Chiss' allegiance to one family did not normally affect their day-to-day living. In spite of the outward impression of calm and order that the Chiss liked to project to outsiders, there were evidently tensions within the Families. This was evident by the fact that there was a tricky balance of power among the families. In 27 ABY, the Chaf were prepared to incite civil war if it would give them superiority over the other Families. In addition, political assassinations were apparently a real part of Chiss political life for the Ruling Families and other allied kin-groups."},{"type":"paragraph","text":"These ruling families were composed of clans that were headed by government officials known as Aristocras. Those Chiss that belonged to the same house defended one another at every opportunity while those from competing houses searched for facts that could be used to snipe or undermine the other while attempting to secure any advantage for themselves. Though Thrawn was an exceptional member of his species, his rational approach to problem solving was shared by the ruling families that governed the Chiss Ascendancy. As a general rule, Chiss did not take part in any action that would bring shame on their house with entire family lines exiled due to the actions of a single member. A tradition of shadow children was also recorded. These were offspring who were kept safely anonymous to prevent a family bloodline being fully exterminated."},{"type":"paragraph","text":"The best-documented means of acquiring Family status through merit was that which was attained in the military. For the duration of their service, every officer in the Chiss military was attached to one of the Ruling Families as a \"merit adoptive,\" and while under normal circumstances, this Family status was lost when an individual left the service, those of particular ability were said to be \"born to trial,\" and given the opportunity to make their Family status permanent. If these Trial-born of the Family were successful, they would be permanently \"matched\" to the lineage. Conversely, members of a Ruling Family could apparently also be \"released\" and \"rematched,\" although it is even less clear how this processes operated. It is possible that marriage was involved in matching, although no mention is yet known that indicates an institution of marriage among the Chiss. A hierarchy of leadership within each Family consisted of brothers and sisters (known collectively as siblings), plus cousins, and ranking distant relations—the last being the highest level that the most able Trial-born could reasonably hope to achieve. Individuals with the ranks of Aristocra and Syndic also served as high-level representatives of the Families, with seemingly plenipotentiary powers, though an Aristocra could hold only collateral rank within the internal hierarchy, and a Syndic at least could be Trial-born."},{"type":"paragraph","text":"The families themselves were quite aware of any opportunity where they were able to exploit the weakness of a rival. As such, they were quick to take offense at any insult that was perceived against their position. Those Chiss caught in the middle of inter-house rivalries spent much of their time in intelligence gathering in order to get useful information that could be used for blackmail even if it was only capable of being used many years in the future. This trait made the Chiss excellent counterintelligence agents with a trained member of their kind able to see through disguises, evaluate body language, detect idiosyncrasies in speech pattern and even distinguish authentic items from forgeries. Chiss officers, as seen by Jagged Fel during the Yuuzhan Vong War, informed the New Republic that the highest structures of power and influence within the Family hierarchies were kept largely secret from those outside them."},{"type":"paragraph","text":"The number of Ruling Families within Chiss society was not a fixed number and was in a state of flux. In 27 BBY when a group of Corellian spacers encountered the Chiss Ascendancy, there were Nine Ruling Families at the time. This was because their numbers fluctuated with events and political fortunes. As stated by Thrawn, over the various centuries, there had been as many as twelve and as few as three Ruling Families that led the Chiss. The Fifth Ruling Family were the Chaf, who wore yellow, and apparently held a specific portfolio for diplomacy and foreign affairs, while the Second and Eighth Ruling Families shared a military oversight role. It was to the second of these two Families that Thrawn and his brother Thrass belonged; they wore dark red, and naming patterns indicate that they were known as the Mitth family. By 22 ABY, the University of Sanbra indicated in their report that there were only four Ruling Families amongst the Chiss at that time."},{"type":"paragraph","text":"According to the Sanbra report, House Csapla was responsible for relationships between Csilla and the colony worlds, and the associated distribution of foodstuffs and the allocation of economic resources. House Nuruodo was responsible for relations with outsiders, including control of the CEDF. Chiss that had dealt with both the Empire and the New Republic were almost universally operatives of the Nuruodo family. House Inrokini was responsible for technological research, manufacturing, and the information infrastructure. And House Sabosen was responsible for law and order, healthcare and education. The cloaks of the representatives encountered in 29 ABY, in bronze, rust-red, gray and copper-green, implicitly represented the colors of these families. In that year, a Jedi delegation met with the leaders of the Ruling Families whose identities were concealed by hooded cloaks in what appear to have been symbolic shades of color denoting their bloodlines."},{"type":"paragraph","text":"In 22 ABY, the issue on preemptive strikes along with their non-aggression laws became a subject of strenuous debate between the Nine Ruling Families. If there were ever a deadlock over a decision among the Ruling Families, the deciding vote fell on the representative from the CEDF."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060808032202\/starwars\/images\/thumb\/4\/4a\/Outboundthrawn.jpg\/180px-Outboundthrawn.jpg","caption":"Thrawn as an officer in the CEDF."}]},{"title":"Government structure","level":3,"content":[{"type":"paragraph","text":"The heart of Chiss politics and government was on their homeworld of Csilla where the ruling families met the House Palace at Csaplar. It was there that both the Cabinet and Parliament resided. Representatives of the 28 colony worlds were located at Parliament where they were appointed as governors or House leaders. The Cabinet handled the intricacies of governing with all their decisions being approved by one of the four families. Chiss governmental structure existed to move important decisions up the chain of command and ultimately to the ruling families themselves. As such, individual colonies had their voices heard in the Parliament with these being taken up by the departments of the Cabinet after which they were finally given to the families The positions in Parliament were democratically chosen by colonial vote which differed compared to Cabinet who were all appointed by the families."},{"type":"paragraph","text":"Their government was highly structured and ordered with the rule of law being enforced by the ruling families. These were not biological family groupings but instead different branches of their government. The Csapla dictated colonial issues, natural resources and agriculture whilst the Nuruoda handled the military as well as foreign affairs. Inrokini were responsible for industry, science, communication and non-military technology with the Sabosen taking the duty of overseeing justice, public health as well as education. All \"four\" families along with the average Chiss citizen were represented at Parliament. Though not led by a dictator, the Chiss believed that only rigid discipline and superior technology were needed to hold the forces of anarchy at bay. The ruling class were known to engage in constant power struggles but despite this fact, the Ascendancy maintained strict controls over its territory which led to its civilization to prosper."},{"type":"paragraph","text":"One established body within the government structure was the Council of Families that was responsible for aspects of policy and strategy thus allowing them to shape as well as direct Chiss society across Ascendancy. It was known that the Council was capable of objecting in cases where a Ruling Family was conducting actions to upset the delicate power balance such as by forcibly taking advanced alien technology to provide their forces with an advantage over the others. However, this procedure was noted for being a long and complex one which was largely ineffective in practical considerations. Arisctocra's were also known to be capable of meeting with the Council in order to petition for the safe return of outsiders that were trapped within Chiss Space. In addition, there was a Chiss Senate with senatorial representatives present within the body."},{"type":"paragraph","text":"Chiss diplomats were typically assigned a staff of twenty who wore their own house colors and were capable of being assigned two squads of six warriors as an honor guard though these units also wore military black."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20090322012020\/starwars\/images\/thumb\/3\/34\/Chiss_Ascendancy.svg\/180px-Chiss_Ascendancy.svg.png","caption":"Insignia of the Chiss Ascendancy"}]},{"title":"Military forces","level":3,"content":[{"type":"paragraph","text":"The Chiss were noted for being a serious and disciplined race that managed to create an impressive military force as well as forge a large star-spanning empire.Their military was known as the Chiss Expansionary Defense Force which was also known as the CEDF, the Chiss Expansionary Fleet and the Chiss Defense Fleet. Whilst their kind were methodical as well as cautious; they were always prepared to respond with lethal force if their enemy made the mistake of firing first. Through the CEDF, patrolled the Unknown Regions and monitored any threat with their fleet of top-of-the-line capital ships as well as squadrons of clawcraft starfighters. In many similar respects to the Galactic Empire, the Chiss military was well armed and trained military force that encompassed several advanced as well as orderly worlds. It was known that they maintained an impressive fleet which was dedicated to the defense of their territory. In fact, their military was a sizeable force with the Nuruodo family being in charge of both the fleet and the army. As they had never needed to act as a single unit, the military was partitioned into 28 colonial units known as Phalanxes. Their operation usually fell upon the shoulders of an officer appointed by a House leader who were known as Syndics. The Phalanxes were a completely separate entity from the Chiss Expansionary Defense Fleet which was deemed a foreign affairs asset rather than a military one. Members of the Chiss Defense Fleet wore the color black as it was a combination of all colors which symbolized the fact that it drew its personnel from all the families. Even honor guard details of warriors wore military black instead of their house colors."},{"type":"paragraph","text":"It was known that anyone that was caught hiding illegal substances or supplying cargo to their enemies were likely to have their goods confiscated. The CEDF patrolled their growing territory and observed neighboring worlds. Furthermore, anyone that violated Chiss Ascendancy space were to be intercepted by the Household and Colonial Phalanxes who zealously guarded their territory. These served as a homeguard unit that protected the 28 colony worlds as well as the planets of the ruling families. As such, it was virtually impossible to infiltrate Chiss Space any intruders caught were often kept at a penal colony to suffer a prison sentence at an outlying system. Whilst the CEDF patrolled the borders of Chiss space, the Phalanxes responded to any threats that got past the Fleet. In times of crisis, however, the CEDF supplemented its numbers by drawing upon the ranks of nearby Colonial Phalanxes."},{"type":"paragraph","text":"A significant portion of the CEDF which mostly consisted of Mitt'raw'nuruodo's Household Phalanx took an extended leave of absence from the military. This was in order for them to deal with encroaching threats to the Chiss Ascendancy. Though this could be construed as secession or even treason, the ruling families took no part in inciting inflammatory action against this group. Thrawn's Phalanx, in the mean time, was known to had worked in conjunction with a cell of Imperials in order to conduct a more proactive campaign of guarding Chiss territory. This was done so in a manner that was not comfortable to the Chiss which the ruling families pretended to be oblivious of though the average citizen were well aware of these activities."},{"type":"paragraph","text":"It was known that senior officers of the Defense Fleet belonged to no Chiss family and were in fact stripped of both family name as well as privilege. This was because they were made formally part o the Defense Hierarchy so that they could be called upon to serve all Chiss without deference or prejudice. Thus, ultimately, military command was merit-based and did not involve any family connections. Once taken into the Hierarchy, the officers were required to prove themselves in a similar manner as how the Ruling Families selected merit adoptives. In fact, all warriors were made merit adoptives when they were accepted either into the Defense Fleet or the Expansionary Fleet. Admirals of the Defense Hierarchy took direct command of Defense Fleet battlegroups, and also held oversight over the Expansionary Fleet. The mandate of the Expansionary Fleet, in contrast, was defined as guarding the Chiss frontier and exploring unknown space beyond the edge of the Ascendancy, and its forces included Picket Forces commanded by officers known as Force Commanders (sometimes shortened to Commander; Crahsystor in Cheunh). The best-known of these frontier units is Picket Force Two, which in 27 BBY apparently consisted of three light cruisers, each with three fighter escorts, plus a further five fighters and two transport shuttles at their asteroid base in the Crustai system."},{"type":"paragraph","text":"Adding to the confusion is a variety of evidence for other Chiss military forces operating alongside, and sometimes in opposition to, the black-uniformed personnel of the Expansionary Fleet and the Defense Fleet. Thrawn's Household Phalanx has already been mentioned, and in 27 BBY, the Chaf family were also observed to deploy military forces of their own, capable of deploying nine light cruisers at short notice, in an effort to overwhelm an Expansionary Fleet picket force. Just as some of Thrawn's warriors wore the burgundy colors of the Ruling Family to which Thrawn belonged, many Chaf Family personnel were observed at this time wearing uniforms in the yellow of the Family they served."},{"type":"paragraph","text":"A command and control division within the military was the Chiss Defense Fleet Command which was responsible for assigning missions. There were thus potentially as many as five distinct military organizations within Chiss society:"},{"type":"list","elements":[{"text":"Defense Fleet—defensive fleet units under the authority of a central high command.","elements":[]},{"text":"Expansionary Fleet—frontier patrols and exploration missions.","elements":[]},{"text":"Colonial Phalanxes—planetary militias guarding the Chiss colony worlds.","elements":[]},{"text":"Household Phalanxes—paramilitary guards loyal to the aristocratic Ruling Families.","elements":[]},{"text":"Chiss warriors fighting for the Empire of the Hand—including Thrawn's rogue House Phalanx and possibly also other Chiss personnel among the \"forces of the Empire\".","elements":[]}]},{"type":"paragraph","text":"Additional to all this, of course, were the forces of Thrawn's rogue Household Phalanx: in 19 ABY they could deploy at least a hundred Blastboat-sized TIE scouts, and in 26 ABY they deployed a wing of 36 Clawcraft at Garqi and Ithor. By the time of the Swarm War in 36 ABY, the CEDF could deploy a powerful fleet of thirty Chiss Star Destroyers in the Battle of Tenupe, with each Star Destroyer massing more tonnage than an entire Picket Force of sixty years earlier."},{"type":"paragraph","text":"Chiss considered themselves to among the finest and most capable of warriors. One of the institutions where their military trained was known as the Chiss Academy that gave tasks to its students with high marks awarded depending on the degree of success achieved in the mission. Their cold disciplined nature made them brilliant strategists and excellent tacticians. Much of the ranking structure of the Chiss paralleled that of the larger galaxy with numerous titles that included:"},{"type":"list","elements":[{"text":"Syndic : senior officers that held the position of Syndic were at times appointed by House leaders to take charge of a Colonial Phalanx.","elements":[]},{"text":"Assistant Syndic : a seemingly senior post within the CEDF and was held by ex-Imperial Baron, Soontir Fel who held the post of Assistant Syndic.","elements":[]},{"text":"Chief Navigator : an apparently high ranking position within the hierarchy that existed in 29 ABY, the Human ex-Imperial officer Peita Aabe was Chief Navigator in that time.","elements":[]},{"text":"Admiral : consisted of senior officers of the Defense Hierarchy.","elements":[]},{"text":"General : senior ground-combat officers that served within the Defense Fleet with one known officer being Prard'ras'kleoni.","elements":[]},{"text":"Captain : ranking officers onboard naval ships.","elements":[]},{"text":"Commander : a common position that denoted officers in charge of many elements that ranged from cadet squadrons, frontier patrols, space station command and even to a major fleet unit.","elements":[]},{"text":"Lieutenant : this included personnel in cadet units and were junior officers.","elements":[]},{"text":"Chief Engineer : a primarily positional title and included Yal'avi'kema of the Springhawk in 27 BBY.","elements":[]},{"text":"Medical officer : another positional rank which was used by Baltke of the Fell Defender in 36 ABY.","elements":[]}]},{"type":"paragraph","text":"Sizable forces of armored infantry and artillery were deployed by dropships at the Battle of Tenupe. During the Swarm War, the Chiss made use of commando units that were deployed on specialist tasks such as the placement of vape charges on selected locations. They wore camouflaged color-shifting, fractal-pattern armor that allowed them to sneak across battlefields with ease, and carried demolition satchels and charric guns. They did not fear death and would sacrifice themselves if necessary to their cause. One notable engagement was a commando squad attempting to destroy a crashed Chiss vehicle."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090421000753\/starwars\/images\/thumb\/9\/94\/ChissBodyguard.jpg\/180px-ChissBodyguard.jpg","caption":"A Chiss bodyguard."}]},{"title":"Uniforms","level":3,"content":[{"type":"paragraph","text":"Uniforms tended to hold distinctive colors that indicated a Chiss's place within their society; either as a member of a House or part of the military."},{"type":"paragraph","text":"Those Chiss that were part of the Defense Fleet wore military black uniforms as this color was a combination of all colors. This signified the fact that the military drew its members from all the families. All military personnel of the CEDF wore identical black uniforms that were sharply-cut with rank varying by way shoulder patches. Cadets wore a black uniform or flightsuit with some holding blue piping on the arms and legs whilst others were marked in red which represented the Red Flame ideal. On at least one occasion, Chiss pilots of Thrawn's Phalanx were seen to wear white uniforms rather than the normal black. Certain Chiss were known to wear black uniforms that were unadorned by either rank or other identifying markers. Junior personnel wore shoulder patches that consisted of green, yellow and blue. Officers within the CEDF were known to dress in purple-black uniforms. Senior officers of the rank of Force Commander such as Thrawn who commanded a picket force wore the same black uniform but with a larger burgundy patch on the shoulder as well as a pair of elaborately tooled silver bars on their collars. Captains were known to wear green patches on their tightly fitting uniforms. Those holding the rank of General were known to wear tunics that were predominantly black robes of state on diplomatic missions and consisted of small swatches of dusky red at various places on the sleeves and upper shoulders. Admirals differed greatly compared to normal military personnel as they did not wear military black but instead wore a dazzling white uniform that covered them from collar to boots."},{"type":"paragraph","text":"Each of the Ruling Families were known to possess their own family colors with its members wearing the color to show their allegiance. Members of the Chaf Family wore the color yellow were also known to wear elaborate robes of state that were long, flowing robes that were shades of yellow with gray trim. These individuals, such as those who held the position of Aristocra, wore layered gray robes with a yellow collar and yellow highlights. Lower ranking aides were known to wear exotically cut jumpsuits that composed of shades of yellow. Escorts such as family guards for higher ranking officials of the Fifth Ruling Family were known to wear dark yellow outfits with their weapons fitted to belts. Another notable family was the Eighth Ruling Family whose officials wore short robes and talls boot that were composed of a patchwork pattern of gray and burgundy. The House Phalanx Commanders that served Thrawn were known to wear a burgundy uniform. These same forces that were stationed at the Hand of Thrawn were seen wearing burgundy uniforms. Although house guards wore their respective colors, honor guards were known to wear military black as well."},{"type":"paragraph","text":"The representatives of the Four Ruling Families which included Nuroudo, Irokini, Sabosen and Csalpar were known to wear head-to-foot robes with hoods that completely masked their faces. Each individual's identifying house color was used as the only distinguishing feature which, in this case, was bronze, rust-red, silver-gray and copper-green."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100222144016\/starwars\/images\/thumb\/9\/94\/Fehlauur.jpg\/180px-Fehlauur.jpg","caption":"Moff Fehlaaur'aitel'loro"},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20090420235857\/starwars\/images\/thumb\/0\/0f\/ChissFemale.jpg\/180px-ChissFemale.jpg","caption":"A female Chiss admiral"}]},{"title":"Language and names","level":2,"content":[{"type":"paragraph","text":"The Chiss language was Cheunh and was first accepted during the developing years of their civilization when they formed a planet-wide government which consisted of a single tongue that their society accepted. It was known to be a dense and difficult synthetic language to master as complicated ideas were expressed by uniting unrelated words into larger words. Thus, it had relatively few core words though the syntax required the speaker to piece together compound words which was complex and involved. One factor that certainly added to the complexity of the language was the fact that written Cheunh was not set down in a phonetic alphabet. In writing, Cheunh did not possess an abstract alphabet like Aurebesh with ideograms representing concepts and complex ideas being expressed by combining simpler ideograms. The Chiss held great pride in not only understanding but conversing in such a convoluted language. It was hard for outsiders to understand though Car'das believed it to be a logical, and the Chiss believed that the grammar was logical and easy to learn. However, the Chiss believed it was quite impossible for non-Chiss to learn to speak it properly. Though this complex nuance filled language was difficult for non-Chiss to master due to its intricacies, the Chiss themselves had little trouble mastering Basic though many were unfamiliar with it. At least some phrases in the language were highly idiomatic – the pejorative moactan teel literally meant \"fair-haired\", implying that something about the addressee was non-Chiss, and thus barbarous."},{"type":"paragraph","text":"Traditionally, Chiss names consisted of a long tripartite structure with three distinct sections. Usually, this followed the convention of the first and last being family names and the middle being the given name. Abbreviated versions of these were known as core names with their usage being a questionable choice. This was because full names were required for formal occasions, strangers and those that were believed to be the speaker's social inferior. However, this policy was capable of being broken if there were good and valid reasons for doing so. Such was the case when dealing with outsiders who had trouble pronouncing Chiss full names. The predominance of core names, at least in communication with outsiders, was such that a number of such names were recorded without the full name being known, such as Prakk, Kayree, Lev, Szardra, Voss and Zilvad. Apparently, the core name was typically formed by combining the short central section of the name with the last sound of the preceding section and the opening sound of the following. For example, Mitth'raw'nuruodo was Thrawn, Kres'ten'tarthi was Stent and Brast'alshi'barku was Talshib. The female officers Hess'irolia'nuruodo (Irolia) and Ina'ganet'nuruodo (Ganet) appear to be exceptions to this rule."},{"type":"paragraph","text":"The Chaf diplomats Chaf'orm'bintrano (\"Formbi\") and Chaf'ees'aklaio (\"Feesa\") bore the name of the Ruling Family to which they belonged as the first element of their full name, and this also defined the opening sound of their core name. Likewise the brothers Mitth'raw'nuruodo and Mitth'ras'safis were both (adoptive) members of the Eighth Ruling Family, suggesting that this family was known as the Mitth. A similar family relationship is implied between General Prard'ras'kleoni (\"Drask\") and Station Commander Prard'enc'iflar, although it is not known whether \"Prard\" is one of the Nine Ruling Families."},{"type":"paragraph","text":"Senior Chiss military personnel surrendered Family status on assuming high command. Admiral Ar'alani of the Defense Hierarchy and possibly Sev'rance Tann of the CIS seem to have eliminated their Family designation from their names. The Fel Empire and later Krayt Empire Moff Fehlaaur'aitel'loro was consistently addressed by his fellow Moffs as Fehlaaur, the section usually reserved for the family name. Another Chiss with an anomalous name was the important historical figure Jer'Jo Cam'Co, a Syndic and one of the founders of the Ascendancy."},{"type":"paragraph","text":"Encounters with the greater galaxy did not leave a lasting impression on the Chiss by the fact that they remained largely unaware of standard languages such as Huttese and Galactic Basic Standard, with communications with outsiders being conducted instead through local trade-languages such as Minnisiat."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20100926215657\/starwars\/images\/thumb\/0\/0b\/Force_Shockwave.jpg\/220px-Force_Shockwave.jpg","caption":"A Chiss Dark Jedi"},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20131217213913\/starwars\/images\/thumb\/4\/4d\/FemaleChissEntertheUnknown.jpg\/200px-FemaleChissEntertheUnknown.jpg","caption":"A female Chiss."}]},{"title":"Culture","level":2,"content":[{"type":"paragraph","text":"Galactic perceptions of Chiss behavior was, following the Battle of Endor, much based on the personality of Grand Admiral Thrawn. However, following that period, it became apparent that Thrawn himself was an exceptional member of his kind with all Chiss demonstrating individually different traits. The impression held by the galaxy was that the Chiss were arrogant, aloof and calculating beings. However, while this was true in some cases, the Chiss demonstrated varying personality types similar to other species. General traits demonstrated by them, however, were being well-educated, artistic and cautious when dealing with outsiders. Outsiders had the general impression that the Chiss were very polite and highly civilized species. Their reputation meant that they were both respected and, in some cases, feared."},{"type":"paragraph","text":"The harsh cold conditions of Csilla led to the Chiss developing a self-reliant streak which was the core of their notoriously aloof personalities. This led to outsiders characterizing their race being as cold as the ice plains of their homeworld. As a people, they were intelligent as well as highly valuing of their privacy. This extreme protection of their society was what allowed them to remain hidden from the rest of the galaxy for so long. They were described as being pensive as well as contemplative, deliberate and calculating. This meant that they often studied situations from many different viewpoints. As such, they considered all alternatives to a situation and even considered scenarios of what would have happened if they had made different decisions. In combat situations, Chiss acted both calmly and intelligently as well as formed well planned strategies. Chiss did not give themselves over to passion and instead viewed problems as curiosities that needed to be solved through rigorous application of brainpower. As such, they did not allow hot emotions to interfere with their methodical analysis of a problem through logic. In terms of personality, they often displayed a cold, arrogant and disciplined behavior. Though they showed a cold lack of emotion, their actions were not necessarily impartial as most were motivated by the pursuit of power which was encouraged by their ruling families."},{"type":"paragraph","text":"In general, they lived a harsh but disciplined life style where self control along with propriety were the most valued character traits that all Chiss aspired to. While passions themselves were recognized, they were done so with disdain as such energy was believed to be better applied elsewhere. The regimented style of their society meant that crime was abhorred and seen as the weakness of an individual. Blaming society was a notion completely alien to their mindset and justice was given with little thought on compassion. However, the Chiss did not believe in capital punishment as they recognized it as being an irrational, emotionally driven reaction instead of being a true deterrent. Instead, the greatest punishment they gave for their most heinous of crime was exile. Due to the great importance of family loyalty existing in their culture, exile was considered a grave punishment for any Chiss to face."},{"type":"paragraph","text":"During their childhood, Chiss were taught to read through the great stacks of data of the great library on Csilla. These contained basic information that every Chiss absorbed during their childhood after years of intense schooling. Among their kind, there was no period of adolescence as their children matured early and were given adult responsibilities very quickly. Scientists believed that they essentially bypassed the adolescent stage and reached maturity quickly. By the age of ten, they were ready to join military service and wear cadet uniforms. The species were highly reserved in their emotions and often did not display feelings openly; either by smiling or by warm gestures. As such, they rarely were vocal about any feelings of anger or frustration though they did possess some curse words to employ should the situation warrant such an expression."},{"type":"paragraph","text":"Though this was the impression projected, the Chiss were also a thoughtful people. While they were deliberate and calculating, they were not above wondering about how certain events might have turned differently had circumstances been altered. Much of their ability to solve problems stemmed from their reliance on data, and when faced with unpredictable situations, typical Chiss behavior meant that they would rather flee in the scene. This was not a universal characteristic as certain individuals with the ability to learn under such circumstances, like Thrawn, were able to continue to fight. In fact, whenever a Chiss suffered a setback or even a defeat, they often contemplated what might had been done differently in order to ensure that a victory was achieved in the next engagement. Chiss were noted for possessing an unparalleled aptitude for tactical thinking. The ideals of the Chiss were idolized in the form of the Red Flame which was a combination of courage, discipline and cunning."},{"type":"paragraph","text":"Their society was highly structured and ordered with the rule of law being enforced by the ruling families. These were not biological family groupings but instead different branches of their government. The Csapla dictated colonial issues, natural resources and agriculture whilst the Nuruoda handled the military as well as foreign affairs. Inrokini were responsible for industry, science, communication and non-military technology with the Sabosen taking the duty of overseeing justice, public health as well as education. These ruling families were composed of clans that were headed by government officials known as Aristocras. Those chiss that belonged to the same house defended one another at every opportunity whilst those from competing houses searched for facts that could be used to snipe or undermine the other whilst attempting to secure any advantage for themselves. Though Thrawn was an exceptional member of his species, his rational approach to problem solving was shared by the ruling families that governed the Chiss Ascendancy. Members of the ruling class of Chiss were notable for being an aristocracy within their society."},{"type":"paragraph","text":"As a general rule, Chiss did not take part in any action that would bring shame on their house with entire family lines exiled due to the actions of a single member. The ruling families themselves were quite aware of any opportunity where they were able to exploit the weakness of a rival. As such, they were quick to take offense at any insult that was perceived against their position. Those Chiss caught in the middle of inter-house rivalries spent much of their time in intelligence gathering in order to get useful information that could be used for blackmail even if it was only capable of being used many years in the future. This trait made the Chiss excellent counterintelligence agents with a trained member of their kind able to see through disguises, evaluate body language, detect idiosyncrasies in speech pattern and even distinguish authentic items from forgeries."},{"type":"paragraph","text":"The long spacefaring history of the Chiss led to the creation of a superior combat force with their starfighter pilots being infamous throughout the Unknown Regions. Such squadrons were ruled by discipline and their pilots were known to spare disabled starships if they broadcasted a surrender. They also did not celebrate until their duty was completed as any celebrations made before such an event were considered false. Despite this, they were highly committed in their duties and a Chiss warrior, if given an order, would carry it out even if they disagreed with it, which highlighted their belief in the chain of command. It was also known that the Chiss as a culture had an aversion to suicide and expendability as they found those actions to be wasteful. Though this was the case, there were occasions where Chiss gave their lives rather then surrender. In such circumstances, this was either due to the importance of the strategy for their people or because surrendering to a certain foe was considered a fate worse than death."},{"type":"paragraph","text":"The Chiss had a keen interest in art and science and were skilled in mathematics. Their thought processes were based around a logical mindset, being interested in philosophy and in learning about other cultures. On the other hand, they were also xenophobic, and any knowledge gained from other cultures was used as a means of gaining a advantage over a potential foe. One notable group of individuals that were involved in deep contemplation were Chiss sages who studied the threat of the Yuuzhan Vong and concluded that the extragalactic invaders must have spent countless generations traveling through the void between galaxies."},{"type":"paragraph","text":"Their clinical detachment was similar to how a biologist studied an insect which was how the Chiss view their foes and they often engaged in extreme caution in such circumstances. When among non-Chiss, individual members of the race were often aloof and pensive as they plotted tactics which would ensure a victory if a confrontation were to occur. Chiss never truly lost their xenophobic instincts, even when they were among members of other species for long periods of time. Ultimately, Chiss were loyal to their own kind and looked down upon aliens as being barbaric as well as immature. Despite this fact, most Chiss were considered peaceful and did abide by the strict code of conduct that governed their race. In addition, though xenophobic, they were at times willing to accept members of other races into their ranks so long as they proved to be exceptional as well as trustworthy individuals. Furthermore, the subject needed to prove themselves capable of following Chiss disciplines in order to gain their loyalty and respect. The Chiss were considered an honorable people who did not kill more than they thought was necessary to accomplish their goals. However, they were not above using biological weapons of mass destruction against a foe should it be felt that their survival was threatened."},{"type":"paragraph","text":"When attacked, they responded with calm, intelligent and well-planned strategies while at the same time remaining an honorable species. They never made conflicts personal and were very rarely aggressors as they prefer to let conflicts come to them. Among the most famous traits of their kind was their refusal to invade the territories of other species or even wage war over potential foes. As such, they did not believe in the concept of a preemptive strike against their foes. Rather, they only responded to an enemy assault after their foes had struck first. This was actually a by-product of their cool and cautious philosophy. This was because, in their view, that by allowing their enemy to draw first blood they guaranteed that that they were acting in the right. Furthermore, it divorced their actions from any recklessness which resulted from either impulsive anger or the incomplete intelligence of an enemy's intentions. Striking first was thus an anathema to their discipline with even tactically sound preemptive strikes being the subject of controversy. This moral imperative was so pervasive in their culture that they exiled Thrawn from their society for breaching it. Once attacked, the Chiss did not rest until their attackers were destroyed or completely subjugated."},{"type":"paragraph","text":"The Chiss society had no concept of finances or money with everything being provided for by the state. They also maintained tightly controlled borders that were self-sufficient in the isolated territory that they rule. Their colonies supplied them with both food and resources while developing technology comparable to the rest of the galaxy. As such, they saw no need for trade and their culturally derived contempt of \"lesser races\" also prohibited them from forming better relations with their neighbors. In fact, the motive for their exploration and expansion was difficult to determine as they lacked the passion for conquering the unknown which was a trait that Humans possessed. In addition, they did not claim new territory out of greed or for a hunger for power. Their space program was mostly governed by the basic need to manage their population and gathering resources without upsetting their homeworlds ecosystem. Their territory sufficed for their entire population needs. A report by the University of Sanbra indicated that the Chiss population numbered nearly 5 trillion. Despite their growing border, they still fostered a cultural contempt for other species. Instead, they believed in isolation and the preservation of their heritage."},{"type":"paragraph","text":"It was believed by many xenosociologists that the rigid and disciplined nature of Chiss society stemmed from their cold environment on their homeworld. They were noted for displaying no signs of decadent or greedy behavior and thus it was concluded that any signs of colonial expansion were mostly due to the Chiss desiring to put order onto chaotic locations. This was in fact the leading theory by the University of Sanbra who concluded that the motivation for Chiss expansion was their ideal of seeking to impose order on what they saw as a chaotic and barbaric region. Being nearly impossible to enrage, they preferred to only act when all factors had been taken into account with the issue itself analyzed. In addition, they believed firmly in the chain of command as well as positions of authority. In fact, Chiss were taught to respect the position itself rather than the person holding that title. As such, Chiss often responded when an individual called out the rank rather than their name."},{"type":"paragraph","text":"Some reports indicated that there were no Chiss Jedi and it was not known whether there was a Force-tradition within Chiss society. However, this did not appear to be the case as there were at least two known Force users amongst the Chiss."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090312131703\/starwars\/images\/thumb\/3\/3f\/Thrawn_aodd.jpg\/200px-Thrawn_aodd.jpg","caption":"Thrawn as Grand Admiral, the figure that defined many outsiders' image of the Chiss."},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20110127014310\/starwars\/images\/thumb\/5\/5a\/Jagged_fel.jpg\/180px-Jagged_fel.jpg","caption":"Jagged Fel, a Human officer serving with Chiss forces."},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100510012712\/starwars\/images\/thumb\/b\/b9\/Chiss-squib-tur.jpg\/200px-Chiss-squib-tur.jpg","caption":"A Squib in the Unknown Regions meeting a pair of Chiss."},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20110311205750\/starwars\/images\/thumb\/3\/33\/ChissTEA.jpg\/250px-ChissTEA.jpg","caption":"A pair of scouts on Csilla."},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100528194350\/starwars\/images\/thumb\/2\/26\/ChissScoundrel-TUR.jpg\/200px-ChissScoundrel-TUR.jpg","caption":"A female Chiss at a cantina tended by an Aqualish"},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110114143635\/starwars\/images\/thumb\/2\/2b\/Force_Jump.jpg\/200px-Force_Jump.jpg","caption":"A Chiss Force user."}]},{"title":"Technology","level":2,"content":[],"images":[]},{"title":"Construction and automation","level":3,"content":[{"type":"paragraph","text":"The Chiss were notable for having developed their technology independently from outside sources though they managed to develop analogs of many standard galactic technologies. A major problem with understanding Chiss technology is distinguishing specifically Chiss elements from its wider context. For instance, the celebrated Nssis-class Clawcraft was a hybrid of Imperial and Chiss technology, and may have also involved the input of other species. These blue-skinned humanoids were well known for their self-control and intelligence that were traits which translated into a series of well designed as well as innovative starships. Travel through hyperspace required Chiss starships to rely upon a number of navigational anchor points that spread out from Csilla. Such a system allowed the Chiss to explore the galaxy methodically though kept them from encountering other cultures. Due to the secrecy involved in Chiss internal politics, outsiders knew very little about individual Chiss manufacturers."},{"type":"paragraph","text":"Some Chiss structures were starkly angular, perhaps inspired by the icy geometries of Csilla's glacial landscape. We can note the double-pyramid shape of the Brask Oto space station in the Redoubt, and the angular, faceted hull-design of the ships of the Fifth Ruling Family, such as Chaf Exalted and Chaf Envoy. However, the distinctive design of these ships was highly symbolic, designed to identify them as Chaf Family consular ships and even to identify the specific status and lineage of the Family members they carried. Combat warships of the Expansionary Fleet had far more curved and fluid hull-lines. To outsiders, clawcraft had only been a recent encounter during the era of the Yuuzhan Vong Invasion. At the time, the University of Sanbra only had limited reports of Chiss capital ships due to the fact that none had been seen in action at the time. A report by the University held the view that the Chiss did not possess a ship larger than a 300 meter escort frigate."},{"type":"paragraph","text":"Their hyperdrives were not as efficient as the latest models developed by the Corellian Engineering Corporation though they were competent and quite capable of travelling across the distances of their territory. During their star-travel era, they developed the ability to form hyperfields by using precise irradiation of composite materials. However, the early pioneers of this technology were unable to sustain the field around larger vessels that had been designed to carry passengers. Thus, their scientists worked on creating a habitable hyperspace bubble whilst combating field decay though others worked on outfitting automated drones with early hyperdrives with specialized beacons that was responsible for developing the early navigational anchor-points throughout the Unknown Regions. Modern era Chiss craft used the anchor-points for travelling through Chiss Space which was why their vessels lacked navicomputers. This had the effect of preventing the Chiss from safely leaving their borders."},{"type":"paragraph","text":"By 27 BBY, their ship engines were capable of entering into hyperspace in such a manner that crewmen were at times unable to determine that the ship had jumped which led to some speculation that Chiss hyperdrives were in fact more advanced than the Republic's at that time. Chiss vessels had precise hyperdrives and navicomps capable of making lightspeed microjumps as tactical maneuvers during combat. Their drive system was highly advanced to the point that few ships could match a clawcraft in terms of maneuverability though their hyperdrives were known to malfunction at times. As such, all Chiss vessels possessed an emergency mechanism that allowed them to eject their hyperdrives."},{"type":"paragraph","text":"An offshoot of their hyperdrive technology were Chiss homing beacons that were not only reliable but required very little energy to operate. By utilizing an energized domain of hyperspace itself as a carrier, they were able to generate a transmission that was only detectable by the Chiss."},{"type":"paragraph","text":"Similar to many races in the Unknown Regions, the Chiss were known to not possess droids within their society. The Chiss typically did not see any use in droids as they found them to be slow and vulnerable in combat engagements. Soontir Fel during his time among their Chiss attempted to influence their ways by explaining that expendability was a useful asset in battles with droids giving a crucial element in such engagements. To show the Chiss the advantage in droids, he and a group of engineers began working on a prototype droid fighter. In spite of the lack of droids, many Chiss ships were highly automated—a cruiser more than two hundred meters long had an operational crew of less than thirty—and prior to the Clone Wars, their frontier pickets, which operated beyond the beacon network."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20110531200315\/starwars\/images\/thumb\/6\/65\/NssisClassClawcraft-NEGVV.jpg\/180px-NssisClassClawcraft-NEGVV.jpg","caption":"Chiss Clawcraft"}]},{"title":"Weapons and defenses","level":3,"content":[{"type":"paragraph","text":"It was known that an initial analysis of Chiss weapons through sensor scans led to an unknown form of offensive weaponry. However, a cursory glance indicated that their fighter craft were equipped energy weapons, projectile weaponry and an unknown form of missile launcher. As such, it was easier to say that Chiss weapons technology was different from that of the Republic than to compare it qualitatively. For example in place of ion cannon, Chiss warships used missiles that deployed charged Conner net-like weapons called shock nets that could reach up to a kilometer wide, which could disable and trap light freighters, entire formations of starfighters, or even incoming missile salvos."},{"type":"paragraph","text":"The Chiss used a unique type of energy weapon, the charric. This weapon fired a lancing blue beam, sometimes described as a maser, which delivered thermal energy comparable to conventional blaster weapons coupled with a much greater kinetic punch, but lacked a stun-setting. Low-power shots instead administered disabling burns. The most common form of charric was a hand-held carbine, but pistols are also known, and larger versions of the weapon were carried by some starfighters, and included among the heavy weapons batteries of capital ships and bases."},{"type":"paragraph","text":"In the years before the Clone Wars, it would appear that Chiss beam weapons were limited to charric energy, but by 19 ABY, the Household Phalanx base at the Hand of Thrawn mounted both turbolasers and heavy maser emitters, while both Chiss-style weapons mounts and standard Sienar Fleet Systems blasters were observed on various TIE variants flown by Phalanx pilots. By the time of the Swarm War, the CEDF had certainly adopted standard blaster and laser technology alongside maser weaponry: Chiss Star Destroyers mounted turbolasers alongside megamasers, while their heaviest tactical artillery pieces, known as MetaCannon, were capable of being configured to fire charric beams, blaster bolts, or physical artillery shells."},{"type":"paragraph","text":"In later decades, some Chiss devices were highly advanced. Examples included chameleon-cloaked armor that enabled infantry to blend into the terrain, and long-range tracers that activated only in hyperspace, enabling its users to track targets across Galactic distances without transmissions being picked up by standard security scans."},{"type":"paragraph","text":"The Chiss also made use of more sinister uses of technology and had no ethical objections to their deployment in wars. This was seen in the development of the Parasite bomb bio-weapon and their use of deadly radiation bombs. They also worked in conjunction with the Galactic Alliance on their Alpha Red virus"}],"images":[]},{"title":"Known planets and locations","level":2,"content":[{"type":"paragraph","text":"In the Chiss Ascendancy"},{"type":"list","elements":[{"text":"Csilla—ice-girt homeworld and political capital of the Chiss. Site of the city of Csaplar and the Expeditionary Library.","elements":[]},{"text":"Sarvchi—colony world from where Chaf'orm'bintrano sent a message to the Jade Sabre in 22 ABY.","elements":[]},{"text":"Crustai—colony world where Chaf'orm'bintrano later rendezvoused with the Jade Sabre en route for Outbound Flight.","elements":[]},{"text":"The Redoubt—dense star cluster developed as an interstellar fortress by the Chiss. Site of Brask Oto and the unnamed planet on which Outbound Flight came down.","elements":[]},{"text":"Brask Oto Command Station—CEDF space station serving as the barbican for the Redoubt.","elements":[]},{"text":"Tenupe—captured from the Killiks during the Swarm War.","elements":[]},{"text":"Thrago—site of a CEDF supply depot anchored around a small moon, destroyed by rogue Jedi in 36 ABY.","elements":[]},{"text":"Rata Nebula—an H II region, within which lies the system containing Rhigar.","elements":[]},{"text":"Rhigar—site of a Chiss military academy in the Rata Nebula, with three moons: the green-hued Asdroni, the forest moon Rhigar 2, and the more distant, blue-tinged Rhigar 3","elements":[]},{"text":"Klasse Ephemora system—remote hinterland system surrounded by navigational anomalies, centered on the star Klasse Ephemora A; location of the gas-giant Mobus.","elements":[]},{"text":"Mobus—gas giant in the Klasse Ephemora system. Zonama Sekot sought refuge in a lunar orbit around Mobus after its flight from its home system in 29 BBY, and from 30 ABY, Zonama Sekot was resettled by the Yuuzhan Vong remnant.","elements":[]}]},{"type":"paragraph","text":"Outside the Ascendancy"},{"type":"list","elements":[{"text":"Nirauan—home to a large House Phalanx garrison at the Hand of Thrawn, nominal liaison post between the Imperial Remnant and the Ascendancy, also command post for the Empire of the Hand.","elements":[]},{"text":"Taat—Killik Nest with many Chiss Joiners; based on Jwlio in 35 ABY, later relocating to a planet in the Utegetu Nebula; by 36 ABY they had largely transferred aboard a colony ship to fight in the Swarm War.","elements":[]},{"text":"Thule—millennia-old Sith garrison world, with a Chiss colony among it inhabitants.","elements":[]},{"text":"Yashuvhu—remote hinterland planet with a Force-sensitive Human population; homeworld of the duuvhal, and of Force-talent Valara Saar who drove the Chiss from the planet.","elements":[]}]}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Chiss first appeared in Timothy Zahn's novel Heir to the Empire, in the form of Grand Admiral Thrawn, but the name of his people was not revealed for another eight years, until Zahn's Hand of Thrawn Duology."},{"type":"paragraph","text":"Although the basis of the Chiss naming pattern and the distinction between the House Phalanx and the Ascendancy were established in Vision of the Future, these were apparently misunderstood by or imperfectly communicated to some of the authors of the New Jedi Order novels and concurrent sourcebooks. This led to some continuity uncertainties in Red Sky, Blue Flame, The New Jedi Order: Dark Journey, and The New Jedi Order: Force Heretic II: Refugee."},{"type":"paragraph","text":"Chiss bartenders appear in the two most recent installments of the computer-game series focusing on Kyle Katarn. In Jedi Outcast, Kyle has a brief conversation with a Chiss bartender on Nar Shaddaa, who has not yet mastered all aspects of the grammar of Basic. In Star Wars: Jedi Knight: Jedi Academy, his apprentice Jaden Korr encounters a Chiss bartender on Nar Kreeta."},{"type":"paragraph","text":"The only known members of the Chiss species to wield the Force openly are Dark Acolyte and CIS general Sev'rance Tann, and Jedi Padawan Nuru Kungurama."},{"type":"paragraph","text":"Chiss are a playable species for the Sith Empire in Star Wars: The Old Republic. They may choose to be Imperial Agents or bounty hunters. For a fee of in-game currency, or if the player reaches level 50 with a Chiss character playing one of those classes, they may unlock the option to make a Chiss character of any class—Republic or Empire—thus opening the opportunity to create a Chiss Sith or Jedi."}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Chiss on Star Wars: The Old Republic Wiki","elements":[]},{"text":"Chiss on SWG Wiki","elements":[]},{"text":"Analysis of Chiss physiology at the Star Wars Technical Commentaries fansite","elements":[]}]}],"images":[]}]}