{"sections":[{"title":"Calibop","level":1,"content":[{"type":"paragraph","text":"Calibops were an avian sentient species known during the times of the New Republic. The species had manes and prehensile wingtips. They also had a reputation of being better with words than with acts, something that not even the Calibops themselves argued."},{"type":"paragraph","text":"A number of Calibops were seen in the galaxy, including Chief of State Ponc Gavrisom of the New Republic, Sergeant at Arms Mif Kumas and a member of Boba Fett's Mandalorian Protectors."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A Calibop was a tall avian sentient. At least one Calibop had pale blue eyes. A Calibop also had a mane of feathers that the individual could shake, sometimes indicating an easygoing criticism."},{"type":"paragraph","text":"A Calibop had a big beak that could be used to whinny in the species' equivalent to a sigh, or to expel sounds created in the depths of the Calibop's throat. A Calibop had a robust voice generated in the beak."},{"type":"paragraph","text":"Calibops had big wings that did not allow them to fly, but an individual could flutter them to increase his walking speed. The wings could be folded either in front or behind the person, and were strong enough to be used in melee combat. The tips of the wings were prehensile like fingers. Calibops used these as fingers to press keys, or to flicker restlessly."},{"type":"paragraph","text":"Calibops also had tails that they could flicker in what was considered the Calibop version of a shrug."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Calibops had a reputation for being particularly rhetorical, even if it detracted their skill for other activities seen as more active. The Calibops themselves were familiar with their stigma, but many of them believed that words were useful at certain times, even if only actions could be useful at other times."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Calibops were among the many sentient species in the galactic community as of 18 ABY. A Human from the Galactic Empire could shake hands with a Calibop."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20081003110350\/starwars\/images\/thumb\/b\/b3\/Calibop.JPG\/180px-Calibop.JPG","caption":"Ponc Gavrisom, a Calibop"}]},{"title":"Calibops in the galaxy","level":3,"content":[{"type":"paragraph","text":"One of the most prominent Calibops in galactic history was Ponc Gavrisom, Chief of State of the New Republic from 18 ABY to 21 ABY, and signatory of the Bastion Accords of 19 ABY that marked an official ending to the Galactic Civil War."},{"type":"paragraph","text":"Another Calibop, Mif Kumas, was Sergeant at Arms of the Galactic Senate from 21 ABY to 27 ABY, when the august body was dissolved."},{"type":"paragraph","text":"In 29 ABY, a tall Calibop was seen among the Mandalorian Protectors, also including Humans and Bothans, gathered by Boba Fett in Caluula Station, soon before it was assaulted by the Yuuzhan Vong invaders."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The first appearance of this species was in the novel Specter of the Past (1997), by Timothy Zahn. The only Calibop to appear in that novel was Ponc Gavrisom. The species was first depicted graphically in an image in The Essential Chronology."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Specter of the Past","elements":[]},{"text":"Vision of the Future","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Millennium Falcon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Chronology","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]}]}],"images":[]}]}