{"sections":[{"title":"Critokian","level":1,"content":[{"type":"paragraph","text":"Critokians were a species of two-meter-tall, arachnoid sentients from the planet Critoki, although many dwelt in tribes on the moon Yavin 4. They used large claws to hunt prey on the jungle world, and several of their number eventually departed Yavin 4 and found work as bounty hunters. The Critokians' biological makeup featured a complex nervous system and six holes though which they could both communicate and breathe."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Critokians were sentient beings, two meters tall,arachnoid yet bipedal, with four limbs. Their fingers were tentacle-like in nature, an arrangement that allowed them to manipulate objects. Members of the species possessed large claws and could both run fast and swim at a rapid pace. Each Critokian had six holes on the forehead that permitted respiration on both land and water, as well as facilitating communication. The upper portion of their main body, or head, housed the complex nervous system. The lower portion contained the Critokian heart, as well as the circulatory and digestive systems. The skin of a Critokian was yellow, although it also featured black coloring at its joints, as well as at the base and tip of the body. Each member of the species had two, red eyes: one on either side, slightly above the point at which the larger limbs joined with the main body."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Critokians hailed from the planet Critoki and lived in tribal societies on the jungle moon Yavin 4. With their large claws, they were able to kill prey. In order to communicate, they used a series of hoots and whistles."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Critokians evolved on Critoki, a world that became part of the Esstran sector, within the Trans-Hydian reaches of the Outer Rim Territories, sometime between 3000 and 1000 BBY. Their homeworld fell within contested space during the Clone Wars of c. 19 BBY, then fell within Warlord Zsinj's territory from 4 ABY until 8 ABY; it then lay within the contested Borderland Regions during the Thrawn campaign before falling within the bounds of Darth Krayt's Sith Empire by 137 ABY. At some point in their history, those Non-Humans also established their presence on Yavin 4, one of the three habitable satellites of the gas giant Yavin Prime."}],"images":[]},{"title":"Critokians in the galaxy","level":2,"content":[{"type":"paragraph","text":"Several Critokians found their way off Critoki and Yavin 4 to become skillful bounty hunters. At Sok Brok's Fiftieth Annual Pet Show on Taris, visitors could encounter an arachnoid Critokian walking a bipedal ornuk on a leash. That sight, if admittedly comical, was not considered uncommon."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Ooi Say Hien, at the age of 13, created the Critokian species through the \"Design An Alien\" competition held in Star Wars Galaxy magazine. The contest was launched in Star Wars Galaxy Magazine 3 (1995), and the winners were published in Star Wars Galaxy Magazine 7 (1996). Hien's entry was the winner for the \"Under 16 years old\" subdivision of the contest. Continuity editor Leland Chee later stated that published \"Design an Alien\" material was to be considered canon. The Critokians were subsequently referenced by James Luceno in his novel Millennium Falcon (2008), making them one of the two \"Design an Alien\" alien species to be directly referenced in a later work—the other being the Skels of Hoth. In The Essential Atlas (2009), authors Daniel Wallace and Jason Fry established the world of Critoki. Fry had drawn the reference from Millennium Falcon and was unaware of the species' origins in \"Design an Alien.\" Although the source did not directly establish Critoki as the original homeworld of the species before they potentially emigrated to Yavin 4, Fry has declared that it would \"make more sense that way.\""}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Millennium Falcon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Design An Alien\"—Star Wars Galaxy Magazine 7","elements":[]}]}],"images":[]}]}