{"sections":[{"title":"Ciasi","level":1,"content":[{"type":"paragraph","text":"The Ciasi were a rodent-like sentient species with tall, pointed ears and thin, trunk-like noses. Ciasi could be found with gray-colored skin and could grow prominent tusks. One famous Ciasi was the notably thin Podracer Slide Paramita, who performed in Podraces across the galaxy around the year 32 BBY."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Ciasi were a sentient species of bipeds who had a fairly rodent-like appearance. Ciasi had thin torsos, and their backs had a slight bend in them, thus appearing as if they were always leaning forward. The Ciasi also had rather thin limbs that held them upright, including double-jointed legs that ended in three slender toes; the Ciasi stood upon those toes as opposed to the flats of their feet. The Ciasi's long slender arms led to hands with four thick digits—three fingers and a short thumb. Ciasi also had thin tapered tails that came from their rear, which were held slightly above the ground."},{"type":"paragraph","text":"On their face, Ciasi had long, thin and trunk-like noses with two nostrils on the end. Their mouths were located below the trunk, and it was from there that the Ciasi could grow sharp, pointed tusks. Ciasi had round and beady eyes; some Ciasi, such as Slide Paramita, had black eyes. Paramita also exhibited grayish-brown colorerd skin. Ciasi also had tall, pointed ears that stuck out of the tops of their heads."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20131129162325\/starwars\/images\/e\/e0\/Slideparamitaface.png","caption":"A closeup of a Ciasi head"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Ciasi evolved somewhere in the galaxy, and individuals could be spotted in the galactic community by as early as 32 BBY, during the final decades of the Galactic Republic."}],"images":[]},{"title":"Ciasi in the galaxy","level":2,"content":[{"type":"paragraph","text":"At least one Ciasi, Slide Paramita, displayed athletic prowess both physically and mentally. Paramita made it as far as the intergalactic Podracing circuits by 32 BBY, where he became well adapted to ice racing, and gained fame on the icy planet Ando Prime. Paramita achieved success on an invitational course known as the Ando Prime Centrum, as well as a drag racing course on the planet. However, Paramita had a reputation for being an easily angered Podracer elitist. Paramita could also speak Huttese."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Ciasi species first appeared via Slide Paramita in concept art and early scripts for the 1999 film Star Wars: Episode I The Phantom Menace as a Podracer pilot who hailed, along with his entire species, from the planet Tund. Ultimately, he was cut from the script, although Tund remained as the homeworld of another Podracer pilot, Ben Quadinaros. Paramita, like several other scrapped Podracers, received his first actual appearance in the 1999 Nintendo 64 video game Star Wars: Episode I Racer."},{"type":"paragraph","text":"The name Ciasi first publicly appeared in a 2006 Star Wars: Blogs article titled \"Alien species concepts that became part of the SW universe,\" which was written by Tim Veekhoven as a part of his Source Blog series. The blog detailed several Podracer pilots who did not make into the final script for the 1999 film Star Wars: Episode I The Phantom Menace, using material that may have come from early draft material for The Phantom Menace. However, the species name was not considered canon at the time, due to the fact that the information may have come from older material that was never finalized, as well as doubt surrounding the nature of the information's authenticity overall. With the release of The Complete Star Wars Encyclopedia in 2008, the Ciasi were mentioned again under Slide Paramita's entry, canonizing Paramita's species from the blog entry."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140127221721\/starwars\/images\/thumb\/7\/75\/ParamitaConcept.jpg\/150px-ParamitaConcept.jpg","caption":"Ciasi concept art from The Phantom Menace"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Episode I Racer","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Episode I: Racer: The Official Nintendo Player's Guide","elements":[]},{"text":"Star Wars: Episode I Racer: Prima's Official Strategy Guide","elements":[]},{"text":"Star Wars: Episode I Insider's Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. III ","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" Star Wars Aliens: Recycling Abandoned Film Concepts on StarWars.com","elements":[]}]}],"images":[]}]}