{"sections":[{"title":"Cha'a","level":1,"content":[{"type":"paragraph","text":"The Cha'a were a small, orange-scaled, reptilian species, known for their cunning natures. They were part of galactic society for many thousands of years. One of the most famous Cha'a was the Merchant Lord, Ssk Kahorr, who lived during the Great Hyperspace War. Other notable Cha'a included three Jedi students who trained alongside Jacen and Jaina Solo in the New Jedi Order."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cha'a were a delicately scaled, reptilian species, of predominantly orange coloration. Above their wide-set, slitted eyes, a line of horns ran along the top of their heads and continued down their backs. They had long snouts with sharp teeth and a long, dexterous, tongue. The Cha'a were carnivorous, using their sharp teeth to consume live food shortly after they hatched. These teeth were sometimes also used against Cha'a hatchling-mates, determining the dominant members of each clutch of eggs. The Cha'a were bipedal, with each limb ending in three clawed digits."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090718202856\/starwars\/images\/thumb\/a\/a9\/Wabba1.JPG\/200px-Wabba1.JPG","caption":"A Cha'a consumes food"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Cha'a were a technically proficient species, designing starships, such as the Cha'a drone ships, and droids, such as the message pod. The design of their drone ships was distinctive, with large ornate figureheads integrated into the design. One such ship was the Zeta Five, which was destroyed on an untested hyperspace route that passed too close to the star, Primus Goluud."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Cha'a were active in galactic life from the times of the early Galactic Republic. Spread across the galaxy, Cha'a were known to live on urban worlds such as Empress Teta and well as the mining colony of Goluud Minor. One powerful Cha'a in that era was Ssk Kahorr, head of a trading fleet of drone ships. As a representative of his species, Kahorr was a ambitious individual, willing to take risks in his business, such as using the newly found Goluud Corridor hyperlane to access the mining colony. When the route proved unstable and destroyed his cargo-ship Zeta Five, he had the Hyperspace Navigator's Guild representative Shodon Ko killed and paid bounty hunters to hunt down the route's discovers, Dav and Jori Daragon. Kahorr later confiscated the Daragon's starship, Starbreaker 12, and was killed when it was destroyed by the arrival of a Sith armada in the opening salvo of the Great Hyperspace War."},{"type":"paragraph","text":"The Cha'a continued to be part of the galactic community into the administration of the New Republic, where three Cha'a hatchling-mates underwent training at Luke Skywalker's Jedi Praxeum on Yavin 4. They helped defend the Praxeum from an assault by the Second Imperium, an Imperial-aligned darksider training facility, by hiding in the murky jungle rivers to ambush Dark Jedi. As a species, Cha'a were also targeted by the Diversity Alliance as possible recruits. Shistavanen, Adjunctant Advisor Hovrak identified them as being wily, and ambitious, traits beneficial to the Alliance; however, the Alliance was defeated shortly after Hovrak's voiced his recruitment aim."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20090718202308\/starwars\/images\/thumb\/5\/59\/Ssk.jpg\/200px-Ssk.jpg","caption":"Lord Ssk Kahorr"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Kevin J. Anderson created the Cha'a for the Old Republic era comic book series Tales of the Jedi: The Golden Age of the Sith (1996) and The Fall of the Sith Empire (1997). Their only other appearances have been in the Young Jedi Knights series, co-written by Anderson and his wife, Rebecca Moesta."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Tales of the Jedi: The Golden Age of the Sith 1: Into the Unknown","elements":[]},{"text":"Tales of the Jedi: The Fall of the Sith Empire 1: Desperate Measures","elements":[]},{"text":"Tales of the Jedi: The Fall of the Sith Empire 2: Forces in Collision","elements":[]},{"text":"Tales of the Jedi: The Fall of the Sith Empire 3: First Encounter","elements":[]},{"text":"Young Jedi Knights: Heirs of the Force","elements":[]},{"text":"Young Jedi Knights: Jedi Under Siege","elements":[]},{"text":"Young Jedi Knights: Diversity Alliance","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}