{"sections":[{"title":"Caamasi","level":1,"content":[{"type":"paragraph","text":"The Caamasi (pronounced \/kɑɑ'mɑsi\/) were a sentient mammalian species of furred humanoids known for their compassionate and peace-loving nature; indeed, the name Caamasi came to mean \"friend from afar\" and \"stranger to be trusted\" in some languages across the galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A species of furry mammalians, the Caamasi were covered in dense grey or brown fur and had a spicy, woody body scent that was similar to that of Corellian whiskey. They had two, long arms with thin, three-fingered hands, and two pointed ears which stuck out from the sides of their heads. They also had extremely acute senses of smell, with their nose positioned at the end of a tooth-filled snout."},{"type":"paragraph","text":"Caamasi had the interesting ability to share vivid memories called memnii with their near relatives and Force-sensitives, especially members of the Jedi Order. A memnis was as vivid to one who received it as it was to the one who participated in the event remembered. Their peace-loving natures were accounted for in part due to memnii, as having a memory of killing or harming would be particularly strong, becoming unbearable in time, and something Caamasi would seek to avoid except in defense of themselves or others, for which case they would accept their burden."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20090715043049\/starwars\/images\/thumb\/d\/d8\/Caamasi-KOTOR46.jpg\/180px-Caamasi-KOTOR46.jpg","caption":"A Caamasi baring claws and fangs"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"A pacifist race, culture on Caamasi evolved around the basic tenets of peace and social justice; influencing the evolution Jedi Order and their service as Knights of the Galactic Republic. Working as explorers, diplomats, and artists, the Caamasi were a monogamous people who valued single partners while mating and starting a family. So culturally ingrained was this notion that there was great debate among the species following the devastation of their homeworld. The Caamasi who were off-world at the time considered evolving to a position of polygamy so as to regrow the population. While the argument was one of survival, many sociologists familiar with the culture of the Caamasi believed that they would not accept the idea. The famed celebration known as the Rainbow of Sunshine Festival was held on Caamas annually and beloved by the populace."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Caamasi possessed great moral strength and respect for others. They were among the galaxy's finest diplomats and mediators, often solving severe conflicts in a matter of days. Indeed, as the Jedi Order began to evolve on Ossus, Jedi scholars studied on Caamas and drew upon the teachings of Hespecia Tik'kla when creating the Jedi Code. During the last stages of the Pius Dea Crusades around 11,000 BBY, the Caamasi opposed the Pius Dea-controlled Galactic Republic's inquistions against domestic opposition. They succeeded in persuading the Jedi to end their centuries-long Recusal and collaborated with the Jedi and Alsakani to mastermind an anti-Pius Dea heresy which developed into the Renunciates movement by 10,967 BBY. During the Pius Dea Civil War, the Caamasi were part of a broad anti-Pius Dea coalition which toppled the sect and ended its grip on the Republic. Following the Battle of Uquine, the last Pius Dea Supreme Chancellor Contispex XIX was tried and imprisoned for life on Caamas."},{"type":"paragraph","text":"During the last days of the Galactic Republic, Senior Anthropologist Mammon Hoole witnessed the Caamasi prowess firsthand when they negotiated peace between the Kubaz and the Verpine. Unfortunately, the Caamasi pacifism was at odds with Emperor Palpatine's New Order, and they suffered greatly under Imperial rule. A few months after the end of the Clone Wars, the surface of their homeworld, Caamas, was bombarded, killing millions. After the destruction of their planet's environment, many refugees moved to Alderaan, Kerilt, and Susevfi. The bombardment was aided by a group of Bothans who sabotaged Caamas' shield generators. The Caamas Document detailed their involvement. Although many demanded that the Bothans purchase an uninhabited planet and terraform it according to Caamas' specifications, the Caamasi chose to forgive those guilty of harming them."},{"type":"paragraph","text":"Following years of struggling to repopulate the species, the Caamasi Remnant and its leader, Elegos A'Kla, joined the New Republic Senate and participated in the hazardous political turmoil surrounding the Yuuzhan Vong War."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130630170730\/starwars\/images\/thumb\/f\/f7\/Caamasi-TFUCG.png\/160px-Caamasi-TFUCG.png","caption":""}]},{"title":"Caamasi in the galaxy","level":2,"content":[{"type":"paragraph","text":"The Caamasi who found themselves away from their homeworld typically worked as diplomats or law-givers at the side of politicians and planetary rulers across the Galactic Republic. The most famed Caamasi of the New Republic era was Senator Elegos A'Kla, a representative of the Caamasi Remnant. His place in the Senate was filled by his daughter, Releqy A'Kla, following his execution at the hands of the Yuuzhan Vong."},{"type":"paragraph","text":"Force-sensitives in Caamasi society were celebrated and while few went onto join the Jedi Order, those who did often found themselves training in the ways of the Jedi Consular. Jedi Knight Ylenic It'kla served with distinction during the Clone Wars and exiled himself to Alderaan during the Great Jedi Purge, serving as an adviser to Senator Bail Organa until his death."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20061216094827\/starwars\/images\/thumb\/5\/5e\/Caamasi_FI.JPG\/200px-Caamasi_FI.JPG","caption":"Eg'ros Akala is arrested on Coruscant."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic: Destroyer","elements":[]},{"text":"Knight Errant","elements":[]},{"text":"Darth Plagueis","elements":[]},{"text":" Point\/Counterpoint: Military Creation Act—HoloNet News Vol. 531 47","elements":[]},{"text":" Kashyyyk\/Trandoshan Talks to Shaky Start—HoloNet News Vol. 531 48","elements":[]},{"text":" Kashyyyk \/ Trandoshan Talks Break Down—HoloNet News Vol. 531 50","elements":[]},{"text":" Shots Fired in Andoan Space—HoloNet News Vol. 531 50","elements":[]},{"text":"\"Elusion Illusion\"—Star Wars Insider 66","elements":[]},{"text":"CIS Shadowfeed Dispatch 14:2:14 Edition","elements":[]},{"text":"Hero of Cartao","elements":[]},{"text":"MedStar I: Battle Surgeons","elements":[]},{"text":"Star Wars: Republic: Trackdown","elements":[]},{"text":"Labyrinth of Evil","elements":[]},{"text":"Coruscant Nights II: Street of Shadows","elements":[]},{"text":"Star Wars: Agent of the Empire—Iron Eclipse, Part 4","elements":[]},{"text":"Rebel Dawn","elements":[]},{"text":"\"First Impressions\"—Star Wars Tales 15","elements":[]},{"text":"X-Wing: Isard's Revenge","elements":[]},{"text":"I, Jedi","elements":[]},{"text":"Specter of the Past","elements":[]},{"text":"Vision of the Future","elements":[]},{"text":"Star Wars: Union","elements":[]},{"text":"Survivor's Quest","elements":[]},{"text":"The New Jedi Order: Dark Tide I: Onslaught","elements":[]},{"text":"The New Jedi Order: Dark Tide II: Ruin","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"The New Jedi Order: Destiny's Way","elements":[]},{"text":"The New Jedi Order: Force Heretic I: Remnant","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"The Hand of Zahn\"—Star Wars Insider 36","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":" The Pau'ans on Wizards.com","elements":[]},{"text":"The Force Unleashed Campaign Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]},{"text":" Eg'ros Akala in the Databank","elements":[]},{"text":" Elegos A'Kla in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"\"10 Key Battles\"—Star Wars Insider 133","elements":[]},{"text":"The Essential Reader's Companion","elements":[]}]}],"images":[]}]}