{"sections":[{"title":"Chevin","level":1,"content":[{"type":"paragraph","text":"Chevin were bipedal pachydermoid sentients native to the planet Vinsoth. They had a poor reputation in much of the galaxy, partly due to their involvement in unsavory activities such as smuggling, and partly because they had enslaved the Chevs, a humanoid species who shared Vinsoth with them."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Chevin evolved from smaller relatives of the giant mammals who were wiped out when an asteroid collided with Vinsoth millions of years before the time of the Galactic Republic. Chevin had long snouts which hung down nearly to their ankles. Combined with their intellect, this made them skilled hunters of animals such as backshin, because they could smell out their prey or feed while keeping their eyes on the horizon. It was also their hunting prowess which allowed them to dominate their homeworld and conquer the Chevs. Chevin had thick legs, massive wide bodies, thin rope-like tails, and arms so long their three-fingered hands often brushed the ground."},{"type":"paragraph","text":"Despite their ungainly appearance, they could walk or run almost as fast as more nimble-looking humanoids. Chevin boasted a double set of eyelids, one of which was transparent to prevent dust and wind from interfering with their vision. Their thick gray skin and efficient circulatory system kept them cool in warm climates and warm in cold climates, though they preferred semi-tropical conditions. The traditional Chevin costume consisted of long, elaborately patterned robes (though they did not wear clothing until they were contacted by other species) and jewelry. One Chevin even possessed the ability to kill a human with just his forehead."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Beginning as simple hunters and gatherers, the Chevin went on to conquer the Chev settlements and extend their nomadic civilization to dominate their homeworld. Vinsoth was rich in food and plant cover, and was eventually visited by offworlders seeking covert bases and food supplies. The Chevin soon gained galactic-level technology through trade, eventually manufacturing their own sophisticated weapons and vehicles. Though their technology was mostly acquired from offworld sources, they reverse-engineered products like starships in order to produce their own designs. Chevin starships were noted for their spacious cargo bays, roomy cabins, and large crews. Most of their technical advances went towards keeping their slaves in line and ensuring the continued domination of their homeworld. Chevin wore clothes only because other species did."},{"type":"paragraph","text":"Chevin lived in small, mobile communities, with homes mounted on great wheeled carts. Even after they gained access to galactic technology, they continued to live as nomads (though more affluent Chevin mounted their lodges on large repulsorlift vehicles instead.) Their Chev slaves were usually forced to follow on foot. Nomadic groups of Chevin kept in touch via comlinks, and often converged on a single location to deal with danger."},{"type":"paragraph","text":"The only Chevin settlements which stayed in place for more than one standard month were the \"Government Villages\", where Chevin dictators lived with their hand-picked advisors. Even these settlements were movable when necessary. Each of the roughly two dozen Government Villages ruled a Chevin nation."},{"type":"paragraph","text":"These nations rarely warred against each other, beyond the occasional border skirmish, though economic competition was fierce. Warrior-politicians who won their positions through single combat roved from camp to camp, providing information to Chevin dictators."},{"type":"paragraph","text":"The Chevin saw themselves as opportunistic realists interested in self-safety. Their culture valued the acquisition of power, wealth, and status by any means necessary. Most Chevin preferred to meet their goals through intrigue and subterfuge, letting others fight for them when necessary. They were calm and even-tempered if treated with respect, but quick to become bullies if angered, or retaliate if slighted or cheated."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060620164953\/starwars\/images\/thumb\/9\/92\/ChevinBeatingChev-AA.jpg\/200px-ChevinBeatingChev-AA.jpg","caption":"Chev slaves with Chevin master."}]},{"title":"Common Chevin names","level":3,"content":[{"type":"paragraph","text":"Some Chevin had first and last names, such as Ephant Mon,Phylus Mon, or Negna Mundro. Others were known only by single names, such as Goorin or Hahgalor."}],"images":[]},{"title":"Chevin in the galaxy","level":2,"content":[{"type":"paragraph","text":"Offworld Chevin were often involved in unsavory, semi-legal, or criminal enterprises such as gun-running, the slave trade, and the black market. This resulted in a poor reputation among other species. Their appearance, which many Humans considered ugly, was another factor contributing to their reputation. Chevin on Vinsoth exported Chev slaves, foodstuffs (such as fruit, nuts, and backshin meat), and imported high technology items. Others were peaceful, hardworking technicians, working for more aggressive Chevin."},{"type":"paragraph","text":"By the time of the Cold War, a proxy conflict between the Sith Empire and Galactic Republic, a small-sized sect of Chevin make a pilgrimage to a nameless blue sun every three years for a ritual. Eventually, someone was sent to follow the pilgrims and learn the story beyond the Chevin group."},{"type":"paragraph","text":"During the Imperial era, most Chevin supported the Empire. Many prominent Chevin had ties to Imperial officers. The Chevin dictators were able to keep order on their homeworld, so the Empire generally stayed out of Vinsoth's internal affairs, and rarely needed to send troops. A minority of Chevin, however, were disenchanted with Chevin culture and its reliance on slavery. Many of these Chevin joined with the Alliance to Restore the Republic, and were hunted by other Chevin as a result."},{"type":"paragraph","text":"Ephant Mon, a weapons smuggler, latent Force-sensitive, and associate of Jabba Desilijic Tiure, was a Chevin. After Jabba's death, Ephant Mon returned to Vinsoth, where he established a Force-worshiping religious group and spoke out against Chev slavery."},{"type":"paragraph","text":"Eedund Cus, the trainer of Outer Rim Ponderweight Champion shockboxer Lobar Aybock, was a Chevin, as was Ganga Lor, a gangster on Sel Zonn Station."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130607202410\/starwars\/images\/thumb\/f\/fc\/Ephant_Mon.png\/200px-Ephant_Mon.png","caption":"Ephant Mon."}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 5: Return of the Jedi","elements":[]},{"text":"The Movie Trilogy Sourcebook","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":" Star Wars Customizable Card Game – Jabba's Palace Limited","elements":[]},{"text":"Heroes & Rogues","elements":[]},{"text":"Shadows of the Empire Planets Guide","elements":[]},{"text":"Star Wars Adventure Journal 14","elements":[]},{"text":"Hideouts & Strongholds","elements":[]},{"text":"Star Wars: The Action Figure Archive","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"Power of the Jedi Sourcebook","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"\"Ask The Master: Q&A\"—Star Wars Insider 77","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Star Wars Galaxy Series 5","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Chevin on Star Wars: The Old Republic Wiki","elements":[]},{"text":"Chevin on SWG Wiki","elements":[]}]}],"images":[]}]}