{"sections":[{"title":"Chev","level":1,"content":[{"type":"paragraph","text":"The Chevs were one of the two native sentient species of the planet Vinsoth. These humanoids were slaves of the Chevin, Vinsoth's other indigenous people, for most of their recorded history, a fact which shaped their culture and their interactions with the rest of the galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Though they were sometimes classed as Near-Humans, other sources indicate that they were humanoids who evolved from Vinsoth's indigenous primates. By the time of the Galactic Empire's rise, they had been enslaved by the pachydermoid Chevin for millennia."},{"type":"paragraph","text":"The outward appearance of the Chevs was generally similar to that of Humans, with pale skin, short blond or white head hair, no facial hair, and heavy brows. Their hair was often dyed in bright colors to identify them as property of a particular Chevin. Their lidless eyes were black to violet in color, and were protected by thin transparent membranes. They were physiologically much like other humanoid species, with their twin hearts being a notable exception. According to sources such as The University of Sanbra Guide to Intelligent Life, one Chev heart could take over when the other failed, allowing Chevs to live for up to three hundred standard years. As Chev slaves could outlive their Chevin masters, this meant that Chevin slave-owners often left prize slaves to relatives in their wills. Other sources, however, gave a more modest 75 years as a typical Chev life expectancy."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Chevs originally developed a civilization on Vinsoth thousands of years before the Imperial era, thriving for some time before they were enslaved by the Chevin. Since the Chevin were a nomadic people, the Chevs were forced to live that same lifestyle as well. Their temporary settlements of tents and lean-tos were ruled by a Chevin overseer, with the oldest female Chev acting as the leader among the slaves. Giving what political power the Chevs had to the oldest among them was criticized by some younger Chevs, who believed this simply perpetuated the system of slavery. Generations of subjugation had left most Chev docile and submissive. Despite this, they would gather at night to try and understand the strengths and weaknesses of their masters, in hopes that a future generation might someday have the courage and the opportunity to free their people. The Chevs even had legends which foretold that someday, they would become masters of the galaxy."},{"type":"paragraph","text":"As nomadic slaves, they wore simple garments, and had few possessions. Despite this, they had a rich culture, strong in folklore and the visual arts. Their cultural rituals were tolerated by their masters, and even encouraged as a way to keep the Chevs content. Some Chevin even found lucrative offworld markets for the art of their Chev slaves. Chevs were also highly skilled technically, though they sometimes hid their technical expertise from their masters."},{"type":"paragraph","text":"In 44 ABY, journalist Madhi Vaandt went to Vinsoth on an assignment to uncover various slaving practices throughout the galaxy, and won popular support for the Chevs after an interview with a former Chev slave. The event, along with the actions of various anti-slavery organizations, caused a galaxywide outcry against slavery, and in the aftermath, the Chev slaves were freed by their Chevin masters."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060621035458\/starwars\/images\/thumb\/e\/ee\/Chev.JPG\/200px-Chev.JPG","caption":"Escaped Chev slaves."}]},{"title":"Chevs in the galaxy","level":2,"content":[{"type":"paragraph","text":"Chev slaves were found off-world as well, whether owned by traveling Chevin or sold to non-Chevin masters. Some free Chevs existed away from Vinsoth, escaping either by stowing away on visiting starships or fleeing their masters offworld. Free Chevs tried to keep a low profile, and avoid politics for the most part. Some became quite wealthy, and used their wealth to take almost paranoid precautions against losing their new found freedom. Off-world Chevs who had escaped slavery often dressed elaborately, or tattooed or dyed their skin, in order to express their previously suppressed individuality and set themselves apart from their enslaved brethren."},{"type":"paragraph","text":"During the Galactic Civil War, some Chevs became part of the Alliance to Restore the Republic, where they befriended members of other enslaved species such as the Wookiees. Interestingly, some Chevin were disgusted by their people's reliance on slavery. A few of these Chevin left Vinsoth, and joined the Alliance. (It is not recorded if any of them worked alongside free Chevs, however.)Ephant Mon, a Chevin ex-criminal and religious leader, led a movement to emancipate the Chev on Vinsoth."},{"type":"paragraph","text":"Jedi Master Tresina Lobi, who fought in the Yuuzhan Vong War and the Swarm War, was a Chev.Jedi Knight Sothais Saar was also a Chev."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060620164953\/starwars\/images\/thumb\/9\/92\/ChevinBeatingChev-AA.jpg\/200px-ChevinBeatingChev-AA.jpg","caption":"Chev slaves with Chevin master."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In Christie Golden's novel Allies, the fifth book of the nine-part Fate of the Jedi series, a continuity error exists that identifies the Chevs as being the masters of the Chevins, in contradiction to most other sources describing both species. Shohta Laar, a Chev won by journalist Madhi Vaandt in a drinking game on Vinsoth, was identified as a Chevin rather than a Chev."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic: Prophet Motive","elements":[]},{"text":" SPECIAL REPORT: The Death Stick Scourge—HoloNet News Vol. 531 49","elements":[]},{"text":"A Mon Alone","elements":[]},{"text":"Mission to Lianna","elements":[]},{"text":"X-Wing: Solo Command","elements":[]},{"text":"The New Jedi Order: Balance Point","elements":[]},{"text":"The New Jedi Order: Destiny's Way","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Dark Nest I: The Joiner King","elements":[]},{"text":"Dark Nest II: The Unseen Queen","elements":[]},{"text":"Dark Nest III: The Swarm War","elements":[]},{"text":"Legacy of the Force: Tempest","elements":[]},{"text":"Legacy of the Force: Exile","elements":[]},{"text":"Legacy of the Force: Fury","elements":[]},{"text":"Fate of the Jedi: Omen","elements":[]},{"text":"Fate of the Jedi: Backlash","elements":[]},{"text":"Fate of the Jedi: Allies","elements":[]},{"text":"Fate of the Jedi: Vortex","elements":[]},{"text":"Fate of the Jedi: Conviction","elements":[]},{"text":"Fate of the Jedi: Ascension","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Hideouts & Strongholds","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]}]}],"images":[]}]}