{"sections":[{"title":"Cacop","level":1,"content":[{"type":"paragraph","text":"The Cacops were a sentient species native to the planet Veccacopia of the Outer Rim Territories. Discovered by the Galactic Republic in its final decades, the planet was made a protectorate of the Republic. Among the Republic representatives working with the Cacops was the future Supreme Chancellor of the Galactic Senate Finis Valorum, who, during his time on Veccacopia as a judge, broke a corruption ring within their judicial system."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Cacops were a sentient species. Non-Cacops found it difficult to distinguish between individual Cacops."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Cacops were native to the planet Veccacopia, located in the Outer Rim Territories. Their first contact with the Galactic Republic only occurred in the final years of the Republic's existence, and the planet soon became a Republic protectorate, and part of the Tunka sector alongside such other worlds as Borlov, Niran, Rivoria, Thakwaa, and Usean II."},{"type":"paragraph","text":"As a young man, the Human Finis Valorum served on Veccacopia as a judge. At that time, the Cacops had been hiring stand-ins to serve out their sentences, taking advantage of the inability of the non-Cacop bailiffs to distinguish between individual Cacops. Valorum uncovered this deception and instituted compulsory retinal scanning. This innovation led to the disruption of a corruption ring within the local judicial system. Valorum went on to become Supreme Chancellor of the Republic."},{"type":"paragraph","text":"Within a matter of decades from the time that the Cacops joined the Republic, the government transitioned into the Galactic Empire."},{"type":"paragraph","text":"Under the Empire, their homeworld and the other systems of the Tunka sector came under the jurisdiction of Imperial Moff Poliff."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080801152355\/starwars\/images\/thumb\/8\/89\/Valorum.jpg\/180px-Valorum.jpg","caption":"Finis Valorum served as a judge for the Cacops."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Cacops were created by Daniel Wallace for the The New Essential Guide to Characters, published by Del Rey in 2002. They formed part of the backstory of Finis Valorum."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The New Essential Guide to Characters","elements":[]}]}],"images":[]}]}