{"sections":[{"title":"Cannolite","level":1,"content":[{"type":"paragraph","text":"The Cannolites were a sentient species native to the planet Canoliss IV. Their culture was based on three-dimensional mathematics, which caused problems for offworlders visiting their planet. This was exemplified in the locking mechanisms used to secure Cannolite doors, which were virtually impossible for non-Cannolites to operate."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Cannolites had a unique culture that differed dramatically from the galactic norm, as it was deeply steeped in three-dimensional mathematics. This was manifested in their technology, such as the design of their door locks. These were formed by notched metal rods inset next to each other in a horizontal and vertical surface. To unlock the door, Cannolites used thin, magnetic pointers to pull up selected rods from the jumbled surface. The notches on the chosen rods interacted to form complex patterns, most commonly cubes. Once the correct shape was formed, the door unlocked. While operating these locks became second nature to Cannolites, most offworlders found the process hopelessly complex."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Cannolites were a sentient species that evolved on the planet Canoliss IV, located in the Sluis sector of the Outer Rim Territories. The region of space around their homeworld was explored by the Galactic Republic between 3000 BBY to 1000 BBY, and the Cannolites established contact with the galactic community. Visiting offworlders to Canoliss IV struggled with the species' unique, three-dimensional approach to technology."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Cannolites were created by Daniel Kaufman in one of his regular columns written for Wizards of the Coast. This particular column, Tricks and Traps: Mite of the Force, published in May 2002, covered situations where a gamemaster in a roleplaying game requires puzzles that are essentially unsolvable. The Cannolites and their door locks are provided as one such example of a species with a mindset and culture significantly different from the norm."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" Tricks and Traps: Mite of the Force on Wizards.com","elements":[]}]}],"images":[]}]}