{"sections":[{"title":"Baragwin","level":1,"content":[{"type":"paragraph","text":"Baragwin were a species of sentient reptilians native to the lost world Old Barag. One of the earliest spacefaring races, the Baragwin could be found across the galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A hunchbacked species of sentient reptilians, the bipedal Baragwin were easily recognized across the galaxy. Noted for their thick, wrinkled skin which could resist most physical attacks and their shuffling gait, the large-headed race had no obvious differences between male and female Baragwin. An acute sense of smell gave the species enough sensitivity to detect another being's mood and feelings. This led some of them into careers as big-game hunters, or even as bounty hunters. Due to their ponderous movement, many non-Baragwin believed the race to be a dull-witted people while, in fact, they were quite intelligent. Despite this fact, the Baragwin frequently kept this intelligence hidden, using the misconceptions of others to their own advantage."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Baragwin culture, since it did not derive from a single homeworld, was highly dependent on a Baragwin's planet of origin, with Tatooinian Baragwin behaving quite differently from those from Denuhi-Eight. Baragwin generally had little prejudice, treating all other beings equally regardless of species, culture, or planetary origins; though criminal Baragwin would exploit all beings equally instead. Baragwin settlements were generally small and anarchic, with short-term leaders selected by informal democratic processes."},{"type":"paragraph","text":"Most Baragwin had a first and a second name. Common names included Dagel Igara, Digo Fadani, and Idalli Kodrue. Senator Wynl, who apparently had only one name, was one of the few known exceptions."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Originating from the Expansion Region's planet Old Barag, the Baragwin left their world long in the past, eventually leading the species and the galactic community to forget its location, as well as the Baragwins' native language. Though their population numbered only in the millions, they were widespread throughout the galaxy, having been part of galactic society for millennia. While Old Barag was lost to history Baragwin, like Humans and Duros, identified themselves with the planet they were raised on."},{"type":"paragraph","text":"Baragwin were famous as skilled weapon-smiths and introduced many different weapons to different worlds. During the Jedi Civil War, Baragwin-made blasters and vibroblades were among the most powerful personal weapons in the galaxy. This tradition continued into the Galactic Civil War era, where Baragwin were found working for Imperial-backed corporations, criminals, and the Alliance to Restore the Republic. Since the Empire and Imperial-backed corporations prized the contribution of Baragwin weapons engineering, most Baragwin supported the Empire during the Galactic Civil War. When Ysanne Isard released the Krytos virus in order to decimate the nonhuman population of Coruscant, however, the planet's Baragwin community was hit hard. The majority of Baragwin reacted by throwing their support behind the fledgling New Republic. By 25 ABY, the numerous Baragwin communities were represented in the New Republic Senate by Senator Wynl."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20061203022223\/starwars\/images\/thumb\/2\/23\/Baragwin_GG12.jpg\/200px-Baragwin_GG12.jpg","caption":"A Baragwin brandishing his weapons."}]},{"title":"Baragwin in the galaxy","level":2,"content":[{"type":"paragraph","text":"As they claimed no species homeworld, the Baragwin affiliated themselves with the world on which they had established colonies or enclaves which could be found anywhere in the galaxy. Connected to arms dealing and manufacturing, most prolific Baragwin worked in the underworld arming criminals or working with local military forces to arm against insurgences. Among the Baragwin armorers at that time of the Galactic Civil War was Hermi Odle, a security expert working for Jabba the Hutt, a well-known crime lord."},{"type":"paragraph","text":"Force-sensitives among the Baragwin were rare, and with such a small population existing in the galaxy, almost unheard of. One of the few to gain notoriety was Jedi Master Astaal Vilbum, Caretaker of the Jedi holocrons and the leader of the Council of First Knowledge during the last decade of the Galactic Republic."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20090711195710\/starwars\/images\/thumb\/7\/78\/Astaal_Vilbum.jpg\/200px-Astaal_Vilbum.jpg","caption":"Astaal Vilbum, a noted Jedi Master."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic","elements":[]},{"text":"Darth Maul: Shadow Hunter","elements":[]},{"text":"Episode I Adventures 8: Trouble on Tatooine","elements":[]},{"text":"Star Wars: Republic 33: Darkness, Part 2","elements":[]},{"text":"Shadow Games","elements":[]},{"text":"Rookies: Rendezvous","elements":[]},{"text":"The Bounty Hunters: Scoundrel's Wages","elements":[]},{"text":"Star Wars: Episode VI Return of the Jedi","elements":[]},{"text":"Star Wars Episode VI: Return of the Jedi novel","elements":[]},{"text":"Mara Jade: By the Emperor's Hand","elements":[]},{"text":"The New Jedi Order: Dark Tide I: Onslaught","elements":[]},{"text":"The New Jedi Order: Dark Tide II: Ruin","elements":[]},{"text":"Star Wars Battlefront: Renegade Squadron","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Star Wars Trilogy Sourcebook, Special Edition","elements":[]},{"text":" Star Wars Customizable Card Game – Jabba's Palace Limited","elements":[]},{"text":" Star Wars Customizable Card Game – Jabba's Palace Limited","elements":[]},{"text":"Star Wars: The Action Figure Archive","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 3","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 38","elements":[]},{"text":" Hermi Odle in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"Star Wars: Force Collection","elements":[]}]}],"images":[]}]}