{"sections":[{"title":"Bartokk","level":1,"content":[{"type":"paragraph","text":"The Bartokk were a species of clawed, sentient insectoids hailing from a nameless planet in the Outer Rim Territories. Controlled by a hive-mind, the Bartokk were barely sentient individually but highly intelligent when in groups."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"An insectoid race, the Bartokk's hard carapace was capable of deflecting some weapons as could be expected of most manufactured armors. Bipedal with four additional arms, the Bartokk had a single primary hand, though they could handle weapons and tools with all four. When in a defensive stance, a Bartokk could crouch down on four legs and attack with the other two, flashing their razor-edged claws. Their primary eyes were located on their head, and were bright red in color. Additional eyes were located on their lower abdomen."},{"type":"paragraph","text":"A hive-minded species, all Bartokk shared a telepathic link to each other, sharing intelligence and thoughts within 500 meters of each other. This ability not only gave them sentience, as outside the hive mind they were barely functional, the telepathic link served as a good defense from being flanked by predators. The Bartokk possessed amazing regenerative abilities and could recover from almost any injury, so long as their brains were not completely destroyed. If their brain was cut in half each half would regenerate into a separate twin, creating an entirely new individual. Their bodies also had the ability to have parts that have been cut off in combat to continue functioning as normal. Even in the instance of decapitation, the body would continue to fight despite the lack of a head."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Because of the Bartokk hive mind their society was a single cohesive facet of their personalities and shared by all members of the hive. Their homeworld was mildly radioactive, leading to occasional mutations which would seem minor to most beings, but were grounds for exile in Bartokk society. Culturally, the Bartokk were considered mysterious and fearsome by other species familiar with the Bartokk assassin guilds. These guilds operated across the galaxy and were known to target political figures from the Galactic Republic; using numbers to overwhelm the target's defense forces, after neutralizing major defense emplacements and communications first. Bartokk traveled in hives of fifteen and were unrelenting in the pursuit of prey, even if it may result in the death of the hive."},{"type":"paragraph","text":"The arid world of the species origin was not technologically advanced and the Bartokk lived in hives devoid of modern equipment. As the Bartokk made contact with outside societies, the insects brought back some technologies created by other species and adapted them to suit their own biology. Having no language of their own, the Bartokk communicated via telepathy; though they were able to master other languages to communicate with other species."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Originating on a radioactive planet on the Outer Rim, the Bartokk evolved from insects with a strong hive mind forming in each hive. Forming several assassin guilds, these Bartokk were known to never give up as they hunted their prey throughout the galaxy. During the reign of the Galactic Republic, the Bartokk species had used technology from other societies to craft their own starships. Creating a six-winged starfighter and spike-hulled freighters, the Trade Federation approached several sub-hives to defend the development of the Federation's naval forces."},{"type":"paragraph","text":"Following the rise of the New Republic, Jedi trainees within the Jedi Order Tenel Ka, Lowbacca, Jaina Solo, and Jacen Solo found them to be worthy adversaries, barely fending off a hive sent to assassinate the Queen Mother of the Hapes Consortium Ta'a Chume. The hive, hired by Ambassador Yfra, failed in their mission and were killed. When the Diversity Alliance emerged, the Bartokk worked with the group as assassins, wiping out the leaders of other hives to grow their army."}],"images":[]},{"title":"Bartokk in the galaxy","level":2,"content":[{"type":"paragraph","text":"While most Bartokk encountered across the galaxy were members of an assassin guild hunting for their prey, members of the species which had been exiled tended to gain work in local militias as they lacked the creativity which came with being part of a hive mind. Like many insectoid species, the Bartokk were not known to have any Force-sensitive members, either among the Jedi Order or the Sith Empire."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Episode I Adventures 1: Search for the Lost Jedi","elements":[]},{"text":"Episode I Adventures 2: The Bartokk Assassins","elements":[]},{"text":"Episode I Adventures 3: The Fury of Darth Maul","elements":[]},{"text":"Episode I Adventures 4: Jedi Emergency","elements":[]},{"text":"Episode I Adventures Game Book 4: Jedi Emergency","elements":[]},{"text":"The Wrath of Darth Maul","elements":[]},{"text":"\"The Great Herdship Heist\"—Star Wars Adventure Journal 15","elements":[]},{"text":"Young Jedi Knights: Lightsabers","elements":[]},{"text":"Young Jedi Knights: Jedi Under Siege","elements":[]},{"text":"Young Jedi Knights: Diversity Alliance","elements":[]},{"text":"The New Jedi Order: Agents of Chaos II: Jedi Eclipse","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":" \"Galaxy's Most Wanted: Mr. X\"—Star Wars Gamer 3","elements":[]},{"text":"The New Essential Guide to Characters","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"Ultimate Adversaries","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}