{"sections":[{"title":"Barundi (species)","level":1,"content":[{"type":"paragraph","text":"The Barundi were a humanoid species native to the planet Barundi and encountered on an unnamed planet in Wild Space. A primitive society, the Barundi fashioned their lives around the promotion of perpetual happiness. The Barundi found in Wild Space worshiped the Yavin Vassilika as a god."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Barundi were blue-skinned humanoids with thick plugs of tightly-braided hair on their high-domed heads. There was no apparent dimorphism between males and females. The Barundi displayed broad, toothed smiles with prominent canines. Coarse body hair covered the forearms and chests of adult Barundi."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20080303005841\/starwars\/images\/thumb\/0\/0b\/Barundi01.jpg\/185px-Barundi01.jpg","caption":"The Barundi."}]},{"title":"Culture and history","level":2,"content":[{"type":"paragraph","text":"The Barundi society was built upon maintaining harmony and happiness. Any deviation from the strict doctrines and the offender was sentenced to immediate capital punishment. Accosting their idol was grounds for a ritualized \"cleansing of the soul.\" The Barundi believed that when a person strays from peace without reason, that they are in need of \"assisted reincarnation.\" The Barundi then publicly beat the offender(s) to death with large flowers. The true cause of death, however, is most likely from the poisonous thorns in the petals."},{"type":"paragraph","text":"The Barundi encountered by 4-LOM, Han Solo, Greedo, et al, were supposedly deposited on the unnamed planet several millennia ago."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Barundi is also the name of an ancient village in India. Barundi is also the name of the people of the Republic of Burundi in Eastern Africa."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Underworld: The Yavin Vassilika","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Miniatures: Rebel Storm","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}