{"sections":[{"title":"Bosph (species)","level":1,"content":[{"type":"paragraph","text":"The Bosphs were a mammalian species from the planet of Bosph in the Outer Rim Territories' Bosph sector. They had six limbs, no neck and a pair of multiple-lensed eyes that also functioned as auditory sense organs. The Bosphs were a fiercely independent and isolationist species who preferred seclusion from both the rest of the galaxy and each other. The homeworld, where most Bosphs remained, was controlled by a hierarchical government made up of various factions each consisting of Force-sensitive Bosphs. These Bosphs were the only individuals who had the right to claim ownership of any object, though any unclaimed object was equally owned by all Bosphs. The Bosphs also kept a tradition of recording the history of their travels, both on Bosph and in the galaxy by tattooing star maps on to their skin."},{"type":"paragraph","text":"Despite their isolation from the galaxy, the Bosphs' homeworld was bombarded by the Galactic Empire after Emperor Palpatine learned of their Force-sensitive government. The attack devastated the planet's surface and killed many Bosphs. Those left alive mostly remained on their homeworld, partially due to a quarantine by the Imperial Navy. All Bosphs, however, took up a policy of disremembrance toward the Empire, which was considered the greatest insult a Bosph could give. The attitude meant they no longer acknowledged the existence of the Empire and ignored its laws, believing that the bombardment had actually been punishment from a deity-like entity they called the Yentarr, meaning the \"unknown spirits.\""},{"type":"paragraph","text":"One of the most famous Bosphs in the galaxy was the smuggler Bora Boru who worked during the reign of the Galactic Empire. Another Bosph during this period worked as a bounty hunter and answered Darth Vader's call to hunt the Corellian smuggler and Rebel Han Solo and his ship, the Millennium Falcon. During the reign of the New Republic, a Bosph named Morga Bunna opened a supply depot on Bosph's outermost moon after retiring from work as a bounty hunter. Bunna was questioned by the Jedi archivist Mander Zuma during the Jedi's quest to shut down the Tempest spice trade."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Bosphs were a sentient species of shortmammals who generally stood between 1.0 and 1.7 meters tall. The species included at least one sex, male. They evolved on the grassy planet of Bosph from a species of six-limbed omnivores, and the Bosph retained the six limbs of their evolutionary ancestors. Bosphs stood upright on two legs and used the remaining four limbs as arms; all six extremities ended in three digits. The species effectively lacked a neck such that a Bosph's head, which was semi-circular in shape, was attached directly to its torso. The species' face consisted of a mouth, and a central, flat, porcine nose between two relatively large eyes on each side of the skull. Each eye consisted of hundreds of lenses to allow sight but could also act as a tympanic membrane, which allowed them to act as an audio sensory organ. From behind each eye a single curved horn grew, which was sharp and upward facing. Bosph hide ranged in color from light brown to dark grey and was tough and resilient. The Bosphs' vocal system allowed them to speak in Galactic Basic Standard."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"As a species, Bosphs were fiercely independent and preferred isolation both from other species and other members of their own species, although there were exceptions who welcomed company. Bosphs normally attempted to avoid others as much as possible, and in situations where they did interact with others, they were usually amicable but often indifferent and especially uncaring of what others thought of them. Members of the species were generally deeply philosophical and spiritual in nature; this led their society to seem relatively superstitious, a trait that caused many other species to view them as dull-witted, although this was far from true."},{"type":"paragraph","text":"The Bosph species believed in a powerful force known as \"the unknown spirits,\" which they called the Yentarr—a belief not dissimilar to other beings beliefs in deities. All phenomena that could not be explained were attributed to the Yentarr, with disasters being seen as punishment by them. The Force was one such phenomenon that Bosphs came to believe was caused by the Yentarr, and they named the powers associated with it as abo b'Yentarr in their language, meaning \"the power of the unknown spirits.\""},{"type":"paragraph","text":"Bosph society was ruled by a hierarchy of different factions, the members of which were considered ranking officials and were all Force-sensitive. Any Force-sensitive individual, known as ela b'Yentarr—\"the chosen of the unknown spirits\"—was apprenticed to one of the factions at a young age and taught the ways of the Force by its members. The exact Force techniques used differed from faction to faction depending upon their role in society. The faction known as the gamefinders taught their members techniques to help them in hunting, such as Force sense and precognition, and the sickhealers learned how to use the Force to heal with techniques like Force healing, Control Pain and Control Disease. A faction known as the farseers also existed who were given access to the teachings of Bosph philosophers. The conduct of each faction also differed, with some having moral codes similar to the Jedi Order's code and others utilizing the dark side of the Force, although all Ela b'Yentarr were aware of the moral implications of using such power. To use the force, Bosphs also believed certain rituals and ceremonies must be performed to summon the unknown spirits, which lead to them not using some longer-lasting force powers."},{"type":"paragraph","text":"As members of the government factions, Ela b'Yentarr were also the only individuals in Bosph society granted the right of ownership. All Bosphs believed that any object belonged to all individuals equally unless ownership was claimed of it, and only those with the right of ownership could claim an item and did so using a glyph, a rune-encrusted pendant worn to show the right to ownership. Those with a glyph could claim ownership of any item. However, a conflict of ownership between two or more individuals often resulted in a duel fought for it, sometimes to the death, although to kill was not in the Bosphs' nature. Glyphs were also sometimes drawn onto owned objects as well. Due to their unusual view of ownership, many Bosphs who left their homeworld faced repercussions for stealing the possessions of others that they believed to have claimed as their own."},{"type":"paragraph","text":"Bosphs generally wore clothes similar to the standard variety found throughout the galaxy but suited to their particular short, neckless, four-armed bodies. One type of clothing worn by some Bosphs was the loincloth. On their feet, some Bosphs wore no shoes at all, while others wore open-fronted shoes. Some Bosphs left the torso bare and their tattoos more visible. A particularly wealthy Bosph might wear golden caps on his horns and high-quality robes. At least one member of the farseer faction of Bosphs carried a staff tipped with a crystal known as a Bosph starcrystal. Another Bosph had a habit of rocking back and forth while anticipating something and would raise all four of his arms as a sign of resignation. Bosph were capable of snapping their fingers, and members of the species could polish their eyes until they were clean enough to sparkle."},{"type":"paragraph","text":"Within early Bosph society, most individuals were solitary nomads and a tradition of tattooing maps and star maps onto their hide evolved to aid them in navigation of the vast grasslands that made up much of their home. This tradition was maintained in Bosph culture and became known as \"the way of the traveler.\" The tradition, however, changed slightly and Bosphs who were considered Ela b'Yentarr, particularly philosophers, always had to bare such tattoos while it was a choice for other Bosphs. The greatest punishment within Bosph society was 'dis-remembrance' in which the punishers would cease to acknowledge the punished's existence."},{"type":"paragraph","text":"Some Bosphs who traveled off world brought plants with them and cared for them with radiation lights. Due to the importance of travelling within their society, Bosphs greatly respected members of other species who traveled the stars. In terms of galactic society, Bosphs remained true isolationists and refused a place in any galactic government as well as off-planet trade, although they did use several elements of superior technology from off-world, including hyperdrive technology. Such advanced technology was blended with the Bosphs' own industrial-level technology, which like all things they crafted was suited to use with their four arms. For instance, Bosph musical instruments suited their dual pairs of arms; the Bosphon Geddy was unplayable by any species with less than four arms due to the innate complexities of its design."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130308185731\/starwars\/images\/thumb\/3\/32\/Bosph.png\/200px-Bosph.png","caption":"Bosphs often had maps tattooed onto their bodies."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Bosph species evolved from six-limbed omnivores on the planet of Bosph in the Bosph system of the Bosph sector in the Outer Rim Territories. The species was forced to evolve due to predation by animals called luprisi, which they had to constantly outsmart leading to their developing sentience. Early Bosphs lived as solitary nomads, tracking animals such as umuls and favria that they hunted for meat. To help navigate the huge grasslands they lived in, the Bosph began to tattoo maps onto their hides, something that became a tradition and was maintained in Bosph society, as was the eating of unmuls and favria. The region of space that Bosph was located in was first explored between 1000 BBY and 25 BBY. When the Bosphs were first discovered by off-world scouts, the species was offered a place in the galactic government, but declined due to the Bosphs' preference of isolation. While most Bosphs remained on the planet, some chose to leave and explore the galaxy, tattooing space charts on their hide to maintain tradition, with some Bosphs exploring so widely that their tattoos showed star systems not even discovered by professional scouts."},{"type":"paragraph","text":"About a year after the start of the Galactic Civil War, the Galactic Emperor Palpatine appointed the Human Imperial officer Harsh as Moff of the Bosph sector due to the man's success in the Battle of Chabosh at the start of the war, where he had defeated a rebellion on the planet. During Harsh's tenure, the Emperor—a Force-sensitive himself—became aware of the Force-sensitive factions of Bosphs. The Empire immediately quarantined the planet, and shortly afterwards,bombarded the surface of the planet from orbit, killing huge numbers of Bosphs and decimating the planet's grasslands. Of the few Bosphs that survived, most remained on their homeworld, although a few escaped and slipped through the quarantine on any ships available."},{"type":"paragraph","text":"Despite the planet's relative obscurity due to its inhabitants' self-exile from galactic society, some off-worlders were aware of its destruction, although none knew of the cause. Rumors spread that it had been due to the Alliance to Restore the Republic setting up on the planet, or as part of a personal vendetta against Bosph \"royalty.\" However, few other species cared about the bombardment, due to the small number of Bosphs left. The Bosphs themselves came to believe the attack had been a religious purge and adopted a policy of dis-remembrance toward the Empire, refusing to acknowledge its existence and ignoring its laws and blockade of their planet. They attributed the destruction of the bombardment instead to the Yentarr and saw it as a punishment for some misdeed of their species. By 19 ABY, a conflict had destroyed much of Bosph's outermost moon, although what remained had been made into a supply depot by a retired Bosph bounty hunter named Morga Bunna."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20051226085153\/starwars\/images\/thumb\/c\/cf\/Harsh.jpg\/180px-Harsh.jpg","caption":"The Bosph sector was controlled by Moff Harsh during the bombardment of Bosph."}]},{"title":"Bosph in the galaxy","level":2,"content":[{"type":"paragraph","text":"Few Bosphs left their homeworld due to their isolationist tendencies and the Imperial blockade on Bosph during the reign of the Galactic Empire. The majority of Bosphs found off-world were refugees who fled the Imperial bombardment, although a small number of Bosphs embraced off-world technologies and took up galactic travel by choice. Those who did join galactic society for whatever reason generally took up jobs that provided the isolation from others that they enjoyed."},{"type":"paragraph","text":"At least two Bosphs became bounty hunters, including one individual who answered the call of the Sith Lord Darth Vader, the apprentice of Emperor Palpatine, when he sought out hunters to capture the smuggler Han Solo, who was helping the Rebel Alliance. Another Bosph named Morga Bunna worked as a bounty hunter as well, but by 19 ABY had retired to run a storage depot on the outermost moon of Bosph. His depot was used by many clients to store goods that were dangerous to hold onto or to perform interactions with individuals they would prefer not to meet face to face. The Human Jedi archivist Mander Zuma and his companions visited Bunna's outpost during their crackdown on the Tempest spice trade across Hutt Space and the Corporate Sector. Bunna's store of Tempest had been withdrawn, and the trader refused to give up his clients to the Jedi. He stated that he did not have any details since most of his business was done through blind drops—although he did give the visitors a data cube recording each anonymous transaction. Upon the arrival of the Invincible-class Dreadnaught Heavy Cruiser Resolute at the depot, Bunna maintained that he had no information for the Jedi but agreed to help them find the head of the Bomu Clan of Hutts. The Corporate Sector Authority confiscated several items in his inventory stolen from Corporate Sector citizens before leaving the depot. Unlike most Bosphs, Mora, claimed to enjoy the company of other sentient beings."},{"type":"paragraph","text":"Another Bosph, Bora Boru, became a smuggler during the reign of the Empire. Originally part of the farseer faction of Bosphs, Boru survived his homeworld's bombardment by the Empire and came to hate them for it as they had denied him the opportunity to die with his people. He, like most surviving Bosphs, followed a policy of dis-remembrance of the Empire, believing that seeking revenge would be suicidal. As a member of a government faction, Boru was both Force-sensitive and had the right of ownership, along with the appropriate glyph pendant. Using the glyph, he claimed ownership of the vessel Bosphon Forever, a Surronian L19 freighter, and killed its owner when the man tried to reclaim it. The smuggler went on to take up a successful career in smuggling, often aiding those who opposed or hated the Empire. Due to his Force abilities, he lived longer than the average for his species, and as such had far more heavily tattooed skin than most Bosphs as well as a high ability to astrogate and an expansive knowledge of the star systems of the galaxy."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20081027224802\/starwars\/images\/thumb\/7\/7f\/Bosph_hunter.jpg\/180px-Bosph_hunter.jpg","caption":"Some Bosphs took up work as bounty hunters."},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070209210825\/starwars\/images\/thumb\/5\/5e\/Bora_Boru.jpg\/140px-Bora_Boru.jpg","caption":"The Bosph smuggler Bora Boru"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Bosphs were created as part of Topps' Star Wars trading cards, appearing in Star Wars Galaxy Series 1 released in 1993. On the card, a Bosph bounty hunter was depicted meeting with Darth Vader alongside other hunters, including Boba Fett, in an illustration by Mark Nelson. The species, however, was not named and no information was given on it. In the same year the artwork was collected in the book The Art of Star Wars Galaxy along with various other art from the card collection."},{"type":"paragraph","text":"The species itself was then named and expanded upon for West End Games' Star Wars roleplaying game, with the character Bora Boru appearing in the fifth issue of the Star Wars Adventure Journal, in an article titled \"Smugglers of the Outer Rim\" written by Doug Shuler and published in 1995. The article described the Bosph species and some of their customs and history. The species then appeared again in the thirteenth issue of the Star Wars Adventure Journal with a detailed description of the species given as part of the \"Alien Encounters\" series. It was written by Brian Smithson and published in 1997. The article included an illustration of a Bosph by Pablo Hidalgo and role-playing attributes for the species, which favored knowledge, while granting the Bosphs' average scores in the remaining attributes. It gave the stats of an average Bosph as being weak in technology and mechanics. Some of the information from the article was then republished in Alien Encounters, a West End Games supplement book released in 1998 compiled by Paul Sudlow."},{"type":"paragraph","text":"Moff Harsh was revealed to have been in control of the Bosph sector during the bombardment of Bosph in an entry he received expanding his backstory in the article called \"Unusual Suspects.\" The article was written by Andrew Hind and published in the sixth issue of the Wizards of the Coast roleplaying supplement magazine, Star Wars Gamer, released in 2001. The Bosphs were also mentioned in an entry for their homeworld, Bosph, in The Complete Star Wars Encyclopedia published in 2008 and written by Stephen J. Sansweet and Pablo Hidalgo. A Bosph character, Morga Bunna, later appeared in the novel Scourge published in 2012 and written by Jeff Grubb. The book is a novelized version of the Wizards of the Coast's roleplaying sourcebook Tempest Feud, which was published in 2002 and also written by Jeff Grubs as well as Owen K.C. Stephens; Bunna, however, is not mentioned in the sourcebook, only the novel."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Scourge","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Galaxy Series 1","elements":[]},{"text":"The Art of Star Wars Galaxy","elements":[]},{"text":"\"Smugglers of the Outer Rim\"—Star Wars Adventure Journal 5","elements":[]},{"text":"\"Alien Encounters\"—Star Wars Adventure Journal 13","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":" \"Unusual Suspects\"—Star Wars Gamer 6","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}