{"sections":[{"title":"Bilar","level":1,"content":[{"type":"paragraph","text":"Bilars were one of the few examples of a true group mind in the galaxy. Evolved from small, vegetarian primates on the tectonically active but highly fertile planet Mima II, each member of the species was a hairless, pink creature with large, dark eyes, a short muzzle, and two rounded ears. An individual Bilar was unintelligent, but the species had the ability to pool the knowledge and consciousnesses of groups of Bilars who shared a special bond with one another, creating conglomerations known as a claqas. Thus, a pair of Bilars collectively was as intelligent as a trained domestic animal, but a group of four achieved true sentience. The group mind developed shortly after the birth of those Bilars born nearby and within a few minutes of each other. The group mind depended on single Bilars sharing thoughts through pheromones, physical and visual contact, and telepathy. Larger claqas grew progressively smarter, with seven-member groups achieving genius-level intellects. Claqas with more than ten members were rare, and claqas generally referred to themselves as a single individual and went by a single name. Separation of any of the constituent Bilars resulted in a temporary loss of intelligence, and the death of a Bilar sent his or her claqa into a deep depression, sometimes leading to catatonia or the death of the whole."},{"type":"paragraph","text":"The plant life of Mima II was so lush that it provided the Bilars with a comfortable and carefree existence. Claqas of five or more members preferred to live in urban environments situated in stable fields on the planet, and the species had access to mass production and other advanced technology. However, the goods they had to offer were of little interest to outsiders. Coupled with the fact that many non-Bilars found interacting with a group mind unnerving, Bilars had limited contact with the rest of the galaxy. When they did manage to venture offworld, their generally carefree existences on Mima II left them unused to deprivation. Nevertheless, a few Bilar claqas did venture into the greater galaxy to work at occupations that made use of their ability to work together seamlessly."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Reactions to the Bilars' appearance ranged from one extreme to another: to some non-Bilars, the species was the epitome of adorability, resembling children's stuffed toys. To others, however, they were the pinnacle of revulsion. Bilars were hairless, pink-skinned primates with a bilateral physiology of two forelimbs, two hindlimbs, a head, and a torso. On solid footing, their primary means of locomotion was to stand on their stubby back legs and walk bipedally, but they sometimes leaned the torso forward slightly, bringing their longer forelimbs to the ground to scamper on all four appendages, each of which ended in five stubby digits. The species' fastest means of movement, however, was to brachiate, swinging through the trees and vines of their jungle habitat. Upright, the average Bilar stood one meter tall. Unlike many other species of mammals, Bilars were completely hairless, leaving their wrinkly pink skin exposed to the elements and revealing the nipples and navel. However, due to the natural protection afforded by their homeworld's lush foliage, this adaptation sped up heat transfer and helped control body temperature."},{"type":"paragraph","text":"The Bilar head was roughly spherical and featured two large, dark, amygdaloid eyes under dainty brows. These visual organs slanted slightly upward toward the temples, gave the Bilars excellent low-light vision, and allowed them to see partially into the infrared spectrum. Two round ears stood erect at the top of the head; by rotating these organs, a Bilar could hone in on faint sounds, detecting even sounds falling within the infra- and ultrasonic ranges. The short Bilar snout ended in a moist, black nose, which facilitated respiration, and a wide maw with its corners turned up in a perpetual smile. Bilars were herbivorous."},{"type":"paragraph","text":"A single Bilar was non-sentient, roughly as intelligent as a common rodent. However, each member of the species had a unique ability to bond with certain other Bilars, pooling their intellects into a communal intelligence known as a claqa. The biological mechanisms involved in this process were ill-understood by scientists, but they seemed to include a mixture of pheromones, physical touch, and telepathy. Thus, a claqa of two Bilars had the same intellectual ability as a domesticated canine or equine, a claqa of three that of a lower primate, and a claqa of four true sentience. Greater numbers in the claqa boosted the group's intelligence even higher: seven-member claqas were geniuses by most species' standards, and ten-member claqas were recorded."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20091203184315\/starwars\/images\/thumb\/8\/82\/Bilar2_GG4.jpg\/180px-Bilar2_GG4.jpg","caption":"Bilars could move about on all four limbs."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Bilars inhabited the jungles of Mima II, a planet teeming with plant and animal life. Although each claqa operated as a single consciousness with a single identity, the plural nature of the Bilar group mind ensured that each claqa manifested a unique temperament. In fact, the same claqa might change its mood erratically or capriciously, confusing any non-Bilars interacting with it. Nevertheless, a few behaviors appeared among even individual Bilars. The species tended to be libertine creatures, concerned only with enjoying themselves. Bilars were non-violent and bashful by nature, prone to flee at the first sign of danger. For smaller claqas, the Bilars might climb a tree, fall to the ground, or plunge into a river to avoid a predator such as the riam, a flying snake able to eat a Bilar in a single gulp. Larger and more intelligent claqas, alternatively, defended themselves by laying traps for such carnivores, perhaps laying out a large net with a single Bilar in it as bait. Their innate curiosity made Bilars fearless creatures in other contexts, eager to seek out new experiences. Of course, the nature of the claqa group mind made Bilars into intensely social creatures; Bilars almost always traveled in groups, and their philosophy told of a common overmind, a concept that made the thought of war untenable in Bilar sentiment, at least between claqas."},{"type":"paragraph","text":"Bilar reproductive processes were synchronized so that several pregnant females gave birth within a short time. Expectant mothers were kept within close proximity to one another to ensure that their offspring were born in close quarters with other newborns. After they were born, Bilars immediately began forming an intense bond with other infants born within a few days of them in the same locality. Eventually, the Bilar infants achieved a state of communal consciousness, bringing about a new claqa. These groups functioned at full intelligence as long as each member of the group was within eyeshot of at least one other; should the constituent Bilars lose sight of one another, the claqa's overall intelligence fell until the group could be reunited. The bond was so strong that outsiders could rarely tell the constituent members of a claqa apart from one another; doing so was largely an academic exercise anyway, as each Bilar had no identity outside his or her group mind. If one member of a claqa died, the other Bilars entered a state of intense melancholy and even catatonia. In extreme cases, the surviving Bilars would even die."},{"type":"paragraph","text":"Sheltered by the trees of Mima II, Bilars lived a life of abundance, gathering food from the forests' lower levels, or swinging about on vines and branches. The plenitude of food on the world meant that Bilars had little concept of deprivation—all of their needs were met with very little effort on their part. Outsiders who visited Mima II often complained that Bilars on the world were unmotivated and boring. Only when away from their home environment did Bilar claqas develop more remarkable goals and drives. Offworld Bilars also had to contend with a greater struggle to meet their daily needs; if denied something they wanted, the beings often whined and complained like the young of many species."},{"type":"paragraph","text":"By the time of the Galactic Civil War, the Bilars had access to advanced technology but had not discovered the secrets of nuclear power. Their native technology was oriented toward mass production of goods. Claqas of five or more members tended to congregate in Bilar cities, located in a central region of Mima II that was spared the worst of the planet's erratic plate tectonics. The copious food available in the forests obviated any need for agriculture, and even in the urban environment, Bilars had ready access to food by simply visiting a city park and climbing a tree to eat its fruit. However, this abundance also meant that the Bilars desired little from the outside galaxy—and the outside galaxy desired little from them. Still, the lack of traders visiting Mima II had just as much to do with the intimidation factor of negotiating with a group intelligence as it did with the world's relatively unpromising trade prospects."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Bilars evolved on Mima II from unintelligent primates. The presence of predators on the world encouraged the species to evolve into intensely social creatures, drawing safety from living in groups. Eventually, this gregariousness became so ingrained in the species that those Bilars who were born within a few days of one another formed an even more profound bond than that among the species as a whole. Within a few generations, this bonding from birth had become an indelible part of the Bilar genetic code; the species' reproductive cycles encouraged the birth of young in waves to maximize the chances of each newborn bonding with as many fellow Bilars as possible. At some point, this group formation moved to another level entirely, with children born within minutes of one another forming not just intense social bonds, but communal intelligence and consciousness as well; the claqa had evolved."},{"type":"paragraph","text":"With the development of group-based sentience, the Bilars learned to manipulate tools and to defend themselves from predators. They moved to the top of their world's food chain, becoming the dominant species of Mima II's jungles. The species' technology continued to progress, reaching mass production by the time of the Galactic Civil War and emphasizing the creation of urban centers."},{"type":"paragraph","text":"At some point between 3000 and 1000 BBY, the Bilars made first contact with the outside galaxy, and Mima II became part of the D'Aelgoth sector, in the Western Reaches of the Mid Rim. While the Clone Wars raged, Mima II fell within territory controlled by the Galactic Republic. During the regime of Emperor Palpatine, Imperial sentientologist Obo Rin included an entry on the Bilars in his Catalog of Intelligent Life in the Galaxy, a work in which he described those sentient species he considered to be the most important in the galaxy and of the most interest to the Empire. In 137 ABY, Mima II fell within territory controlled by Darth Krayt as part of his Galactic Empire."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130129233950\/starwars\/images\/thumb\/3\/3d\/Obo_Rin_signature.svg\/180px-Obo_Rin_signature.svg.png","caption":"Imperial sentientologist Obo Rin included an entry on the Bilars in his Catalog of Intelligent Life in the Galaxy."}]},{"title":"Bilars in the galaxy","level":2,"content":[{"type":"paragraph","text":"Few Bilar claqas ventured into the greater galaxy from Mima II. This was partially due to lack of opportunity to leave: the species lacked indigenous spacefaring technology, and traffic to their world was minimal. However, it was also a result of the relative poverty of the Bilars by galactic standards; although the average claqa had all its needs met with little expenditure of energy, Bilars had little of value with which to barter travel off Mima II."},{"type":"paragraph","text":"Nevertheless, a few Bilar claqas managed to find transport off their homeworld and enter the galactic community. These claqas were often highly intelligent, frequently finding work in jobs that took advantage of their group mind. Some Bilars worked as acrobat troupes, theater companies, and musical groups, while others ventured into the galactic underworld, working as assassins, hucksters, crime lords, and slicers. One ten-unit claqa, which collectively went by the name Unni Yerudi, became an interplanetary con artist. Yerudi owned several clubs on Bespin's Cloud City and eventually became the richest being in the Anoat sector. Still, few Bilar claqas remained abroad for long. Bilars faced intense discrimination from members of other species, whose fear and mistrust of the Bilar group mind ranged from prejudice to execration. For instance, in Elrood sector slang, Bilars were known as ticktils, from the acronym TCTL: \"Too Cute Too Live.\" In 16 ABY, a publication was for sale in Talos spaceport on the planet Atzerri that promised to teach its readers the secrets of forming group minds like those of the Bilar claqas, for instance, and one Bilar was killed in a fit of rage by the Kerestian bounty hunter Milacass after the Kerestian lost a hand of sabacc with a gambler from the Oseon system. Most claqas came to miss the idyllic life they had left behind on Mima II."},{"type":"paragraph","text":"Chubar was a fictional Bilar in an animated children's holoprogram. The character was a solitary Bilar kept as a pet by a young girl; the Bilar's voice was supplied by the actor \"Face\" Loran. Imperial scientists later gave the character's name to Project Chubar, a program of chemical treatments and educational programs that aimed to raise the overall intelligence of Bilars, Ewoks, Gamorreans, and other non-Human species and to bring their mental processes more in-line with those of Humans. In 7 ABY, Bilars were among the beings undergoing intelligence enhancement as part of Project Minefield, a successor program to Project Chubar authorized by the Imperial warlord Zsinj aboard his Super Star Destroyer, the Iron Fist. The Bilars were later freed by Lara Notsil and helped her escape the ship."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20130324021727\/starwars\/images\/thumb\/3\/31\/Bespin_skyscrapers.png\/180px-Bespin_skyscrapers.png","caption":"Bilar con artist Unni Yerudi became the wealthiest being in Bespin's Cloud City during the Galactic Civil War."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Author Troy Denning created the Bilars for the sourcebook Galaxy Guide 4: Alien Races, which was published in 1989 as part of the Star Wars: The Roleplaying Game line of works from West End Games. The book provides game statistics to allow gamemasters to create Bilar claqas for players to encounter; these rules show Bilars to have lower aptitudes for piloting, physical, and technological tasks, yet higher prospects for intellectual and sensory skills depending on the number of Bilars making up the group."},{"type":"paragraph","text":"Chuck Truett expanded Denning's entry on the Bilars slightly for the book's second edition, published in 1994. These revised rules make Bilars physically weaker than Humans and other species but bases a claqa's intellectual, piloting, perceptive, and technical aptitude on the number of Bilars in the group. Rules also describe the ill effects of a death in the claqa, and give the species bonuses to intimidating others, hearing, and seeing. Unlike the first edition, Truett's revision explicitly recommends that players not be allowed to portray Bilar characters."},{"type":"paragraph","text":"Bilars have since appeared in a few other sources from both West End Games and other publishers. For example, the species features in the Star Wars Encyclopedia, published in 1998, wherein they are described as \"a bit like one-meter-tall teddy bears without fur.\" In Star Wars fiction, only X-Wing: Solo Command, a novel written by Aaron Allston and first published in 1999, features Bilar characters."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"X-Wing: Solo Command","elements":[]},{"text":"Shield of Lies","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"Planets of the Galaxy, Volume Three","elements":[]},{"text":"Alliance Intelligence Reports","elements":[]},{"text":"The Star Wars Planets Collection","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}