{"sections":[{"title":"Besalisk","level":1,"content":[{"type":"paragraph","text":"Besalisks were a race of multi-armed sentient humanoids from the cold ocean world of Ojom."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Male Besalisks' heads sported prominent crests and four arms hung at their sides; females of the species could have as many as eight arms, but like Humans had a primary hand and a limited range of functionality with the others. The addition of the extra appendages required a hearty metabolism, and these bulky beings were able to store food and water for many days, and if the need arose, they could survive for long periods without either. Scruffy sensory whiskers lined the area below their noses, just above the robust wattle most adult Besalisks possessed."},{"type":"paragraph","text":"A monogamous species, Besalisks choose a mate for life and often bore one or two eggs. Mating rituals are violent and highly competitive, taking place during the warmer months at specified conclaves. Besalisks are hatched from eggs, carried by the females which lay their young during warm seasons. Before the eggs hatched, a male Besalisk would store the egg close to their body under a large brood patch in his abdominal skin. Because of the chill of Ojom, Besaliks were equipped to survive in harsh conditions, causing them to sweat profusely when on planets with a warmer climate."},{"type":"paragraph","text":"Chatty, quick to form lasting friendships and lovers of adventure, Besalisks often were fearless and sought thrills without care for themselves. This often caused trouble amongst their employers; Besalisks were known to walk off the job when bored with it and never return. When Besalisks did take jobs in the underworld, they were prone to gossiping and being loose-lipped. This trait made them a species; within the galaxy, whose members carried the most bounties on their heads."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130908201429\/starwars\/images\/thumb\/1\/1b\/BesaliskNEGAS.jpg\/200px-BesaliskNEGAS.jpg","caption":"A Besalisk prospector"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Isolated in the hard-to-navigate Deep Core, Besalisks never sought representation in the Senate of the Galactic Republic, and were content to let galactic affairs continue without their involvement. Ojom avoided Imperial occupation and enslavement by calling in favors with various influential underworld connections—though many Besalisks spent years working off this debt, especially those foolish or desperate enough to seek aid from the Hutts."},{"type":"paragraph","text":"After his defeat during the Post-Zsinj campaign, High Admiral Treuten Teradoc fled in the Deep Core where he created his small empire. Ojom was one of the planets controlled by the warlord. Like other Deep Core systems, the Ojom system was probably abandoned after the Imperial Reunification in 12 ABY."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Because of Ojom's harsh environment, large cities were never developed on the world; instead small communes of about a thousand families claimed territories around the world and were each led by an elected leader. The communes had a strict policy of keeping the size of their groupings equal to avoid conflict. When too many families grew in one area, the leader would ask certain families to break away and start a new community on another glacier."},{"type":"paragraph","text":"While not involved in galactic politics and because they did not produce any of their own technology, the Besalisks established large orbital space stations where offworlders could come to do business. Trading and making deals, any violence on these stations was committed by offworlders as Besalisks avoid confrontation."}],"images":[]},{"title":"Besalisks in the galaxy","level":2,"content":[{"type":"paragraph","text":"Quick-witted and sociable, Besalisks easily integrated into any civilized society, though few Besalisk colonies existed outside of sparsely-populated Ojom. Despite a lack of colonies, Besalisks often traveled off Ojom and found occupations which suited their thirst for adventure, though often proving to be unreliable in the sense they tended to wander and never return to the job."},{"type":"paragraph","text":"A notable member of the Besalisk species was Dexter Jettster, a gruff, honest being with a remarkable knowledge of weaponry, who owned a diner in Coruscant's CoCo Town district. Formerly a prospector on Kessel, Jettster was a reliable asset to Jedi Knight Obi-Wan Kenobi and a friend to both Kenobi and the rest of the Jedi Order."},{"type":"paragraph","text":"While not prevalent, the Force manifested itself in some members of the species; Pong Krell went on to obtain the rank of Master within the Jedi Order during the final days of the Republic. Fighting in the Clone Wars, Master Krell became disenchanted with the Order and the Republic and sought to join the Confederacy of Independent Systems as a Dark Acolyte under the apprenticeship of Dooku after envisioning their victory at the end of the conflict. Before he could follow through with his plan to defect, the clone trooper of the 501st Legion, Dogma executed him for treason against the Republic."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20150304054352\/starwars\/images\/thumb\/5\/55\/Armed_to_the_Teeth_Between_the_Shadows.png\/200px-Armed_to_the_Teeth_Between_the_Shadows.png","caption":"A heavily armed Besalisk"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In a picture in the Ultimate Alien Anthology Besalisks are depicted as somewhat short for their species, approximating only 1.6 meters."}],"images":[]},{"title":"Appearances","level":2,"content":[],"images":[]},{"title":"Non-canon appearances","level":3,"content":[{"type":"list","elements":[{"text":"LEGO Star Wars: The Video Game","elements":[]},{"text":"LEGO Star Wars: The Complete Saga","elements":[]},{"text":"Tag & Bink: Revenge of the Clone Menace","elements":[]},{"text":"Star Wars: Tiny Death Star","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Attack of the Clones The Visual Dictionary","elements":[]},{"text":"The Official Star Wars Fact File 44","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"\"Obi-Wan Kenobi: Wizard of the Desert\"—Star Wars Insider 112","elements":[]},{"text":"Dining at Dex's on Hyperspace","elements":[]},{"text":" Slyther Bushforb in the Databank","elements":[]},{"text":" The General on StarWars.com","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]},{"text":"\"10 Amazing Moments from Star Wars: The Clone Wars: Season Four\"—Star Wars Insider 134","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: Force Collection","elements":[]}]}],"images":[]}]}