{"sections":[{"title":"Bimm (Near-Human)","level":1,"content":[{"type":"paragraph","text":"The Bimms were diminutive Near-Humans from the planet Bimmisaari. The Bimms had a reputation as a peaceful, hospitable people. Sharing their homeworld with furred humanoids also known as the Bimm, the two species were completely unrelated biologically, though they shared a language and cultural identity as Bimms. Many descriptions of Bimm culture and society ignored the biological differences between the two species. Many traveled the galaxy working as merchants and artists. Others remained on their homeworld, or lived in Bimm enclaves on a variety of planets."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A species of Near-Humans, the Bimm were thought to have immigrated to the planet Bimmisaari millennia in the past, assimilating into the culture of the world occupied by a furred species also known as the Bimm. Short in stature, the Bimm compared in height to Human children, growing no taller than 1.5 meters. While comparable to younglings, males of the species frequently, and proudly, grew full beards."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Upon colonizing Bimmisaari, the Near-Human Bimm assimilated with the native species of Bimm, merging their culture and society into one. Though the Bimm species had lived together for almost all of their recorded history, certain aspects of their culture were more associated with one species than with another. While some sources attributed these cultural tendencies to one species or the other, sources such as Mammon Hoole presented them as aspects of a single, shared culture."},{"type":"paragraph","text":"Both species called themselves simply \"Bimms\" and lived harmoniously with each other in their shared forest cities, despite not sharing any biological similarities. They considered themselves to be a united people, and were considered as such by the rest of the galaxy. Intermarriage between the two Bimm species was not uncommon, though genetic incompatibilities required such couples to adopt if they wanted children."},{"type":"paragraph","text":"Bimms were fond of art, music, and storytelling; their favorite stories involved heroic adventures, though they were usually content to hear the stories rather than inspired to take part in adventures themselves. The language Bimmini, which was used by both species, was sung, rather than spoken. A Bimm conversation had a seemingly mystical quality, sounding to Human ears like songs being sung in five-part harmony."},{"type":"paragraph","text":"Both species were noted for their mild-tempered, peaceful tendencies, which was the reason the two species lived together in harmony. This tendency extended to non-Bimm visitors from offworld, who would be treated as honored guests. The Bimm greeting ritual involved a reception line which each visitor would walk through. In complete silence, each Bimm in line would reach out and gently touch the visitor's head, arm, or back. More important visitors would attract correspondingly large crowds in the procession. This honor did not extend to armed visitors, however, who would be expected to leave their weapons behind. One of the greatest events in Bimm society was the visit of a member of the Jedi Order. Greatly revered by both species of Bimm, tales of Jedi such as Murrtaggh were popular among Bimm bards long after the fall of the Order. Even Bimmisaari's laws prohibiting visitors from carrying weapons were relaxed for visiting Jedi carrying lightsabers."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20130903013846\/starwars\/images\/thumb\/d\/d1\/Bimm_bard_HR.png\/180px-Bimm_bard_HR.png","caption":"A Bimm bard."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Evolving on a world on the Outer Rim, the Bimm traveled to the planet Bimmisaari during the Great Manifest Period. With the colonization of the world, the Bimm were introduced to the native species of furred Humanoids. Growing together as a united society the two species became known collectively as the Bimm and were well respected play-writes and experts in hospitality. During the Great Sith War forces from the Galactic Republic moved along the Lesser Lantillian Route, upon which the Bimm homeworld was located, to mount a counteroffensive to the Sith Empire."},{"type":"paragraph","text":"By the time of the New Sith Wars, the Republic had grown significantly weaker from centuries of war, and the Hutt regime and Sith Empire had conquered the world. The Bimm remained under Hutt control long after the destruction of the Sith Empire, remaining in space contested by the Confederacy of Independent Systems during the Clone Wars. Having quietly withdrawn from the corrupt Republic decades before the war, the Bimms found that their world was remote enough that few took notice of them, allowing their people to escape most of the chaos of the Republic's fall and the later oppression of the Galactic Empire. During the Sy Myrthian Insurrection, the Bimm were conquered by the Empire and the Hutts driven off the world. After the Battle of Endor, the Bimms remained neutral, but friendly toward the Alliance to Restore the Republic and later, the New Republic. While controlled by the Greater Maldrood as of 4 ABY, the Bimm were conquered by Grand Admiral Mitth'raw'nuruodo in 9 ABY."},{"type":"paragraph","text":"Around this time, agents of the New Republic Leia Organa Solo, Luke Skywalker and Han Solo were dispatched to Bimmisari on a peace meeting in 9 ABY which was meant to open negotiations for the Bimms to join the Republic. The Shi'ido anthropologist Mammon Hoole included an entry on the Bimms in his publication. A major trade center, the Bimm were decimated in 26 ABY by the Yuuzhan Vong during their invasion of the galaxy. By the end of the war, the New Republic made a push to free the Bimm, saving what was left of their homeworld and species from total annihilation."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060329200857\/starwars\/images\/thumb\/1\/19\/X_bimm2.jpg\/200px-X_bimm2.jpg","caption":"Two Bimms dressed in traditional garb."}]},{"title":"Bimms in the galaxy","level":2,"content":[{"type":"paragraph","text":"The Near-Human Bimms were the most frequently encountered type of Bimms in the galaxy. Working as entertainers or scholars, some Bimms became adventurers, whether as scoundrels who somehow worked their way into the circles of nobility, or as artists who followed heroes in order to witness great deeds which they could record in ballads. Entire communities of Bimms were also found in enclaves off Bimmisaari, which were noted for their hospitality."},{"type":"paragraph","text":"One Bimm who defied the pacifist Bimm norm during the Galactic Civil War was Rajah Ubooki, a Near-Human Bimm and Imperial Intelligence agent who impersonated the Prophet of the Dark Side Kadann, and later declared himself Galactic Emperor. During the time of the Clone Wars, a group of five Bimm investors visited the Cularin Trade Show, which was being held in the Cularin system, aboard the starship TAV Prosperity. During the show, the ship suffered a hyperdrive failure in the region of the Cularin comet cloud, causing a booth to fall on the investors."},{"type":"paragraph","text":"Force-sensitive Bimms were not uncommon and many found their way into the ranks of the Jedi Order throughout the world's history with the Republic. Jedi were always treated with respect in Bimm culture and celebrations were had when one visited their planet. Bimm artists such as Ha'lathin or Vasnish Kay, and traders and smugglers such as Rycar and Rayc Ryjerd, were typical of Bimms in the galaxy."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The first depiction of a Bimm was a background character seen in the Mos Eisley Cantina scenes of Star Wars: Episode IV A New Hope in 1977. This character, played by little person actor Marcus Powell, was known on set as \"Flash Gordon Midget.\" In 1979's The Star Wars Holiday Special, cut footage of Powell's character shot on the Mos Eisley street set was used. Neither appearance formally named the character or his species."},{"type":"paragraph","text":"The name \"Bimm\" first appeared in Timothy Zahn's 1991 novel, Heir to the Empire. 1993's Heir to the Empire Sourcebook, a supplement for West End Games' Star Wars: The Roleplaying Game written by Bill Slavicsek, described the Bimm species in more detail, and provided illustrations. While the West End Games description of the Bimms said they were \"half-furred\", an illustration by Allen Nunis and Paul Daly made them appear to be simply short Humans."},{"type":"paragraph","text":"In 1995, a comic book adaptation of Heir to the Empire was published by Dark Horse Comics. The adaptation's artwork by Olivier Vatine and Fred Blanchard depicted clearly non-Human aliens with large floppy ears. The same year, however, the Premiere Limited set of the Star Wars Customizable Card Game, published by Decipher, Inc., included a card identifying the \"Flash Gordon Midget\" from the original film as Rycar Ryjerd, a Bimm smuggler. Ryjerd, having been portrayed by an actor without extensive prosthetic makeup, resembled the Human-like Bimms from West End Games illustrations more closely than the floppy-eared aliens drawn by Vatine and Blanchard. In 1998, a card in the Jabba's Palace Limited expansion set identified another background character in Star Wars: Episode VI Return of the Jedi, again played by an actor without extensive makeup, as Rycar Ryjerd's son Rayc."},{"type":"paragraph","text":"The confusion was resolved in 1998 by Daniel Wallace's The Essential Guide to Planets and Moons. The Bimmisaari entry included a drawing of two floppy-eared Bimms, but noted that the planet was also inhabited by a small Human-like species with the same name. Later works, such as 2001's The Essential Guide to Alien Species by Ann Margaret Lewis and various Wizards of the Coast supplements for their Star Wars Roleplaying Game, went into more detail about the history and shared culture of the two Bimm species."},{"type":"paragraph","text":"A later retcon in Abel G. Peña's 2006 article Evil Never Dies: The Sith Dynasties identified Kadann, one of the main villains in the Jedi Prince series of young adult novels by Hollace and Paul Davids, as a Bimm. It also explains that the Kadann in the novels was only posing as the true Kadann, a short Human. Confusion between Near-Human Bimms and Humans also appears in Brian Campbell's 2001 Star Wars Roleplaying Game adventure The Rycar Run, which describes Rycar Ryjerd as a Human."}],"images":[]}]}