{"sections":[{"title":"Bith","level":1,"content":[{"type":"paragraph","text":"Bith were a peaceful, highly-evolved craniopod species native to the planet Clak'dor VII. Fully adapted to a civilized, high-technology lifestyle, Bith were found galaxy-wide at all levels of society, most notably as engineers, scientists, intellectuals, consultants, and musicians."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Bith were craniopods with pale pink, yellow, or (rarely) green skin, large heads, large lidless eyes, toeless feet, and long fingers. Their thumb and small finger were both fully opposable. The Bith's internal systems were different from most humanoids, as the Bith had only one lung, and exhaled through their skin. Bith also lacked a proper nose, instead having highly sensitive olfactory organs hidden in the skin-flaps of their cheeks."},{"type":"paragraph","text":"The other Bith senses were also acute. Bith could sense the tonal qualities of sound as well as other races sensed colors. Their eyes, as big as a Menahuun's, were able to focus to 0.07 on the Gandok Scale and they could see microscopic details of nearby objects, but were extremely nearsighted as a result. An interesting side effect of their incredible sensors was the effect of sonic grenades, or screamers, on them. It was described as causing their heads to explode. Similarly, Bith had high manual dexterity which helped them manipulate fine tools, though their physical prowess with gross motor skills was only average."},{"type":"paragraph","text":"Bith had even evolved past the need for sleep. Instead, they would slip into a light meditative trance, which allowed them to get as much rest in four hours as other species could get in eight. During this trance, Bith were still almost fully aware of their surroundings. A Bith's reproductive organs atrophied over time, as did the portions of their brain governing such impulses. As such, Bith were unable to reproduce naturally, instead relying on artificial conception and gestation. Mates brought genetic material to a Computer Mating Service for analysis against prospective mates. Bith children were created from genetic material from two parents, which was combined, fertilized, and incubated for a year."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090709061620\/starwars\/images\/thumb\/c\/c8\/Bith_NEGAS.jpg\/180px-Bith_NEGAS.jpg","caption":"A Bith musician."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Bith were one of the galaxy's most ancient civilizations, with a history going back millions of years. This antiquity garnered respect in certain quarters, such as among the Gree, who gave them more respect than other, \"younger\" species. Their society was highly regimented, with everything from mate selection to political leadership controlled by sophisticated computer programs."},{"type":"paragraph","text":"Made easily accessible to the Galactic Republic circa 5500 BBY with the blazing of the Rimma Trade Route, the Bith were moving around in the galaxy by the time of the Great Sith War, as their homeworld was part of space greatly explored by the Republic at that time. Considered part of the civilized galaxy by the time of the Jedi Civil War, the Bith homeworld was located in space controlled by the New Sith Empire during the Republic Dark Age though it was not directly affiliated with the Empire. When the Republic recovered following the Ruusan Reformation the Bith became a vocal voice in the Galactic Senate, gaining a seat in the Senate Building on Coruscant."},{"type":"paragraph","text":"Circa 300 BBY, the Bith city-states of Nozho and Weogar engaged in a massive civil war using biological weapons over patent rights to a new hyperdrive. The aftermath of the Nozho–Weogar War destroyed Clak'dor VII's ecosystem and crippled the Bith industrial capacity, forcing the Bith to retreat to sealed cities and rely on imported goods and machinery to keep their society functioning. The Y'bith, a subspecies of Bith, were descended from Bith whose genetic code was altered in the aftermath of a biological attack on Nozho. These \"ghost Bith\" resettled on Clak'dor IV and developed their own society, somewhat estranged from the Bith mainstream."},{"type":"paragraph","text":"The war also brought out a strong pacifistic streak in Bith culture, electing vocal Senate members who pushed for galactic disarmament. While they attempted to remain neutral during the Separatist Crisis they were eventually coerced into supporting the Confederacy of Independent Systems against the Republic by Confederate leader Count Dooku. Both the Clone Wars and the rise of the Galactic Empire made the Bith uneasy about conditions in the rest of the galaxy, with most Bith choosing to wait out the dark times within Clak'dor VII's sealed cities. After the Clone Wars ended, the Bith did not resist the Empire, instead putting their technical expertise at the service of the Imperial war machine. The Bith were horrified by the Empire, however, and were among the first species to be liberated from the Eriadu Authority by the New Republic in 5 ABY. The Bith did not emerge fully from their isolation until 8 ABY, shortly after the Hapans rejoined the Galactic community. A Republic stronghold during the Thrawn campaign, the Bith homeworld would go on to avoid invasion by the Yuuzhan Vong."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20121008171625\/starwars\/images\/thumb\/8\/81\/Bith_band_TCWf.png\/250px-Bith_band_TCWf.png","caption":"A Bith band in Ziro the Hutt's lair on Coruscant."}]},{"title":"Bith in the galaxy","level":2,"content":[{"type":"paragraph","text":"A species of pacifists following the devastation of their homeworld during the Nozho–Weogar War many Bith worked as engineers, data analysts, or in other intellectual professions. Others used their intelligence, natural technical skills, and dexterity to work in the criminal underworld. Many Bith worked as cantina staff, since bartenders in Bith society held a position equivalent in many ways to priests in other cultures. The Intelligence Quartermaster for Imperial Intelligence during the Cold War was a Bith stationed on the Imperial Fleet. At the same time, Unaw Aharo was a Bith Jedi Knight during escalating war between the Republic and Sith Empire. Their hearing also made Bith such as Figrin D'an and the Modal Nodes, the house band in the Mos Eisley Cantina circa 0 BBY, excellent musicians."},{"type":"paragraph","text":"Bith had a long standing tradition of sending their Force-sensitive members to join the Jedi Order, aside from Jedi Aharo during the Cold War, Ph'ton served as a Jedi Master during the Clone Wars and a Jedi General in the Grand Army of the Republic. Many other Bith had served the Order as Jedi Consulars over the years: some of them were rumored to have survived the Great Jedi Purge by hiding on their homeworld."},{"type":"paragraph","text":"Not all Forceful Bith served the Jedi however. Rugess Nome was taken as a member of the Order of the Sith Lords and eventually named Darth Tenebrous. In 67 BBY, while Tenebrous and his apprentice Darth Plagueis were stationed on the planet Bal'demnic, Plagueis killed the Bith Sith Lord, stating that he planned to overthrow the Rule of Two, establishing a new order of his own, that would stay for a thousand years under his control."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070121195006\/starwars\/images\/thumb\/3\/38\/BithBand.jpg\/180px-BithBand.jpg","caption":"A Bith band at the Boonta Eve Classic on Tatooine fanfaring Ark Roose."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Bith species were originally meant to be called the \"Sicmoo\", a phonetic anagram of \"music\". The Bith costumes seen in A New Hope were built by Doug Beswick."}],"images":[]},{"title":"Appearances","level":2,"content":[],"images":[]},{"title":"Non-canon appearances","level":3,"content":[{"type":"list","elements":[{"text":"Jedi Academy: Return of the Padawan","elements":[]},{"text":"\"Hate Leads to Lollipops\"—Star Wars Tales 9","elements":[]},{"text":"LEGO Star Wars: The Complete Saga","elements":[]},{"text":"Tag & Bink: Revenge of the Clone Menace","elements":[]},{"text":"Star Wars: The Clone Wars: Republic Heroes","elements":[]},{"text":"LEGO Star Wars: Revenge of the Brick","elements":[]},{"text":"\"Falling Star\"—Star Wars Tales 15","elements":[]},{"text":"\"The Princess Leia Diaries\"—Star Wars Tales 11","elements":[]},{"text":"LEGO Star Wars II: The Original Trilogy","elements":[]},{"text":"\"Smuggler's Blues\"—Star Wars Tales 14","elements":[]},{"text":"\"Skippy the Jedi Droid\"—Star Wars Tales 1","elements":[]},{"text":"\"The Emperor's Court\"—Star Wars Tales 14","elements":[]},{"text":"\"Junkheap Hero\"—Star Wars Tales 6","elements":[]},{"text":"Star Wars Infinities: The Empire Strikes Back","elements":[]},{"text":"The Return of Tag & Bink: Special Edition","elements":[]},{"text":"\"The Revenge of Tag & Bink\"—Star Wars Tales 12","elements":[]},{"text":"Star Wars: Yoda's Challenge Activity Center","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Bith on Star Wars: The Old Republic Wiki","elements":[]},{"text":"Bith on SWG Wiki","elements":[]}]}],"images":[]}]}