{"sections":[{"title":"Berrite","level":1,"content":[{"type":"paragraph","text":"The Berrites of the planet Berri were considered to be stupid and clumsy by most other species, though they could be deceptively cunning. Berrites were one-meter tall creatures with two arms and four legs. Their skin was green and wrinkled, with patches of coarse black hair. They had poor vision and hearing, but they had a natural sonar ability which compensated for these deficiencies."},{"type":"paragraph","text":"All Berrites were hermaphrodites, though they would take on male or female identities when dealing with aliens depending on which sex would get them better treatment. They often had trouble telling male and female aliens apart. When Berrites reproduced, one would take on a male role and fertilize another's eggs. The second would take on a female role, carrying the eggs (usually three) within \"her\" skin folds. Hatchlings grew to full size within one year, but did not reproduce until the age of sixty. Berrites could live to be four hundred years old."},{"type":"paragraph","text":"Berrites were master foragers, sharing the scarce resources of their homeworld with one another in a spirit of anarchic cooperation. They often gathered together for hours on end to chew the food stored in their cheek pouches and listen to stories."},{"type":"paragraph","text":"Though Berrites had been known to galactic society for a long time, their planet attracted little trade, so few Berrites left Berri. Despite the scarcity of natural resources, the Galactic Empire made several attempts to enslave the Berrites and make Berri a factory planet. However, Berrites responded to Imperial pressure by pretending to be much stupider than they really were. After high accident rates and defective products, the planetary Governor gave up and requested a transfer. This behavior was typical of the Berrite response to pressure, which preferred cheerful uncooperativeness and feigned stupidity to violent conflict."},{"type":"paragraph","text":"Famous Berrites included Mexnean, a con-\"woman\" and petty thief active during the Galactic Civil War."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20090712225826\/starwars\/images\/thumb\/8\/83\/Mexnean.jpg\/200px-Mexnean.jpg","caption":"Mexnean, a con artist"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Paradise Snare","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Wanted by Cracken","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}