{"sections":[{"title":"Balinaka","level":1,"content":[{"type":"paragraph","text":"The Balinaka (singular, Balinak) were a species of strong, amphibious mammals native to the arctic planet Garnib. They were covered with thick fur, though they also had a dual lung\/gill system which enabled them to breathe both air and water. They also had webbing between each digit and flexible, long tails. Balinaka also had excellent vision, and could see in dark conditions. Their diet consisted mostly of fish."},{"type":"paragraph","text":"The Balinaka shared Garnib with the Vernols. Their homeworld was extremely cold, with several continents covered by glaciers dozens of meters thick. The Balinaka carved entire underground cities called Sewfes. The Balinaka were also skilled at sculpting ice, a skill which won them fame throughout the galaxy. Balinaka were encountered often enough by Rebel SpecOps personnel to acquire the nickname \"bears.\" In the Senex sector, Balinaka and Ossans were used as slaves by House Vandron on Karfeddion and other neighboring worlds."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Balinaka of Garnib were a species of sentient bipedal mammals who stood about 4 meters at the shoulder. Their height was impressive in comparison to Humans, the most common and populous species in the galaxy, who only grew to an average 1.70 meters. They were covered with a thick coat of white fur adapted to the arctic climate of their homeworld. Their bodies were fairly muscular, yet slender and supple. They possessed long limbs, as well as long, flexible tail and neck. They also had four-fingered hands with webbings between each digit, ending in sharp claws. Their feet were also webbed, with three forward-facing toes and a fourth, rear-facing digit."},{"type":"paragraph","text":"As an amphibious species, the Balinaka were adapted to living both in water and on land. They were able to extract oxygen in both environments thanks to their dual respiratory system, having gills and lungs at the same time. Their faces featured two rounded ears, an elongated muzzle with a black nose. They also had two dark eyes, with a degree of color sensitivity far exceeding that of Humans, and a series of membranes that allowed them to filter light at will. Balinaka could adjust their perception so they could even look at a shiny white ice sculpture directly in front of a blinding light. That characteristic also allowed them to see through darkness as if there was broad daylight."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20090902113054\/starwars\/images\/thumb\/6\/64\/Balinak.jpg\/200px-Balinak.jpg","caption":"A group of Balinaka"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Usually playful and easy-going, the Balinaka often treated serious situations with nonchalance. While often regarded as unsophisticated savages by disdainful strangers, they were in fact smart and very capable of handling a crisis. More than anything, they were extremely proud of their ice sculptures, which many races across the galaxy considered great works of art. Their love for sculpting also allowed them to discover the famed Garnib crystals that ensured prosperity for their planet."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Balinaka evolved on the world of Garnib, a planet covered in solid glaciers and frigid oceans, located within the Bozhnee sector of the Outer Rim Territories. Thousands of years before the Galactic Civil War, these ursine sentients were already known for their innate sense of beauty and their tradition of making personalized ice sculptures. However, these amphibious mammals could have remained in the shadow of galactic history, were it not for the famous Garnib Crystals. It was the great sculptor Vornest Dep-thesel Digarsarg who first incorporated small fragments of gemstones and colored pumice in one of his sculptures, creating a masterpiece he called \"Crystal of the Stars.\" The Human named Abram Zavict, a friend of the Balinak artist, realized that similar works of art could be sold offworld for amazing profits. This led to the birth of Galactic Crystal Creations, an employee-owned corporation that propelled the Balinaka to galactic recognition."},{"type":"paragraph","text":"By 22 BBY, when the Clone Wars broke out, the Balinaka's homeworld was affiliated with the Galactic Republic, a democratic galaxy-spanning government that had been founded some 25,000 years before. With the end of the war in 19 BBY, Supreme Chancellor Palpatine named himself Emperor and dismantled democracy. The \"Old\" Republic had passed away, and the Galactic Empire had replaced it. Wishing to impose his vision of a New Order, the Emperor established military bases on thousands of worlds in order to subjugate as many planetary governments as possible. Garnib, homeworld of the Balinaka, was no exception. An Imperial base known as Garnib Station was built on the icy planet, and Governor Verus Carbinol was designated responsible for law and order on Garnib. However, because the Balinaka paid their taxes with no complaints and retained their friendly behavior against the Imperials, the social and political climate of Garnib remained unchanged. However, despite their docile conduct, the Balinaka were reclassified as a slave species by the Imperial occupying power."},{"type":"paragraph","text":"Following its defeat at the Battle of Endor in 4 ABY, the Galactic Empire fractured into various factions. The fate of the Balinaka fell into the hands of Sander Delvardus, who styled himself as the Superior General of his faction, the Eriadu Authority."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20121104015444\/starwars\/images\/thumb\/a\/a1\/GarnibAtlas.png\/200px-GarnibAtlas.png","caption":"The icy planet Garnib and surrounding planets of the Outer Rim"}]},{"title":"Balinaka in the galaxy","level":2,"content":[{"type":"paragraph","text":"In the waning days of the Galactic Republic, a troupe of Balinaka dancers travelled to Tatooine, a sun-scorched planet in the Tatoo system. Shortly before the Boonta Eve Classic of 32 BBY, those artists worked at the podracers' hovel, where they performed a chorus-line routine for the delight of their audience. The two-headed Troig Fodesinbeed Annodue—a local celebrity on Tatooine—was actually fond of their performances. Around the same time, a group of Balinaka had travelled to the Mid Rim world of Ando Prime, where they attended the podracing tracks."},{"type":"paragraph","text":"During the height of the Galactic Civil War, a galaxy-wide conflict between Palpatine's Empire and the Rebel Alliance, the Balinaka were a sufficiently common sight that members of the Rebel SpecOps had coined the slang term \"bear\" to designate them."},{"type":"paragraph","text":"In the Senex sector, a region of space run by an alliance of \"Ancient Houses,\" Balinaka were captured and bred into slavery by Lady Theala Vandron Jr., the Head of House Vandron. Because of this, Lady Vandron was charged with inhumanity by the New Republic High Court in 12 ABY."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20120912161241\/starwars\/images\/1\/15\/Otterlike_species-AS.png","caption":"The dancing Balinaka at the podracers' hovel"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Balinaka were first mentioned in Planets of the Galaxy, Volume One, a supplement to Star Wars: The Roleplaying Game published by West End Games in 1991. Four years later, the species received a passing mention in Children of the Jedi, a novel written by Barbara Hambly and published in 1995 by Bantam Spectra. In the novel, members of this species were mentioned along with Ossans, and their name was misspelt as \"Bilanaka\".Lucasfilm official Leland Chee, who maintains the Holocron continuity database, has confirmed that \"Balinaka\" is the correct spelling of this species' name."},{"type":"paragraph","text":"In 2000, the Balinaka were featured in Star Wars: Anakin's Speedway, an educational game realeased by Lucas Learning. It was Maryn Roos, the Lead Artist on the project, who chose to include the bear-like beings into the game. Three different worlds had been chosen to host the podraces, and Roos had skimmed through Star Wars reference books looking for characters to populate these planets. She discovered the Balinaka in old West End Games RPG material and decided to include them on the Ando Prime track."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20120913210539\/starwars\/images\/thumb\/6\/64\/Painted_Balinaka_by_Maryn_Roos.jpg\/180px-Painted_Balinaka_by_Maryn_Roos.jpg","caption":"A group of dancing Balinaka, as painted by Maryn Roos"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Anakin's Speedway","elements":[]},{"text":" \"Relative Difficulties\"—Star Wars Gamemaster Screen","elements":[]},{"text":"Children of the Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Planets of the Galaxy, Volume One","elements":[]},{"text":"The Star Wars Planets Collection","elements":[]},{"text":"Galaxy Guide 9: Fragments from the Rim","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]}]}],"images":[]}]}