{"sections":[{"title":"Bovorian","level":1,"content":[{"type":"paragraph","text":"Bovorians were a species of sapient mammals indigenous to Bovo Yagen."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Bovorians were a sentient species that was thought to have evolved from flying mammals. For that reason, their most striking features were their leather-like, membranous vestigial wings. With the arm stretched out from the body, that part of their anatomy looked like the wing of a mynock, a silicon-based parasite commonly found across the galaxy. The Bovorians, however, could not fly, and their wings were only leftovers of their evolutionary process."},{"type":"paragraph","text":"Overall, Bovorians had a humanoid body characterized by a single head, a torso and four limbs attached to it. Their bodies were slightly thinner and longer than those of Humans, with an average height rangin from 1.8 to 2.3 meters. The Bovorians were noted for their acute sense of hearing that gave them the ability to detect movement from up to a kilometer away. They could also see in the infrared spectrum, thus allowing them to see in complete darkness as long as there were heat sources nearby."},{"type":"paragraph","text":"Like some other species that included the Vors and the Chadra-Fan, the Bovorians were fifteen times more likely than others to catch pollution-induced respiratory ailments such as lungrot, silicalung, hemorrhagic molting and dioxo-brionchiectasis shock."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Bovorians evolved on the jungle-covered planet of Bovo Yagen, in the Kailion sector of the Expansion Region of the galaxy. They were believed to have evolved from non-sentient flying mammals, whence their distinctive membranous wings that had lost much of their ancestral function."}],"images":[]},{"title":"Bovorians in the galaxy","level":2,"content":[{"type":"paragraph","text":"By the time of the Separatist Crisis in 22 BBY, there were Bovorians who lived on Coruscant, the capital world of the Galactic Republic. That year, the Rhinnal State Medical Academy released a report of middle-class districts on Coruscant, identifying ten species under the risk of being affected with diseases from the pollution. That list included the Bovorians, and the information was relayed in the forty-ninth issue of the 531st HoloNet News volume."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In Cracken's Threat Dossier, it was revealed that the Bovorians' homeworld of Bovo Yagen was only christened so after being discovered by an Imperial explorer of the same name. However, in the HoloNet News Vol. 531 49, they were already called \"Bovorians\" at the time of the Separatist Crisis, three years before the rise of the Galactic Empire."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" Study: Pollution Standards Still Endanger Many—HoloNet News Vol. 531 49","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Cracken's Threat Dossier","elements":[]},{"text":"Alien Encounters","elements":[]}]}],"images":[]}]}