{"sections":[{"title":"Biituian","level":1,"content":[{"type":"paragraph","text":"Biituians were a near-Human sentient race indigenous to Biitu."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Biituians were a species who resembled mainline Humans in many respects, with the only difference between the two being their green skin. Like Humans, members of the species had the standard humanoid frame and facial features. Members of the species wore loose-fitting attire made of cloth which usually revealed their midsections. All the members of this species wore some form of headgear which concealed the top of their heads, making it hard to tell if the species had hair like most humanoids."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Biituians of Biitu had a very peaceful lifestyle and culture that mainly focused on agricultural endeavors such as farming and harvesting the fruits that grew on the native trees of their homeworld. Their architecture was simple and they were not very industrious as only few buildings and structures dotted their mostly untouched green valleys. They were also very friendly and welcoming to off-worlders. However, due to their peaceful nature, they were defenseless against powerful armed foes."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Around 15 BBY, the Biituians were enjoying their peaceful existence until the arrival of the tyrannical Great Heep, who, with the aid of the Galactic Empire, was able to conquer Biitu and deplete its water supply. Luckily, thanks to the efforts of Mungo Baobab and his friends C-3PO, R2-D2, Fidge and Chubb, they were able to free the planet from the Empire and put an end to the Great Heep."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"A Small Scrappy War!\"—Star Wars: The Clone Wars Comic UK 6.33","elements":[]},{"text":"Star Wars: Droids—\"The Great Heep\"","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Encyclopedia","elements":[]},{"text":" \"Viva Space Vegas! The History of the Marvelous Wheel, Part 2,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}