{"sections":[{"title":"Balosar (species)","level":1,"content":[{"type":"paragraph","text":"Balosars were sentient humanoids made distinct from the Human race by the retractable antennapalps which sprouted from their skulls. The species was indigenous to the heavily-polluted planet Balosar."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Physically similar to Humans, the Balosars appeared to be sickly and gaunt when compared to the galaxy's most common species due to the heavy pollution of their homeworld. The most striking difference between Balosars and humanity were a pair of antennapalps which sprouted from underneath their thick coarse hair on their skulls. Retractable, the atennapalps allowed them to listen into the subsonic range and gave the species a physical intuition, which members of the Jedi Order sometimes mistook for Force sensitivity. Because they could detect surges in emotion which could forewarn them of impending danger, they were able to survive and navigate the dangers which lurked on their crime-infested homeworld. Another attribute possessed by Balosars due to their toxic environments was their resistance to toxins and most poisons. Because of the immunity, the Balosars were able to consume mass amounts of the deadly narcotics known as death sticks, a product of Balosar itself. Despite the immunity from its deadly components, Balosars were not immune to its addictive properties, and because of this and their world's natural dangers, Balosars had a relatively short lifespan compared to similar species."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Having evolved on a highly-polluted world overrun by galactic megacorporations eager to exploit the world's lax ecological protection laws, the Balosars quickly descended into social decay, resulting in most of the populace finding a place in the criminal underworld of the galaxy. Balosars were commonly stereotyped as spineless, weak-willed, depressed, sarcastic, cynical, and selfish. Despite these stereotypes, the Journal of Personality and Galactic Psychology did not indicate any sort of genetic link to these emotions and attributed them largely to their world's social failings. As the world was the home of the balo mushroom, the Balosar criminal element quickly learned to craft death sticks, one of the galaxy's most potent narcotics. Death sticks were a devastating factor in Balosar society, where they addicted users, forcing them to purchase more. Pollution is one of the causes of the heavy addiction to death sticks, but the Balosar's immunity to toxin allows them to consume them without much effect other than the life-long addiction. Some Balosars even entered the death stick business, where they would travel in hopes of finding potential customers."},{"type":"paragraph","text":"Because the planet Balosar was not a place of high opportunity, Balosars often left their homeworld to look for a more prosperous place to live. Since many carried criminal records, they were perceived as self-absorbed individuals who had a difficult time determining right from wrong. Young Balosars were commonly sent to worlds to find as better education and allow themselves to pursue a better life. Speaking both Basic and Balosur, naming conventions included a first and last name; the later of which was divided by an apostrophe following the first three letters. While this was the norm, it was not a rule as some individuals possessed names without the apostrophe. Names popular among the Balosars were Nina Dar'Eboros, Vaya Bar'jaraka and Zirk Mer'darro."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060904200458\/starwars\/images\/thumb\/d\/de\/Balosar1.jpg\/150px-Balosar1.jpg","caption":"A male Balosar"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"During the reign of the Galactic Republic, the illegal trade in death sticks became the greatest competition to the spice from Ryloth called ryll. The rivalry resulted in a hatred between the Balosars and Twi'leks that would last for centuries. Remaining out of galactic politics, the Balosar economy was ruined during the reign of the New Republic, as the world's pollution had seeped into the balo mushroom farms deep underground, destroying the entire crop. The Balosars had no choice but to join the Twi'lek's spice industry as low-level runners in order to maintain some form of economic stability. When the Yuuzhan Vong War occurred, the Balosars were not bound to treaties with the New Republic and were therefore not protected by its military. However, they escaped the Yuuzhan Vong's conquest and their planet remained as it always was throughout the invasion."}],"images":[]},{"title":"Balosars in the galaxy","level":2,"content":[{"type":"paragraph","text":"While most Balosars remained on their world to lead a life of crime or addiction, the younger generation always strove to escape the poverty and life of dependence fostered on their native world. Traveling across the galaxy to enroll in countless institutions of learning and academies, many Balosar encountered in higher society tended to be well-educated and free of the taint of narcotics. Despite this, they bore with them a strong stereotype of drug addicts and weakness that was not untrue of their slythmongering brethren. A dealer on Coruscant during the Separatist Crisis, Elan Sel'Sabagno had an encounter with the famed Jedi Knight Obi-Wan Kenobi at the Outlander Club while he hunted the assassin Zam Wesell."},{"type":"paragraph","text":"While Force-sensitive Balosars were not unheard of, they were exceedingly rare. In the years before the Clone Wars, a male Balosar served the Jedi Order as a Jedi Knight and was stationed at the Coruscant Jedi Temple in the week preceding the opening battle of the war."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Darth Plagueis","elements":[]},{"text":"Star Wars: Episode II Attack of the Clones","elements":[]},{"text":"Star Wars Episode II: Attack of the Clones comic","elements":[]},{"text":"Boba Fett: Pursuit","elements":[]},{"text":"Evasive Action: Recruitment","elements":[]},{"text":"The Last Jedi","elements":[]},{"text":"Rebel Force: Renegade","elements":[]},{"text":"Winner Lose All","elements":[]},{"text":"Scoundrels","elements":[]},{"text":"Star Wars: Episode V The Empire Strikes Back","elements":[]},{"text":"Millennium Falcon","elements":[]},{"text":"\"Roll of the Dice\"—Star Wars Insider 135","elements":[]},{"text":"Star Wars: Legacy: Claws of the Dragon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":" \"Rogues Gallery\"—Star Wars Gamer 10","elements":[]},{"text":" \"Galactic Power Brokers\"—Star Wars Gamer 10","elements":[]},{"text":"Ultimate Adversaries","elements":[]},{"text":"Underworld Appendix: Swoops, Spice, and Wretched Rogues on Hyperspace","elements":[]},{"text":"A Mon Alone","elements":[]},{"text":"Scum and Villainy","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Elan Sleazebaggano in the Databank","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" Star Wars Illustrated: The Empire Strikes Back","elements":[]}]}],"images":[]}]}