{"sections":[{"title":"B'rknaa","level":1,"content":[{"type":"paragraph","text":"The B'rknaa were a mineral-based sentient species native to Indobok, a moon orbiting the planet Kalarba in the Mid Rim region of the galaxy. In actuality, the moon was itself an enormous member of the species. The B'rknaa's true appearance was that of crystalline clusters, but their inner energy could induce life into inanimate matter. When they were deemed old enough to take up a host body, the B'rknaa crystals animated giant stone husks in which they could move about. These sentients were considered unusual by Humans, and they were known to Jedi biologists for their resistance to Force abilities. The B'rknaa were also capable of merging together several stone bodies to form a much larger unit."},{"type":"paragraph","text":"The B'rknaa of Indobok were known to the wider galactic community since at least the first millennium before the Battle of Yavin. Compared to the civilized worlds of the galaxy, their technology level was very low: they did not build cities and wore no clothing, but they did develop a language of their own. Despite their bulky appearance, they were usually friendly to strangers, with the notable exception of those who tried to steal B'rknaa crystals. Around 6 BBY, the pirate Jace Forno planned on stealing some of them so she could supply the black market. Thanks to the intervention of the Pitareeze family from Kalarba, Forno's henchmen were driven off, and her plan was thwarted. Twenty years later, during the Great War, the B'rknaa were put in jeopardy when the Yuuzhan Vong, a species of extra-galactic invaders, destroyed Kalarba, dispersing radioactive material across the system in the process."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The B'rknaa hailed from Indobok, a heavily cratered moon orbiting the planet Kalarba, near Hosk Station in the Mid Rim region of the galaxy. In their purest form, the B'rknaa appeared as blueish, irregularly faceted and roughly cylindrical crystals, which gathered in clusters on the surface of Indobok. Their crystalline nature made their biology similar to that of the Shards from the planet Orax and the Tsil of the planet Nam Chorios."},{"type":"paragraph","text":"The B'rknaa prisms were able to channel vast amounts of complex energy; in fact, one large B'rknaa specimen was enough to handle all the systems power of a planetoid. B'rknaa had the power to animate inert materials, which they then used as host bodies. When they were considered old enough, a B'rknaa took control of an enormous, bulky form made of rock—the only substance available in sufficient quantities on the moon. In fact, the moon of Indobok itself was a single, massive, adult B'rknaa. All other B'rknaa on its surface were its \"offspring,\" in that all B'rknaa were controlled by one shared mind. Brown or gray, their giant, bulky host shells appeared humanoid in shape, with two legs and two arms ending with four-fingered hands. Their legs were roughly shaped like pillars, and their feet were almost round. A typical B'rknaa body featured an ashen, expressionless face with a gaping mouth and two forward-facing, white eyes. Several units were able to join their bodies to form larger and more threatening beings. The stone beings from Indobok were also immune to every direct application of the Force thanks to their mineral-based structure and their hive mind. Scientists of the Jedi Order theorized that the Force itself allowed certain species to develop barriers that could redirect its flow."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20120710004736\/starwars\/images\/thumb\/2\/26\/B%27rknaa_crystal.PNG\/180px-B%27rknaa_crystal.PNG","caption":"A B'rknaa crystal cluster"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"On Indobok, the B'rknaa who took stone bodies led a simple lifestyle, considered archaic by galactic standards. They did not build cities or communal habitats, living in the open air, and they wore no clothing. Despite their brutish and frightening appearance, the B'rknaa were indeed sentient. They usually were peaceful and welcoming, only showing signs of aggression toward those who wanted to steal their precious crystals—which were not mere commodities, but were in fact younger, unshelled B'rknaa."},{"type":"paragraph","text":"When they were considered old enough, the B'rknaa prisms were given a humanoid stone husk that was animated simply by putting the crystal cluster inside it. While moving around in their stone shells, B'rknaa were capable of speech. Their language consisted of creaking and cracking sounds. Although it was possible, at least for a protocol droid, to learn the basics of the B'rknaa language in a few days, some of its concepts were difficult to translate to Galactic Basic Standard."},{"type":"paragraph","text":"Like the Killiks, the Taurill, and many other species, the B'rknaa didn't recognize individuality, due to their shared mind. Indeed, there was no first person personal pronoun in their language. When a single stone giant spoke, it voiced the opinion of the whole species."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20061126045519\/starwars\/images\/thumb\/e\/e2\/Brknaa1.JPG\/180px-Brknaa1.JPG","caption":"A B'rknaa husk being animated"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The crystalline B'rknaa and their rock bodies were known to the Jedi Order by at least 1000 BBY. The Jedi noted that the B'rknaa were difficult to affect with mind-based Force powers, and the rock beings were resistant to all direct applications of the Force. Following the Ruusan Reformation, the Jenet Grand Master of the Order, Fae Coven, created The Jedi Path: A Manual for Students of the Force. In this guidebook, the Tynnanbiologist Bowspritz mentioned the B'rknaa in a chapter entitled \"Advanced Cultures and Politics in the Republic,\" listing them among those species resistant to the Force."},{"type":"paragraph","text":"Outside scientific circles, the stone giants of Indobok remained largely unknown, unlike other mineral sentients such as the stone eels of Storthus. Even the Pitareezes, a Human family from Kalarba, did not know of the species before they encountered mobile B'rknaa in 6 BBY. That year, the Corellian thief Jace Forno intended to visit Indobok and steal a bag of crystals, hoping she could sell them on the black market. Forno rented two droids from the Pitareezes—the protocol droid C-3PO and the astromech droid R2-D2—so they could accompany her to the cratered moon. The Corellian pirate ordered the droids to find crystal clusters and take as many as they could while she took care of the stone giants. C-3PO successfully stole a single large crystal, but several B'rknaa in stone form thereafter attacked Forno and the droids. The party then ran to their starship for safety, but C-3PO could not make it in time because his joints froze. Forno abandoned the gold-colored protocol droid on Indobok, intending to come back later with more men and weapons."},{"type":"paragraph","text":"While abandoned on the moon, C-3PO discovered the truth about the B'rknaa's gentle nature and their sentient crystals. Eventually, the Baron Pitareeze, headed for Indobok—along with his son Jarth, her daughter-in-law Meg, and his grandson Nak—to rescue C-3PO. Much to their amazement, the Kalarbans made their first contact with the B'rknaa. Through C-3PO, the Humans befriended the B'rknaa and spent the night on the moon. Suddenly, Forno and her minions landed on Indobok, ready to do battle against the stone giants. The B'rknaa put up a valiant defense with the help of their new Pitareeze allies. The stone giants fought their enemies with their fists, eventually merging together into a single, colossal entity. The united B'rknaa shattered one of Forno's armed vehicle on the ground. The Corellian thief's henchmen were no match for the mineral titan, and they beat a hasty retreat. The precious B'rknaa crystals were thus restored to safety."},{"type":"paragraph","text":"Nearly twenty years later, in 26 ABY, the Yuuzhan Vong, a species of technophobic invaders from another galaxy, endangered the B'rknaa. In an assault against Kalarba and its moon, the Vong used Yo'gand's Core, a battle tactic that they had employed earlier on the moon of Sernpidal. Hosk Station, Kalarba's other moon, was drawn in, and both the planet and its station were destroyed in the process. As a consequence of the impact, radioactive material was spread across the whole Kalarba system, rendering it uninhabitable for centuries."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130528135128\/starwars\/images\/thumb\/1\/1c\/Brknaa_by_Bowspritz.png\/140px-Brknaa_by_Bowspritz.png","caption":"A B'rknaa stone giant drawn by Master Bowspritz"},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20110318041933\/starwars\/images\/thumb\/6\/63\/B%27rknaa.jpg\/140px-B%27rknaa.jpg","caption":"Forno's thieves could not match the strength of the B'rknaa united in a single body."}]},{"title":"B'rknaa in the galaxy","level":2,"content":[{"type":"paragraph","text":"Because of their ability to channel energy, B'rknaa crystals were considered precious commodities by the few off-worlders who knew of their existence. The thief Jace Forno once sold a single crystal for fifty thousand credits. She intended to steal as many clusters as she could and sell them on the open market in order to gain substantial income."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The B'rknaa first appeared in July 1994, in the fourth issue of the Star Wars Droids: The Kalarba Adventures comic book series. The story was written by Dan Thorsland and pencilled by Bill Hughes. As Indobok itself is a member of the species, the list of appearances below includes the works in which the moon was featured."},{"type":"paragraph","text":"After a sixteen-year hiatus, the B'rknaa were mentioned in The Jedi Path: A Manual for Students of the Force, a reference book written by Daniel Wallace and published on September 28, 2010. The species had its own entry in a guide to important or unusual alien races, complete with a stylized illustration by Derek Thompson. In the book, B'rknaa were described as \"rock-based creatures.\" This description apparently refers to their mobile bodies, since the beings themselves are crystalline in nature. The words \"rock\" and \"crystal\" cannot be used interchangeably. A crystal is a pure mineral, meaning it has an exact chemical composition, while a rock is an aggregate of two or more minerals."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20071221163615\/starwars\/images\/thumb\/d\/d4\/Swdr4.jpg\/140px-Swdr4.jpg","caption":"The B'rknaa debuted in Star Wars Droids: The Kalarba Adventures 4."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Droids Special","elements":[]},{"text":"Star Wars Droids: The Kalarba Adventures 4","elements":[]},{"text":"Star Wars Droids: Rebellion 1","elements":[]},{"text":"Star Wars Droids: Rebellion 2","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Straight from the Horse's Mouth\"—Star Wars Insider 25","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Official Star Wars Fact File 112","elements":[]},{"text":"Star Wars: The Comics Companion","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]}]}],"images":[]}]}