{"sections":[{"title":"Brrbrlpp","level":1,"content":[{"type":"paragraph","text":"The Brrbrlpp were the indigenous species of the planet Esfandia. They were often referred to by offworlders as the Cold Ones since it was easier to say than Brrbrlpp. They spoke a form of trinary via radio-waves which was taught to them by Commander Si of the Esfandia Long-Range Communications Base. The Brrbrlpp as a species were talkative and their calls could travel great distances. Like many other sentient species, Brrbrlpp youth were willing to risk death for excitement."},{"type":"paragraph","text":"Since Esfandia could not support a large and varied ecosystem, the species was never plentiful and during the time of the Yuuzhan Vong War, it was estimated that there were several thousand Brrbrlpp. On Esfandia, the Brrbrlpp tend massive gardens and bred swarms of flying insects which they traded for trace minerals filtered from the air."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology","level":2,"content":[{"type":"paragraph","text":"The Brrbrlpp were flower shaped amoeba like sentients. They rippled the outer edges of their bodies to provide motion and could move rather swiftly if necessary. A ring of photosensors studded its interior, they had radial lines of cilia, semi-transparent flesh and had a complicated skeleton to keep its \"petals\" rigid. Inside its body they had gently pulsating dark patches that could have been internal organs, they also had a long whip-like tail. The females laid eggs and the males would later fertilize them. As a species the Brrbrlpp would breed in caves they called the Nesting Plains, which were deep and located near the warm of Esfandia's core."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The New Jedi Order: Force Heretic III: Reunion","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}