{"sections":[{"title":"Brubb","level":1,"content":[{"type":"paragraph","text":"Brubbs were reptilian bipeds from the planet of Baros in the Baros system. To adapt to life on an arid world with frequent sandstorms, the ancestors of the Brubbs evolved thick skins and tough, transparent membranes over their eyes for protection. Since there was little to hear on Baros other than howling winds, Brubbs were nearly deaf. Brubbs were strong for their size (1.5 to 1.7 meters tall), due to their origins on a high-gravity world. Brubbs also had the limited ability to camouflage themselves by changing skin color, though the color range was only from yellow to a greenish-gray."},{"type":"paragraph","text":"Brubbs were a very social people, living in large communal groups called habas. Most habas were extended family groups which raised children communally and operated some specialized business together, such as a farm, a mine, or even a vacation resort. Certain \"university\" habas, however, were drawn from the best and brightest of many habas. These groups had technology approaching galactic standard, especially in the areas of solar and wind power. According to Obo Rin's Catalog of Intelligent Life in the Galaxy, it was one of these university habas that first made contact with the outside galaxy, by beaming radio signals which eventually came to the attention of the Galactic Empire. Some evidence exists of earlier Brubb contact with other inhabited worlds, however. In 32 BBY, a cantina in Mos Espa on Tatooine was known as \"The Blue Brubb\"."},{"type":"paragraph","text":"Each haba was governed by its ten oldest Brubbs. As female Brubbs had a lower life expectancy, due to the stress of egg-laying, the leaders were almost always male. At the same time that the Brubbs were dealing with first contact with aliens, many female Brubbs were arguing for an equal share in haba leadership, and protesting by refusing to lay eggs."},{"type":"paragraph","text":"Since Baros was a high-gravity world with few natural resources and low-tech natives, the Brubbs did not see much interstellar trade. Their main commodities were the Brubbs themselves—their strength and toughness made them prized mercenaries and laborers. Jabba the Hutt employed some Brubbs as guards on Khetanna, his sail barge. Other Brubbs, due to their sociable nature and interesting appearance, became \"ornamental\" beings hired as retainers for wealthy Core Worlders."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20061125180211\/starwars\/images\/thumb\/3\/32\/Corellian_Merchants%27_Guild_party.jpg\/250px-Corellian_Merchants%27_Guild_party.jpg","caption":"A Brubb at a CMG guildhouse"},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20080819080546\/starwars\/images\/thumb\/1\/12\/Brasck.jpg\/150px-Brasck.jpg","caption":"Brasck"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Episode I: Anakin Skywalker","elements":[]},{"text":"Star Wars Droids: Rebellion 2","elements":[]},{"text":"Star Wars Missions 2: Escape from Thyferra","elements":[]},{"text":" \"Family Problems\"—Instant Adventures","elements":[]},{"text":"Zorba the Hutt's Revenge","elements":[]},{"text":"Heir to the Empire","elements":[]},{"text":"The Last Command","elements":[]},{"text":"The Last Command 2 comic","elements":[]},{"text":"The Last Command 3 comic","elements":[]},{"text":"The New Rebellion","elements":[]},{"text":"The New Jedi Order: Star by Star","elements":[]},{"text":"The New Jedi Order: Enemy Lines I: Rebel Dream","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]},{"text":"Dark Nest II: The Unseen Queen","elements":[]},{"text":"Fate of the Jedi: Omen","elements":[]},{"text":"Fate of the Jedi: Allies","elements":[]},{"text":"Fate of the Jedi: Vortex","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Heir to the Empire Sourcebook","elements":[]},{"text":"Galaxy Guide 9: Fragments from the Rim","elements":[]},{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"The Last Command Sourcebook","elements":[]},{"text":"Galaxy Guide 11: Criminal Organizations","elements":[]},{"text":"Alliance Intelligence Reports","elements":[]},{"text":"The Thrawn Trilogy Sourcebook","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":" \"The Smuggler's Alliance\"—Star Wars Gamer 3","elements":[]},{"text":" \"Ships of the Smuggler's Alliance\"—Star Wars Gamer 4","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}