{"sections":[{"title":"Banasthaur","level":1,"content":[{"type":"paragraph","text":"The Banasthaurs were a sentient species from the Banasthau system, distinguished by wings. Several Banasthaurs were present on the planet Toprawa in 0 BBY. There, together with many other patrons of a local cantina, they confronted the Human Havet Storm over his possession of a lightsaber."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Banasthaurs were a species of sentient beings who were distinguished by wings."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Banasthaurs were native to the Banasthau system, located in the Inner Rim. They were present in the galaxy by the time of the Galactic Civil War. In the year 0 BBY, several Banasthaurs visited a cantina on the planet Toprawa. The cantina, known as Al The Alchemist's, was patronized by mercenaries, gun-runners, and bounty hunters from across the galaxy, the infamous Boba Fett among them. Also present in the cantina that day was Havet Storm, a young Human boy whose grandfather had been a Jedi Knight. The patrons discovered that Storm was carrying a lightsaber, so the Banasthaurs and other bar-goers clustered around the boy, staring at him with hostile intent. Fett, who bore a grudge against the boy from a previous encounter, ordered the assorted patrons of the cantina to kill Storm, but the boy escaped."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Paul Cockburn created the Banasthaurs for his pick-a-path adventure Jedi Dawn, published by Boxtree Ltd in 1993. The Banasthaurs are not mentioned in the adventure itself, only in the front matter immediately following the book's cover. The scene described here closely matches a scene contained in the adventure, which includes the same quotation from Boba Fett. The Banasthaurs are also mentioned in the front matter of The Lost Jedi Adventure Game Book, published in 1992, which collected Jedi Dawn and its sequel, The Bounty Hunter."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Jedi Dawn","elements":[]},{"text":"The Lost Jedi Adventure Game Book","elements":[]}]}],"images":[]}]}