{"sections":[{"title":"Bimm (furred species)","level":1,"content":[{"type":"paragraph","text":"The Bimms were diminutive sentient mammalians from the planet Bimmisaari. A floppy-eared, furred humanoid species, the Bimms had a reputation as a peaceful, hospitable people. Sharing their homeworld with a Near-Human species also known as the Bimm, the two species were completely unrelated biologically, they shared a language and cultural identity as Bimms. Many descriptions of Bimm culture and society ignored the biological differences between the two species. One of the most famed Bimm in galactic history went against his people's stereotypical, inoffensive demeanor, however. The Sith adept and serial murderer Toki Tollivar rose to power in the wake of the Great Sith War, causing problems for the Jedi Order until his death during the early years of the Mandalorian Wars."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Having evolved on the planet Bimmisaari, the furry Bimms were slightly taller than the Near-Human Bimms, with an adult height of 1.0 to 1.6 meters, with the females being slightly taller on average. They were covered in short fur that ranged from black to tan in color. Their faces had floppy ears, long muzzles, and small black eyes. Their hands possessed three long fingers and a thumb each."},{"type":"paragraph","text":"Both species called themselves simply \"Bimms\" and lived harmoniously with each other in their shared forest cities. They considered themselves to be a united people, and were considered as such by the rest of the galaxy. Intermarriage between the two Bimm species was not uncommon, though genetic incompatibilities required such couples to adopt if they wanted children."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Though the Bimm species had lived together for almost all of their recorded history, certain aspects of their culture were more associated with one species than with another. While some sources attributed these cultural tendencies to one species or the other, sources such as Mammon Hoole presented them as aspects of a single, shared culture."},{"type":"paragraph","text":"The language Bimmini, which was used by both species, was sung, rather than spoken. A Bimm conversation had a seemingly mystical quality, sounding to Human ears like songs being sung in five-part harmony. Bimms were particularly good merchants, and felt the day was incomplete without a good round of shopping and haggling. The art of bargaining was respected in their culture, and fair dealing was highly honored. However, cheating and theft were tantamount to murder in their society. Bimms were also noted for their yellow clothing."},{"type":"paragraph","text":"Both species were noted for their mild-tempered, peaceful tendencies, which was the reason the two species lived together in harmony. This tendency extended to non-Bimm visitors from offworld, who would be treated as honored guests. The Bimm greeting ritual involved a reception line which each visitor would walk through. In complete silence, each Bimm in line would reach out and gently touch the visitor's head, arm, or back. More important visitors would attract correspondingly large crowds in the procession. This honor did not extend to armed visitors, however, who would be expected to leave their weapons behind."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20051123220030\/starwars\/images\/thumb\/f\/f0\/Bimmisaari.JPG\/200px-Bimmisaari.JPG","caption":"Bimms rushing to greet the Millennium Falcon during the Galactic Civil War."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Evolving on the planet Bimmisaari, the Bimms first made contact with the galactic community during the Great Manifest Period with the colonization of their world by a Near-Human species. Growing together as a united society the two species became known collectively as the Bimm and were well respected playwrights and experts in hospitality. During the Great Sith War, forces from the Galactic Republic moved along the Lesser Lantillian Route, upon which the Bimm homeworld was located, to mount a counteroffensive to the Sith Empire."},{"type":"paragraph","text":"By the time of the New Sith Wars, the Republic had grown significantly weaker from centuries of war, and the Hutt regime and Sith Empire had conquered the world. The Bimm remained under Hutt control long after the destruction of the Sith Empire, remaining in space contested by the Confederacy of Independent Systems during the Clone Wars. Having quietly withdrawn from the corrupt Republic decades before the war, the Bimms found that their world was remote enough that few took notice of them, allowing their people to escape most of the chaos of the Republic's fall and the later oppression of the Galactic Empire. During the Sy Myrthian Insurrection, the Bimm were conquered by the Empire and the Hutts driven off the world. After the Battle of Endor, the Bimms remained neutral, but friendly toward the Alliance to Restore the Republic and later, the New Republic. While controlled by the Greater Maldrood as of 4 ABY, the Bimm were conquered by Grand Admiral Mitth'raw'nuruodo in 9 ABY. Around this time, a delegation from the New Republic traveled to meet with the Bimm, hoping to convince them to join their fledgling government. The Shi'ido anthropologist Mammon Hoole included an entry on the Bimms in his publication The Essential Guide to Alien Species. A major trade center, the Bimm were decimated in 26 ABY by the Yuuzhan Vong during their invasion of the galaxy. By the end of the war, the New Republic made a push to free the Bimm, saving what was left of their homeworld and species from total annihilation."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100312181959\/starwars\/images\/thumb\/9\/94\/Toki.jpg\/200px-Toki.jpg","caption":"Sith Acolyte Toki Tollivar."}]},{"title":"Bimms in the galaxy","level":2,"content":[{"type":"paragraph","text":"While content with remaining on their homeworld, those Bimms who went offworld were usually traders or business people. Some Bimms became adventurers, whether as scoundrels who somehow worked their way into the circles of nobility, or as artists who followed heroes in order to witness great deeds which they could record in ballads. Entire communities of Bimms were also found in enclaves off Bimmisaari, which were noted for their hospitality."},{"type":"paragraph","text":"Force-sensitives of the species were inclined to join the Jedi Order, as Jedi were highly revered in Bimm society for their heroism and monastic lifestyle. Although most joined the Jedi, at least one furred Bimm, Toki Tollivar, defected to the Sith Empire and became an adept and learned to wield a lightsaber. At the end of the Great Sith War Tollivar began a private campaign of revenge and serial murder, before being killed by the Mandalorian Crusader Rohlan Dyre."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100312182259\/starwars\/images\/thumb\/7\/7f\/Toki_Tollivar.jpg\/200px-Toki_Tollivar.jpg","caption":"Tollivar, also known as the Corellian Strangler."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The name \"Bimm\" first appeared in Timothy Zahn's 1991 novel, Heir to the Empire. 1993's Heir to the Empire Sourcebook, a supplement for West End Games' Star Wars: The Roleplaying Game written by Bill Slavicsek, described the Bimm species in more detail, and provided illustrations. While the West End Games description of the Bimms said they were \"half-furred\", an illustration by Allen Nunis and Paul Daly made them appear to be simply short Humans."},{"type":"paragraph","text":"In 1995, a comic book adaptation of Heir to the Empire was published by Dark Horse Comics. The adaptation's artwork by Olivier Vatine and Fred Blanchard depicted clearly non-Human aliens with large floppy ears. The same year, however, the Premiere Limited set of the Star Wars Customizable Card Game, published by Decipher, Inc., included a card identifying the \"Flash Gordon Midget\" from the original film as Rycar Ryjerd, a Bimm smuggler. Ryjerd, having been portrayed by actor Marcus Powell without extensive prosthetic makeup, resembled the Human-like Bimms from West End Games illustrations more closely than the floppy-eared aliens drawn by Vatine and Blanchard. In 1998, a card in the Jabba's Palace Limited expansion set identified another background character in Star Wars: Episode VI Return of the Jedi, again played by an actor without extensive makeup, as Rycar Ryjerd's son Rayc."},{"type":"paragraph","text":"The confusion was resolved in 1998 by Daniel Wallace's The Essential Guide to Planets and Moons. The Bimmisaari entry included a drawing of two floppy-eared Bimms, but noted that the planet was also inhabited by a small Human-like species with the same name. Later works, such as 2001's The Essential Guide to Alien Species by Ann Margaret Lewis and various Wizards of the Coast supplements for their Star Wars Roleplaying Game, went into more detail about the history and shared culture of the two Bimm species."}],"images":[]}]}