{"sections":[{"title":"Brigian","level":1,"content":[{"type":"paragraph","text":"The Brigians were a humanoid species native to the planet of Brigia, in the Tion Hegemony. They were thin and tall with purple skin and red eyes. The planet also had a sensitive ecosystem, requiring all incoming ships to undergo a phase-one decontamination before landing. During the Yuuzhan Vong War, the Yuuzhan Vong invaded Brigia. The native Brigians resisted at first, though they were eventually forced to go underground and begin a guerrilla war. The desperate Brigians pleaded with the Corporate Sector Authority for help, but the business minded organization ignored them. Ultimately, the surviving Brigians were enslaved and implanted with surge-coral implants."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Brigians were a sentient, humanoid species that had a tall, reedy, gawkish anatomy. Brigian shoulders were narrow, extending toward two, thin arms, each with a long, slender hand. These hands exuded greasy secretions. Most members of the species had skinny posteriors, and their legs and feet were too narrow to fit into standard-sized combat boots. Brigian ankles were slender and strangely boned. There was some variation in body size; for example, Inspector Keek was broadly built for his species, and possessed considerable strength. The Brigians had elongated skulls, small, bud-like noses, and eyes that protruded from their skull. These had tiny, red pupils. The Brigians had purple skin pigmentation, which varied in darkness between individuals. Brigian anatomy also included lateral folds, which could be used to conceal small items such as weapons or pouches."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Han Solo and the Lost Legacy","elements":[]},{"text":"Death Star","elements":[]},{"text":"Before the Storm","elements":[]},{"text":"Shield of Lies","elements":[]},{"text":"Tyrant's Test","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]}]}],"images":[]}]}