{"sections":[{"title":"Bardottan","level":1,"content":[{"type":"paragraph","text":"The Bardottans were a Force attuned species from the planet Bardotta. Sometime during their history, the species worshiped a demon named Malmourral. Although this religion eventually disappeared, it was revived by the Frangawl Cult, which was led by the Bardottan Peteen, and the Dathomirian Mother Talzin. The Bardottans later formed the group known as the Dagoyan Masters, who ruled Bardotta, led by a queen. In addition, the Bardottans were also led by the Bahk-tov Council. During the Clone Wars, the Bardottan leader was Queen Julia. By this time, the Frangawl Cult had begun kidnapping the Dagoyan Masters, and were sacrificing them to Malmourral while obtaining their inherent Force energy. This plot was later foiled by the Gungan politician Jar Jar Binks and the Jedi Master Mace Windu."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Bardottans came in two general body types: Tall and short. Either way, Bardottans were thin aliens with long, curved necks, pointed skulls, and in some cases, colorful head crests. Skin color ranged from a variety of greens and grays, to orange, red, and blue. Eye color also varied between individuals. Some of these colors were red, orange, and yellow. All Bardottans had black irises in their eyes. Bardottans had hands with four digits. Some Bardottans had skin that displayed more than one color. Bardottans could speak basic and another dialect."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Force-sensitive Bardottans evolved on the planet Bardotta. During their history, members of the species worshiped a demon named Malmourral. This religion later shrank into obscurity, and Bardotta planet fell under the control of the Dagoyan Masters and the Bahk-tov Council. This government system, by the time of the intergalactic Clone Wars, was ruled over by Queen Julia and High Seneschal Peteen. At some point, the Dagoyan Masters began to despise the Jedi Order, as they believed the Jedi to be thieves. Later, Peteen had allied with the Dathomirian Nightsister Mother Talzin and revived the religion of Malmourral, naming it the Frangawl Cult. This revived cult also catered to non-Bardottans, such as the Ming Po and Zygerrians. A Frangawl base was established on the planet Zardossa Stix. During the Clone Wars, Peteen's cult began to kidnap members of the Dagoyan Masters. The Dagoyans were brought to a ritual temple underneath the main government temple, where they were sacrificed to Malmourral, and their Force energy was harvested into small orb like devices. One of the hostages was the Dagoyan Master Joseph."},{"type":"paragraph","text":"Julia contacted the Galactic Republic for aid, and requested that help be sent in the form of the Gungan representative Jar Jar Binks. The Jedi, fearing a greater cause for concern from the kidnappings, also sent Jedi master Mace Windu. Arriving on Bardotta, they were received by Peteen and the guardsman Savatte. Although Windu felt a great darkness overcoming the planet, he could not pinpoint it. Eventually, Julia herself was kidnapped. Windu, Binks, and Savatte tracked her to the underground caves beneath the government temple, where Binks was kidnapped. Savatte left to find help, while Windu tracked Binks with a comlink. Meanwhile, a Dagoyan Master was sacrificed and harvested by Peteen. Binks was later freed, and together with Windu defeated the cultists and freed the other masters, including Joseph. Peteen, however, escaped to Zardossa Stix with Julia. Windu and Binks gave chase, and after several skirmishes with cultists and Mother Talzin, Peteen was killed, Talzin retreated, and Julia was rescued."},{"type":"paragraph","text":"Not all Bardottans identified as a Bardottan."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20150411014735\/starwars\/images\/thumb\/9\/91\/BardottanCouncil.png\/275px-BardottanCouncil.png","caption":"The Bahk-tov Council listens to a speech from Peteen"}]},{"title":"Bardottans in the galaxy","level":2,"content":[{"type":"paragraph","text":"For a time, Bardottan children were inducted in the Jedi Order. However, the Dagoyan Masters branded the Jedi as thieves because of this. As such, the Jedi were not welcome on Bardotta. Outside of Bardotta, some members of the species, allied with the Frangawl Cult, operated on Zardossa Stix."},{"type":"paragraph","text":"Another member of the species was Mars Guo, who was a member of the species who did not personally identify as a Bardottan. A Podracer pilot, Guo participated in a Boonta Eve Classic Podracer on the planet Tatooine. Guo initially did well, and took second position during the second lap of the race. However, the first place competitor, the Dug Sebulba, tossed an object into one of Guo's engine intakes, crippling Guo's Podracer and causing him to crash into the sandy desert. Sebulba later crashed in the same stretch of land during the end of the third lap."},{"type":"paragraph","text":"A Bardottan taxi driver lived on the planet Lothal five years before the Battle of Yavin."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20130126020122\/starwars\/images\/thumb\/4\/4b\/Mars_Guo_before_crash.png\/200px-Mars_Guo_before_crash.png","caption":"Mars Guo crashes during the Boonta Eve Classic Podrace"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Episode I The Phantom Menace","elements":[]},{"text":"Star Wars Journeys: The Phantom Menace","elements":[]},{"text":"Star Wars: The Clone Wars – \"The Disappeared, Part I\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"The Disappeared, Part II\"","elements":[]},{"text":"Ezra's Gamble","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" \"The Disappeared, Part I\" Episode Guide - The Clone Wars on StarWars.com","elements":[]},{"text":" \"The Disappeared, Part II\" Episode Guide - The Clone Wars on StarWars.com","elements":[]},{"text":" Bardotta in the Databank","elements":[]}]}],"images":[]}]}