{"sections":[{"title":"Bouncer","level":1,"content":[{"type":"paragraph","text":"Bouncers were the native sentient species of Ruusan. Globe-like creatures, they received their name from their method of locomotion: propelled by the wind, they bounced themselves off obstacles to reach great heights. Their bodies were covered in green fur, and numerous tentacles grew from their body, of which half ended in delta shaped appendages capable of digging and writing in the ground."},{"type":"paragraph","text":"The Bouncers' homeworld was the location of a great battle between the forces of the Army of Light and the Brotherhood of Darkness during the New Sith Wars. The Bouncers tried to ease the struggles of both sides, bringing support and comfort to the dying using their mild telepathic abilities. When the conflict ended with Lord Kaan unleashing the thought bomb, trapping the spirits of hundreds of Jedi and Sith inside, the Bouncers maintained a prophecy that \"a Knight would come, a battle would be fought, and the prisoners go free.\" The Bouncers helped fulfill the prophecy when they guided the Jedi Kyle Katarn to the planet's Valley of the Jedi over a thousand years later. A Bouncer was also responsible for the survival of Rain, who went on to become the Sith Lord Darth Zannah."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Bouncers were a species of sentient beings native to the planet Ruusan. They were shaped like medicine balls, and they appeared rather fragile. Their internal physiology was balloon-like, resulting in negligible weight. Their skin was leathery and warm and dry to the touch. They appeared only as green blobs when viewed under infra-red. Their skin was covered in green hair, which fluttered in the Ruusan breezes. Dominating the Bouncers' faces were two enormous luminous eyes. These had large pupils which were especially good for gathering light due to the species' nocturnal nature. Bouncers had no visible nose or mouth."},{"type":"paragraph","text":"From these globe shaped bodies, the Bouncers had numerous tentacles, half of which ended in delta shaped appendages. These functioned efficiently as small digging tools. The Bouncers were able to \"walk\" along the ground with these tentacles and could stand on them when gathered together. These tentacles were very dexterous and were used by the Bouncers to manipulate items, such as styluses. When bouncing, these tentacles often drifted behind, giving them a ghostly appearance."},{"type":"paragraph","text":"The Bouncers' primary method of locomotion relied on the wind. Due to their balloon-like bodies and negligible weight, they were easily carried by the winds. They were able to control their momentum and direction via specialized skin flaps that functioned as wind vanes. By turning, raising, and lowering these flaps, the Bouncers were able to control their direction. They aimed themselves at oncoming obstacles such as stones or boulders, and in this manner \"bounced;\" hence their name. Using that technique, they could achieve heights up to fifty or sixty meters. The larger Bouncers were even able to carry extra weight without it affecting their momentum."},{"type":"paragraph","text":"Through a combination of manipulation of their tentacles and friction against the sand, the Bouncers were able to brake. They then used their tentacles to anchor themselves to the ground against the winds. In that manner, tribes of Bouncers traveled across the plains and wastelands of Ruusan, tacking and wheeling as a group."},{"type":"paragraph","text":"Bouncers also enjoyed using their tentacles to climb large rock spurs, from which they flung themselves into the void, floating until gravity drew them to the ground. Their motion was considered by some to be dance-like, and for Morgan Katarn, epitomized freedom."},{"type":"paragraph","text":"While it is unclear whether the Bouncers were able to manipulate the Force, they were clearly able to feel it, and their presence did send out ripples through the Force. The Force also frequently gave them dreams and glimpses of the future. These were highly accurate, in both predicting the immediate future and more distant events. When passing on these oracles, however, they couched them in vague riddles and generalities. The dreams also incurred a cost; weak Bouncers could be killed by dark dreams."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110206033727\/starwars\/images\/thumb\/d\/df\/Bouncer.jpg\/180px-Bouncer.jpg","caption":"A group of Bouncers float over the forest"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Bouncers' society maintained largely unchanged over the thousands of years of their existence. In 4 ABY, they still had a pre-industrial society, only numbering between 18,000 to 20,000 individuals. These were organized into tribes of around fifty to sixty, with an older Bouncer as leader."},{"type":"paragraph","text":"The Bouncers lived in the mountainous areas of their planet, and did not roam the deserts as was common for the Ruusanians. While Ruusan was once a temperate world with vast forests, after the explosion of Lord Kaan's thought bomb, the planet was largely arid wastelands. As such, the Bouncers made some adaptations to their behavioral patterns. Water became much scarcer as a consequence. To offset that, each morning, the Bouncers dug a series of shallow depressions into which they placed an inverted cone. These depressions were then covered with a thin, semitransparent tissue. These functioned as water stills, condensing moisture in the air and gathering it in the cone. In that manner, a supply of water awaited the Bouncers when they emerged at night. The Bouncers developed a number of herbal medicines and natural remedies for maladies they suffered."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130630222500\/starwars\/images\/thumb\/9\/94\/Bouncers_with_Morgan.jpg\/180px-Bouncers_with_Morgan.jpg","caption":"Bouncers encounter Morgan Katarn."}]},{"title":"Language","level":3,"content":[{"type":"paragraph","text":"The Bouncers communicated to each other through a series of whistling and warbling. They were also mildly telepathic, with the ability to sense the emotions of those around them, both Bouncer and alien alike. The telepathy enabled them to communicate directly with some individuals, projecting thoughts into their minds, such as developed in the relationship between Laa and Rain. They could not read specific thoughts, however, and required the other conversationalist to actually speak aloud."},{"type":"paragraph","text":"However, they most frequently communicated with aliens through writing. That took the form of Basic, which they scribbled into the sand of Ruusan. By 4 ABY, their syntax was considered strange, and full of archaic language, yet it was still understandable."}],"images":[]},{"title":"Temperament","level":3,"content":[{"type":"paragraph","text":"Because of the Bouncers' dependence on wind for locomotion, they were patient beings, sometimes prone to a certain inherent fatalism in the way that they approached the world. An example of that was their defensive technique when attacked; the tribe reacted by turning inwards, clustering together. When an Imperial patrol led by Forley attacked them, it would have resulted in their slaughter if not for the intervention of Jan Ors and a number of the colonists of Fort Nowhere. On other occasions, the Bouncers did what they could to defend themselves; later in that same incident, a Bouncer grabbed Forley by the head and surrounded his head with its tentacles. In a panic, Leeno, one of Forley's stormtroopers, shot at the creature, killing both it and his commanding officer. However, the brave action by the Bouncer was just another form of their fatalism."},{"type":"paragraph","text":"The Bouncers also had a great respect for life, feeling obliged to heal and comfort others. That extended to physically saving lives, such as that of the child Rain. Despite premonitions and dreams that her life was bad, the Bouncer Laa insisted that \"life is life,\" and so saved Rain."}],"images":[]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Galactic Republic","level":3,"content":[{"type":"paragraph","text":"The Bouncers evolved on the planet Ruusan as the sole sentient species. The planet was eventually discovered by the Galactic Republic and as part of a wave of expansion throughout the newborn Teraab sector, it was settled by the Mining Guild. Deposits of iron, copper, cesium, iridium, nickel, and uranium dotted the planet, but proved to be less significant as those of neighboring planets such as Drogheda, Istic II, Pesmenben IV, and Tyne's Horky. As such, it was only sparsely settled, and the Bouncers co-existed peacefully with the various miners, farmers, and trappers."},{"type":"paragraph","text":"The planet gained unexpected importance during the New Sith Wars when it took on symbolic importance. Victory for the Sith would represent their inevitable advance, while liberation by the Republic would represent the Jedi's ability to defeat their sworn foes. That resulted in seven great battles on Ruusan, and innumerable skirmishes. The Bouncers did not take sides in the fight, but rather offered their unique assistance to both sides. Gifted with mild telepathy, the Bouncers visited the aftermaths of the battles, and projected images of succor and comfort to the surviving wounded. They became a welcome and familiar sight to both sides, as they aided in healing."},{"type":"paragraph","text":"However, that changed when the Sith forces began to use powerful dark side rituals to defeat the Jedi forces. Led by Darth Bane, the Sith unleashed an unnatural firestorm that destroyed huge swathes of forest, killing many Jedi in its flames, and forcing the others into exposed ground. The effect on the Bouncers was devastating. The raging fires killed most, and those that survived were driven mad by the cataclysm. Their ability to comfort was horribly distorted. They began to project terror, panic, and terrible nightmares to the sick and wounded. The Jedi were forced to kill the tormented beings in order to maintain their own morale."},{"type":"paragraph","text":"Only one Bouncer was spared the madness: Laa. Earlier, the old Bouncer had saved the life of a small Human girl. The girl, Rain, was a recruit for the Army of Light, but never reached them when the starship she was on was damaged by Sith Buzzards. Rain fell many meters from the ship, before Laa caught her in mid-air. Rain proved to be very strong in the Force, and instinctively protected Laa from the Sith firestorm. Laa's decision had significant consequences for the future of the Sith. In numerous prophetic dreams, Laa foresaw Rain becoming a powerful dark Jedi. Laa carried Rain on her back for many days until they came across some Jedi forces. Seeing only the Bouncer, the Jedi Petja shot and killed Laa. Instinctively, Rain responded, using the Force to snap the necks of the two Jedi. Ultimately, it was Laa's death that triggered Rain's turn to the dark side. The grieving child was found by Darth Bane, who took her as his apprentice. She eventually became Darth Zannah, a Dark Lord of the Sith."},{"type":"paragraph","text":"The larger conflict between the Jedi and Sith was concluded when Lord Kaan utilized another Sith ritual, known as the thought bomb. It created a receptacle for the dark side, which when detonated, sucked the spirits of all the proximate Jedi and Sith within its bounds. It effectively destroyed the Sith forces and large numbers of the Jedi force also, bringing an end to the war on Ruusan."},{"type":"paragraph","text":"The total effect on the Bouncers of the conflict was devastating. So many were killed by the indiscriminate Sith fires, the Jedi forces, and the thought bomb, that the species was pushed to the edge of extinction. Those that did survive were also faced with a different world, for the thought bomb had desolated much of the planet, transforming it into wastelands. Two of the Bouncers who did survive found Rain's cousin Darovit in the aftermath of these battles, speaking directly to his mind and strengthening his will to live after his hand was amputated. They led him to food and medical supplies, so that he could dress his wound and stave off infection. Over the next ten years, the Bouncers developed a particular fascination with Darovit. They taught him their herbal lore, and when he settled down in a hut, two or three Bouncers always circled his hut during the day and ventured out with him whenever he traveled. One such Bouncer was Yuun, who was accompanying Darovit when he discovered the Republic had returned to Ruusan in order to construct a monument to their fallen. Darovit tried to sabotage the project but to no avail. He eventually fought his cousin in a deadly duel, when Rain returned to the planet as a Sith Lord."},{"type":"paragraph","text":"The Republic monument became known as the Valley of the Jedi. Huge statues were erected of the fallen Jedi, as well as numerous tombs. While the memorial was popular for a time, within a decade the bickering Republic began to forget it. However, the Bouncers also made a record of these events, in what they called the \"Poem of Ages.\" The poem included a number of prophecies, including one regarding the Valley of the Jedi. The prophecy foretold of a Jedi Knight who would come to the planet, fight a battle, and free the prisoners trapped within the thought bomb. They preserved the prophecy for nearly a thousand years in which time it was also recorded offworld."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20110206033738\/starwars\/images\/thumb\/6\/61\/Bouncers_comfort.JPG\/180px-Bouncers_comfort.JPG","caption":"Bouncers provide comfort to wounded soldiers."},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110206033734\/starwars\/images\/thumb\/8\/8d\/Bouncers_and_the_thought_bomb.JPG\/180px-Bouncers_and_the_thought_bomb.JPG","caption":"Bouncers with the thought bomb"}]},{"title":"Galactic Empire","level":3,"content":[{"type":"paragraph","text":"The Bouncers slowly recovered their numbers on Ruusan, long after the Republic had forgotten its location. Shifting nebulae within the Teraab sector erased the former hyperspace routes there, ensuring its isolation, and the planet soon became a subject of myth. Around 11 BBY, the smuggler Jerg rediscovered the planet by accident, when he took a random hyperspace jump while being pursued by an Imperial Star Destroyer. He and his team recognized the value in the planet's obscurity, and established a small fort there, known as Fort Nowhere, to store their contraband."},{"type":"paragraph","text":"The Bouncers kept a low profile during that time, continuing their nomadic existence without any significant contact with the smugglers. Ruusan received another influx of foreigners, when Morgan Katarn led a group of three hundred and forty-seven refugees from Sulon to the planet. The inquisitive Katarn ventured out into the countryside to explore. The Bouncers sensed Katarn's approach and believed him to be the one to fulfill the ancient prophecy regarding the Valley of the Jedi. They could detect his Force-sensitivity and so regarded him as a Knight. Furthermore, Morgan had inadvertently fulfilled part of their prophecy by camping above the city of Olmondo, which was buried deep under the sand. The Bouncers gave Katarn instructions to the Valley in the hope he would fulfill the prophecy. However, while Katarn found the location, he realized he did not have the power to free the trapped spirits and left. Despite that failure, the Bouncers remembered their encounter with Morgan, referring to him as \"the Knight who never was.\""},{"type":"paragraph","text":"The Bouncers had little other contact with the refugees after the encounter, remaining elusive. Many of the colonists regarded them with fear and loathing, but some, such as Grif Grawley, regarded them as both beautiful and fascinating, despite only fleeting encounters. It was while Grawley was looking out for Bouncers that he detected an Imperial probe droid launched by the dark Jedi, Jerec. The Imperial leader was seeking the famed Valley of the Jedi and had finally discovered Ruusan. Grawley destroyed the probe droid and returned to Fort Nowhere to warn the settlers of the Imperial discovery. He then hid out in nearby caves, thus avoiding the subsequent Imperial razing of the fort."},{"type":"paragraph","text":"Morgan's son, Kyle Katarn, visited the planet shortly thereafter, in order to prevent Jerec taking control of the Valley. He met Grawley in the badlands, and the gruff man suggested consulting the Bouncers on the location of the Valley. While Grawley, Kyle and their group waited for the Bouncer tribe to approach, an Imperial patrol attacked the tribe as it crossed the desert. In the short time they had been on the planet, the Imperial forces had begun to amuse themselves by hunting the essentially defenseless native species. A number of the Bouncers had been killed and taken as trophies to hang on the troopers' walls. The Bouncers response to the attack was to cluster together, which would have resulted in their deaths if the rebel group had not intervened and attacked the Imperial patrol. In the resulting confusion, the Bouncers took a more assertive action. One in particular wrapped its tentacles around the head of the stormtrooper Forley, blinding him. His companion panicked and shot the Bouncer, killing his commanding officer in the process. Other Bouncers dropped from the sky to knock the trooper to the ground, pinning him there until the rebels arrived."},{"type":"paragraph","text":"After the clash, the Bouncers met with Kyle Katarn. Aware of his mission, they were noncommittal in their response, holding that \"if not now, then someday\" a Knight would fulfill their prophecy. Nevertheless, one of them, called Floater, agreed to act as a guide to the Valley of the Jedi. Floater touched each one of his tribe members in farewell and then led Katarn and his companions into the desert. Guiding them by night, Floater navigated the rebels through a series of canyons, until they were half a kilometer from the Valley. There, as dawn broke, an Imperial probe encountered Floater and the group. Grif Grawley lunged at the droid and activated its self-destruct, taking his own life in the process. Despite the setback, Floater was keen to continue and led Katarn and Ors through underground aqueduct systems right to the entrance of the Valley. There, Floater and Ors remained while Katarn continued alone into the Valley. When Imperials discovered the pair, Ors was captured, but Floater managed to escape through the aqueduct system. The Bouncer had done enough, however, as Katarn went on to free the spirits in the Valley and fulfill the Bouncer prophecy. Katarn soon left Ruusan, keeping its location a secret."},{"type":"paragraph","text":"The location was later discovered by the Chistori Desann in 12 ABY. A former Jedi now working for the Empire Reborn, Desann used residual power in the Valley to create a Force imbued army. He was partially successful before Jedi Master Luke Skywalker expelled him and his forces from the planet. The Bouncers were seemingly unaffected by the encounter."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20071205215050\/starwars\/images\/thumb\/4\/44\/Kyleandbouncers.jpg\/180px-Kyleandbouncers.jpg","caption":"Kyle Katarn communicates with a tribe of Bouncers."},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20061220165456\/starwars\/images\/thumb\/b\/ba\/Katarn_preparing_to_Battle_Jerec.JPG\/180px-Katarn_preparing_to_Battle_Jerec.JPG","caption":"The Bouncer prophecy is fulfilled."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Bouncers were first introduced in the Dark Forces novellas where both Morgan and Kyle Katarn visited the planet Ruusan. They were then featured in the comic Star Wars: Jedi vs. Sith, which depicted events the novellas had revealed in flashbacks set a thousand years earlier. Finally these same events were described in the novel Darth Bane: Path of Destruction which expanded the back-story of the villain Darth Bane."},{"type":"paragraph","text":"Between these three sources, there appear some inconsistencies in the Bouncers' descriptions. In the novellas, the name Bouncer is given due to their method of locomotion. They are described as needing to bounce to gain height and being reliant on the wind for locomotion. However in the comics, they appear to be able to fly under their own power, and Path of Destruction describes them as “hovering” over the wounded. This led some fans to consider Bouncers to be telekinetic, but this is not the case. This article has followed the in-depth descriptions of the novellas, treating the comic depiction of floating as artistic license."},{"type":"paragraph","text":"The novellas describe the Bouncers as having retractable tentacles, over which they have motor control. In the comics, the Bouncers appear to have long hair which streams behind them, but they do exhibit the ability to control these. Path of Destruction describes these as \"ribbonlike tails.\" Another difference is that in the novellas, the Bouncers blink and open their eyes, whereas Path of Destruction describes their eyes as lidless. A final difference is that while the Bouncers are described as nocturnal in the novellas, they are frequently active during the day in the comics and novel. While none of these depictions are necessarily irreconcilable, they do exist in some tension with each other."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Jedi vs. Sith 2","elements":[]},{"text":"Star Wars: Jedi vs. Sith 3","elements":[]},{"text":"Star Wars: Jedi vs. Sith 4","elements":[]},{"text":"Star Wars: Jedi vs. Sith 5","elements":[]},{"text":"Star Wars: Jedi vs. Sith 6","elements":[]},{"text":"Darth Bane: Path of Destruction","elements":[]},{"text":"Darth Bane: Rule of Two","elements":[]},{"text":"Dark Forces: Rebel Agent","elements":[]},{"text":"Dark Forces: Rebel Agent audio drama","elements":[]},{"text":"Dark Forces: Jedi Knight","elements":[]},{"text":"Dark Forces: Jedi Knight audio drama","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Chronology","elements":[]},{"text":"Star Wars: Panel to Panel","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The Official Star Wars Fact File 124","elements":[]},{"text":" The Dark Forces Saga, Part 2: Unsung Heroes of the Light on Wizards.com","elements":[]},{"text":" Light and Dark: Endgame on Ruusan on Wizards.com","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide, Special Edition","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Jedi Academy Training Manual","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":"Star Wars: The Ultimate Visual Guide: Updated and Expanded","elements":[]}]}],"images":[]}]}