{"sections":[{"title":"Brownie","level":1,"content":[{"type":"paragraph","text":"The Brownies were a diminutive, long-lived species from Andowyne that defied most scientifc classifications. While they appeared magical, Brownies possessed little to no affinity for the Force, though they respected the supernatural and showed reverence for the fey folk with whom they shared the forests of Andowyne."},{"type":"paragraph","text":"As a species, Brownies tended to live in communities they referred to as kingdoms—a testament to their apparent inflated opinion of their place in the world—in small numbers, and appeared to be a predominantly male society as female Brownies went uncataloged along with the species' gender roles and reproductive systems."},{"type":"paragraph","text":"Despite their small stature, they were resourceful and extremely loyal, prostrating themselves before, and willing do to the bidding of Cherlindrea. Coupled with a tendency for pranks, however, the Brownies were considered to be pests and vermin by the planet's other species. Some Brownies were known to have kidnapped a Daikini baby."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"On April 1, 2006, StarWars.com updated its Databank with elements from the film Willow and its spin-off novels, indicating that they would be added to the Star Wars continuity. Elaborate databank entries were written which attempted to plausibly fit the material into the history of the Star Wars universe. However, two days later, it was revealed to be an April Fools' joke, and thus non-canon."},{"type":"paragraph","text":"In the film Willow, the Brownies were portrayed by Kevin Pollack and Rick Overton."},{"type":"paragraph","text":"The Patitite species from the Star Wars: The Clone Wars episode \"Nomad Droids\" were intended to be similar to the Brownies."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" The Shadow War Chronicles in the Databank","elements":[]},{"text":" Brownie in the Databank","elements":[]},{"text":" Elora Danan in the Databank","elements":[]},{"text":" Madmartigan in the Databank","elements":[]},{"text":" Thorn Drumheller in the Databank","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Kevin Pollack: Playing Small, But Thinking Big on Hyperspace","elements":[]},{"text":"Brownie in the Willow wiki","elements":[]}]}],"images":[]}]}