{"sections":[{"title":"Barabel","level":1,"content":[{"type":"paragraph","text":"Barabel were a species of sentient cold-blooded reptilians native to the dark, murky world Barab I. A highly aggressive and territorial species, Barabel who traveled off their homeworld often found work as fringers or soldiers."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Barabel were a bipedal race of reptilians who were covered in very tough dark colored scales. Evolved from nocturnal lizards, the Barabel adapted a thick layer of fat which allowed them to remain active and not sluggish when temperatures dropped. A blaster set on stun would not damage them at all or slow them down, as it would merely bounce off their scales. Barabel were able to shed their tails if necessary, an ability that proved the undoing of many startled foes. They also possessed heavy retractable claws along with needle sharp teeth which could grow to be 5 centimeters in length. A carnivorous species, Barabel possessed two stomachs in order to process the massive amount of food they required to survive."},{"type":"paragraph","text":"For breeding, Barabel devised a system in which the nest eggs of two females were fertilized by two males. Subsequently, the four individuals protected the nest. As fathers would end up not knowing which of the offspring were their own, Barabel younglings took the surname of their mothers."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130912222201\/starwars\/images\/thumb\/b\/bf\/Barabel-EotECR.jpg\/160px-Barabel-EotECR.jpg","caption":"A Barabel"}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Living in low tech communities ranging from a few dozen individuals to no more than ten thousand, the Barabel community would be built around a warren where the group thrived and hunted from. The Barabel species was noted for its hunting and tracking prowess. This was because many of their actions were fueled by their hunting instincts, leading to the general feeling that Barabel were always angry, or in the very least, ornery. They were well known for their aggression but were also extremely loyal to their mates and parents. They also had a great deal of respect for the Jedi, because of their first experiences with a Jedi Master who settled a dangerous clan dispute. Apologies, whether for a misdeed or in sympathy, were an unknown concept to Barabel. It was considered mildly insulting to a Barabel to be apologized to and apologizing tended to actually make a situation worse. This sometimes was disconcerting for members of other species, especially Humans, who were more ruled by emotions such as guilt or sympathy."},{"type":"paragraph","text":"Barabel had a native language, though they also expressed emotion—such as amusement or grief—by \"sissing.\" They were a communal race, with separate tribes on their homeworld numbering up to 10,000 individuals under the guidance of a pack leader. Unlike Humans, Barabel were much closer to the subconscious parts of their brains than other species. Lone Barabel tended to refer to themselves as \"this one\" instead of typical first person pronouns such as me or I. Some common Barabel names were Ragath, Vangar, Tesar, Saba, Zal and Zozoped."},{"type":"paragraph","text":"The Barabel had a rich mythology which resolved around a historic landing of a group of Jedi Knights early in their history. Worshiping the Jedi as gods, the Barabel mythology revered these 'warriors from beyond the clouds.' Among Barabel beliefs were a group of demons called the Blight of Barabel. Their names were often used as curses."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"According to Barabel legend, a small group of Jedi, led by the Ithorian Noga-ta, came to Barab I some centuries before the rise of the Galactic Empire. In Barabel culture, they called these Jedi great warriors from the sky. Noga-ta helped settle the Barabel War which had threatened to engulf their world in warfare. Consequently, the Barabel held Jedi in high esteem and would accept a Jedi's judgment in any dispute."},{"type":"paragraph","text":"After this contact with the Jedi, the Barabel had little contact with other species for centuries, though some had made their way off-world and had created a settlement on Abraxin circa 67 BBY. It wasn't until the rise of the Galactic Empire that Barab I received renewed attention. Planetary Safaris Inc. began organizing hunting trips to the Barabel homewell, with the quarry being the Barabel themselves. After a few Barabel were killed, a Barabel leader named Shaka-ka organized groups of her fellow hunters into armies which overwhelmed the safari ships. When an Imperial investigation led by Captain Osted Alater revealed that the Barabel were indeed sentient, the safaris were ended. Shaka-ka formed an alliance with Imperial Governor Paro Lanto and had the spaceport city of Alater-ka built in Alater's honor. Some Barabel began to travel offworld, working as mercenaries and bounty hunters. Some Barabel were captured by slavers, but more often than not, those who purchased and used Barabel would find themselves at the mercy of their new slave's claws."},{"type":"paragraph","text":"Later, during the days of the New Republic, several Barabel became part of the Jedi Order. The most prominent of these was Saba Sebatyne, who went on to earn a seat on the Jedi High Council and later served as interim Grand Master. The Barabel were nearly wiped out when Barab I was ravaged by the Yuuzhan Vong during their invasion of the galaxy. However, some Barabel escaped the widespread fires by retreating into Barab I's vast network of caverns."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060213195208\/starwars\/images\/thumb\/f\/fa\/Barabel01b.jpg\/180px-Barabel01b.jpg","caption":"A Barabel with a war hammer."}]},{"title":"Barabel in the galaxy","level":2,"content":[{"type":"paragraph","text":"While most Barabel remained on their homeworld during the reign of the Galactic Republic due to their relative obscurity and their dearth of available starships, some Barabel had managed to escape their world and reach the Republic. Officer Fivvic served in the Grand Army of the Republic during the Clone Wars, fighting alongside Jedi Generals whom he highly respected."},{"type":"paragraph","text":"Despite finding their way to some honorable positions, most Barabel became pirates or mercenaries. One famed Barabel bounty hunter active during the Galactic Civil War was Skahtul, who notably captured Luke Skywalker, a member of the Rebel Alliance. Concurrently, Tull Raine rose to widespread popularity as a shock boxer who held the championship title for the Outer Rim Territories for years."},{"type":"paragraph","text":"While Force-sensitive Barabel were not very common, a group of Forceful individuals that contained Barabel were active during the time of the New Republic. Under the command of Saba Sebatyne, these so-called Wild Knights rose to notoriety during the Yuuzhan Vong War and later became a strong part of the Jedi Order. Sebatyne would later ascend to a seat on the Jedi High Council and serve as interim Grand Master following the death of Jedi Master Kenth Hamner. Another notable Force-sensitive member of the species was Master Thared of the Imperial Knights who fought alongside Empress Marasiah Fel at the battle of the Floating World."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140211182042\/starwars\/images\/thumb\/c\/c5\/Dont_shoot_the_barabel.jpg\/180px-Dont_shoot_the_barabel.jpg","caption":"Barabels were physically powerful."}]}]}