{"sections":[{"title":"Buzchub","level":1,"content":[{"type":"paragraph","text":"The Buzchub were a species of stocky beings covered in dark blue fur. The sentients were believed to be native to Harrandarr, a remote planet in the Bosph sector. The Buzchub enjoyed traveling the galaxy, using mechanical translators to communicate with other species. Shortly after the Battle of Endor, the Buzchub Und'l worked for sympathizers of the Galactic Empire, although he believed his employers were simply spice shippers."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Buzchub were a sentient species covered in dark blue fur. They were stocky and had a wiry strength that was not immediately obvious. Each Buzchub had a round face with two round, lidded eyes; a stubby nose; and a broad mouth. Their vocal chords were physically incapable of speaking Galactic Basic Standard. The Buzchub had a waddling gait, and an individual could grow to 1.5 meters in height."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Buzchub were a relatively peaceful species. They had an affinity for Wookiees, considering them to be their \"long-haired brothers.\" While incapable of speaking Basic, they could understand it, and spacefaring Buzchub utilized mechanical translators that they wore around the neck in order to communicate in the language. Some Buzchub, such as Und'l, spoke with a peculiar rhythm, using short, paired phrases. Buzchub were not overly curious about other species or technology, but they thoroughly enjoyed traveling the galaxy."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Buzchub were believed to be native to Harrandarr, a planet in the remote Bosph sector of the Outer Rim Territories. In the period following the Battle of Endor of 4 ABY, the Buzchub Und'l traveled the galaxy. He began working for people he believed to be spice shippers, but who were in fact sympathizers of the Galactic Empire. For these employers, Und'l made contact with a group of smugglers on the planet Roldalna, arranging for them to ship spice from Nigel VI to Lohopa II in exchange for 25,000. In truth, the cargo was lexonite, a deadly poison used by Imperial terrorist groups."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Buzchub were created by Dave Marron for the mini-adventure The Package, included in Twin Stars of Kira, a collection of adventures published by West End Games in 1993. Und'l the Buzchub was illustrated by John Paul Lona. They were later mentioned in The Complete Star Wars Encyclopedia, published in 2008."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"The Package\"—Twin Stars of Kira","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}