{"sections":[{"title":"Bafforr tree","level":1,"content":[{"type":"paragraph","text":"The Bafforr trees, or simply Bafforrs, were crystalline plants native to Ithor. They had blue, glassy bark (which quickly blackened upon death) and black leaves. Though unintelligent on their own, groups of Bafforrs could communicate via intertwined root systems, becoming more intelligent. Seven Bafforrs could achieve a fully sentient collective consciousness, with whole Bafforr forests being wiser than any other being known to the Ithorians. Bafforrs communicated through a form of telepathy. Imported reeks' primary diet consisted of the Bafforr tree's leaves."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"When the forces of the Galactic Empire under Captain Alima arrived to subjugate Ithor, Alima ordered the bombardment of the Cathor Hills. This genocidal act wiped out a large Bafforr forest."},{"type":"paragraph","text":"Despite the death of their brother trees, the seven Bafforr trees which the Ithorian priest Momaw Nadon rescued and took with him on his exile on Tatooine continued to hold pacifist views. They forbade Nadon from taking revenge on Alima when their paths crossed again in Mos Eisley. It was only after Alima killed one of the Bafforrs, putting the small grove below the threshold of sentience, that Nadon was able to act against Alima."},{"type":"paragraph","text":"The Empire became aware of the Bafforrs' intelligence, but apparently remained ignorant of the nature of their collective consciousness. Imperial scientists tried to probe the secrets of individual Bafforrs, but they had no success gaining any knowledge from solitary, uprooted Bafforrs."},{"type":"paragraph","text":"During the Yuuzhan Vong War, Jacen Solo and Corran Horn discovered that the trees could be used against the vonduuncrab armor worn by the Yuuzhan Vong, as the crab was allergic to the pollen produced by the tree. This reaction would cause the vonduun crab to swell, killing the crab and any who were wearing it. Almost all of the Bafforrs were destroyed when the Yuuzhan Vong bombarded Ithor to eradicate this deadly weapon. The New Republic ensured the survival of the species, however, as they had already transferred saplings to other planets such as Borleias."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20101219053345\/starwars\/images\/thumb\/a\/a3\/Momaw_Nadon_%28Bafforr_trees%29.jpg\/200px-Momaw_Nadon_%28Bafforr_trees%29.jpg","caption":"Momaw Nadon cultivating Bafforr trees on Tatooine."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Coruscant Nights II: Street of Shadows","elements":[]},{"text":"The Sand Tender: The Hammerhead's Tale","elements":[]},{"text":"The Storm's Edge","elements":[]},{"text":"Star Wars Missions 7: Ithorian Invasion","elements":[]},{"text":"Galaxy of Fear: Spore","elements":[]},{"text":"Dark Apprentice","elements":[]},{"text":"Children of the Jedi","elements":[]},{"text":"The New Jedi Order: Dark Tide II: Ruin","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"The New Jedi Order: Force Heretic I: Remnant","elements":[]},{"text":"The New Jedi Order: The Final Prophecy","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"The Essential Guide to Planets and Moons","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":" \"I, Yuuzhan Vong\"—Star Wars Gamer 8","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"The New Jedi Order Sourcebook","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"Geonosis and the Outer Rim Worlds","elements":[]},{"text":"The New Essential Guide to Weapons and Technology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Official Star Wars Fact File 33","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" \"Welcome to the Star Wars Jungle,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}