{"sections":[{"title":"Assembler","level":1,"content":[{"type":"paragraph","text":"Assemblers were huge enigmatic arachnoids who lived in a large tube-like web floating in space. Their vacuum-resistant exoskeleton essentially allowed them to survive in such an environment. Each Assembler created Nodes—smaller arachnoid drones that lived to do the Assembler's bidding who were created from the primary intelligence's own neural tissue. Boba Fett discovered that Assemblers evolved from Nodes who killed their old master to take their place, sometimes through consumption of their creator. The only two Assemblers named in galactic history were Kud'ar Mub'at and Balancesheet, the masterminds who acted as a go-between for criminal organizations and potential employees."},{"type":"paragraph","text":"Assemblers absorbed all particles that floated by them that were not valuable, such as dust and space debris. No further information on the Assembler's biology, such as how they digest food, was known. They had four legs and two strange claws that acted as either hands or extra feet. In addition, Assemblers had strange furry appendages which grew on their backs, probably for absorbing food. Counting these, Assemblers had twelve appendages."},{"type":"paragraph","text":"These factors produced several psychological factors within the Assemblers as a species. One would be that they tended to be possessive creatures and would on occasion act as scavengers should anything be trapped in their web. These items would be used to enhance the Assemblers webs performance in someway. Another aspect of their behavior would be that an Assembler would often be jealous of its nodes and would actively try to limit their intelligence and prevent them from becoming sentient."},{"type":"paragraph","text":"Assemblers were connected to their webs by neurofibers, and the webs were connected to the Nodes in the same way. Kud'ar Mub'at had many Nodes to carry out day-to-day things. \"Lookout\" gazed through his single-lens eye to view the web's exterior, looking for problems and such. Calculator was much like a computer, interpreting data, and Identifier identified objects, ships, and people to see if they were valuable, dangerous, or not. Three nodes worked in Mu'bat's docking bay: Signaler guided ships in by waving his hands and with his glowing green eye, while Docker and Handler secured ships to the web with their tentacles. Listener heard sounds around the web with his tympanic membranes, and Balancesheet worked with Calculator to maintain Mu'bat's finances. It was Balancesheet that eventually rebelled against its creator, having reached the level of sentience where a node began to want to become the next Assembler. However, it was important for these nodes to remain useful to the primary Assembler as those that had no function would easily be re-ingested so that vital genetic information can be saved and reused for later use."},{"type":"paragraph","text":"Balancesheet appears, however, to have learned the lesson that his parent failed to learn fast enough, choosing to operate a freighter sold to him by Black Sun instead of relying on his own creations, which creates the risk of those creations revolting."},{"type":"paragraph","text":"An interesting facet of the species was that should an Assembler be killed but still possessed its body then it was possible to resurrect it. This required the application of a power to the web of the Assembler and the restoration of certain parts of the web to allow for memory to be 'remembered'. Boba Fett was able to do this with a pulsator and the Hound's Tooth around 4 ABY."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20120928013555\/starwars\/images\/thumb\/2\/2e\/Kud%27ar_Mub%27at.jpg\/180px-Kud%27ar_Mub%27at.jpg","caption":""}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Mandalorian Armor","elements":[]},{"text":"Slave Ship","elements":[]},{"text":"Hard Merchandise","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Kud'ar Mub'at in the Databank","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"The Bounty Hunter Code: From the Files of Boba Fett","elements":[]}]}],"images":[]}]}