{"sections":[{"title":"Aing-Tii","level":1,"content":[{"type":"paragraph","text":"The Aing-Tii were a secretive species of alien monks who hailed from a world within the Kathol Rift and resided near that area of space. Many members of the species were Force-sensitive; these were the only Aing-Tii who ever left their planet, traveling about the Rift in large, organic starships and using advanced weaponry to destroy those who opposed them. The Aing-Tii were very reclusive; they often used violence to dissuade outsiders from probing too far into their business, although a report based on a crashed Aing-Tii ship provided the galaxy with some details on their culture. Their belief system held that all events were not necessarily predetermined, but rather \"guided.\" Unlike the Jedi or Sith, the Aing-Tii held that the Force had neither a light nor a dark side, but was full of many colors, like a rainbow."},{"type":"paragraph","text":"The Aing-Tii monks only ever left their territories to attack slavers; they believed slavery to be a great evil and were relentless in their persecution of those who thrived from it. The Jedi Order learned of the Aing-Tii at some point, and several years before the Battle of Yavin, the Jedi Master Yoda sent a smuggler named Jorj Car'das to visit the monks so that he could be healed. Car'das spent many years with the Aing-Tii, and his reports on them eventually found their way into the archives of the New Jedi Order. Jacen Solo spent several years learning from the Aing-Tii after the Yuuzhan Vong War; his and Car'das's reports were compiled by Tionne Solusar and printed sometime after 130 ABY, though Solo kept much of what he had learned about the monks a secret. However, when Jedi Luke Skywalker and his son Ben visited the Aing-Tii in 43 ABY, they discovered many details about what Solo had learned and how it had caused his fall to the dark side."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Aing-Tii were a species of sentient, toothless mammals who stood about two meters tall on average. They stood erect on two clawed feet, and they had two spindly arms, each with three large digits. Their bodies were covered entirely in jointed protective coverings of white, bony plates, which extended up past their necks and onto their heads, where they acted and appeared like a protective helmet. The Aing-Tii head was small and jutted out perpendicularly from their chest. The head featured two large eyes and a series of long, thin tongues that extended around half a meter from their mouths. Each Aing-Tii had a long, prehensile tail that could be used in self-defense. The Aing-Tii each had a set of painted motifs covering their entire bodies, though the patterns were unique to each Aing-Tii. The species did not communicate through speech, as they were incapable of producing sound. Instead, they conveyed information via tasting, smelling and touching each other with their six long, thin green tongues."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20080213204017\/starwars\/images\/thumb\/e\/ee\/Aing-TiiKO.jpg\/250px-Aing-TiiKO.jpg","caption":"A group of Aing-Tii."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Aing-Tii were native to a planet whose location in the Kathol Rift was a closely guarded secret. The rift itself was a dangerous area of space, although by the time of the Galactic Empire they had developed space travel and many had taken to living in their semi-organic starships. The majority of Aing-Tii never left their homeworld nor had any contact with members of other sentient species. Those who did—commonly called Aing-Tii warrior monks—were highly xenophobic and reclusive, attacking any who tried to learn more about them. Although most aspects of Aing-Tii culture were not known to the wider galaxy, it was documented that all Aing-Tii seen offworld were Force-sensitive. They believed that their Force talents were gifts from their deities, \"Those Who Dwell Beyond the Veil,\" although they generally preferred not to use the Force when they could avoid it. They saw the Force as sacred, something that was not to be meddled with. The monks spent their entire lives performing errands for their gods, traveling through the dangerous Kathol Rift—which they also viewed as a holy place—and performing pilgrimages in the hope that they would receive \"an answer\" from them."},{"type":"paragraph","text":"The monks did make occasional use of the Force, mostly to fuel their cavernous ships. The Aing-Tii had a different view of the Force from that of other Force-users: they believed that even one who was not Force-sensitive could manipulate the energy field to do his or her bidding. Although Aing-Tii avoided using these \"gifts,\" the monks could instantaneously move an object—ranging in size from small items to 300-meter-long ships—from one location to another, an ability not mastered by even the most powerful of Jedi or Sith. They were also able to teach this power to non-Force-sensitives. The Aing-Tii believed that, while life was not predetermined, everything was somehow guided by the Force. Unlike the Jedi and Sith, the warrior monks did not believe in the light or dark sides of the Force. Instead, they held that there were many different aspects to the Force."},{"type":"paragraph","text":"The monks were able to use myriad other Force powers, one of which was known as flow-walking. Skilled practitioners of the technique could surrender their emotions to the Force and center themselves in its flow, thus transcending time itself. An Aing-Tii could therefore use flow-walking to observe events in the past or future, so long as the monk knew the location at which the event had occurred or eventually would occur. By allowing their senses of detachment to fade, and letting their emotional selves return, however, practitioners could impose themselves upon the passage of time and begin to influence and change the course of events. Such alteration was only possible to an extent; the Force itself was unable to be substantially altered and would ensure that events continued as they were pre-destined to do so. With its manipulation of the fabric of time, flow-walking was a complex, esoteric ability, and it remained a little-known secret among the Aing-Tii."},{"type":"paragraph","text":"The Aing-Tii held a deep hatred of slavery, and they often attacked slavers who roamed the Kathol Outback. Due to the sheer power of their technology, the Aing-Tii traveled in groups of three to five ships, ramming vessels laden with slaves and destroying slaver ships that were free of slaves at the time. Few outsiders realized what was behind such attacks, thinking them simply random, although those who had dealings with the Aing-Tii learned quickly of this hatred. Although Aing-Tii were quick to respond to pleas from residents of the Kathol Outback, the species kept to themselves and discouraged any attempts by others to pry into their business. They did allow a small amount of information about themselves to surface, though only to scare off any who would seek to learn more."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090521191417\/starwars\/images\/thumb\/6\/6f\/Aing-tii_master.jpg\/250px-Aing-tii_master.jpg","caption":"An Aing-Tii master of the Force."}]},{"title":"Technology","level":3,"content":[{"type":"paragraph","text":"The Aing-Tii developed a form of semi-organic technology early in their history, using it to build massive, 100-being ships. These vessels, named Sanhedrim ships, over 300 meters long, were used by Aing-Tii warriors to embark on pilgrimages in the Kathol Rift, to attack slavers, and to respond to distress calls sent by the people of the Kathol Outback. Each Sanhedrim was unique, with numerous symbols painted on the hull and dozens of conical exhaust ports and thruster pods jutting out at random places. Each Sanhedrim was roughly ovoid in shape and covered in thick hull plates, not unlike the imbricated hides of an Aing-Tii themselves. Sanhedrims had weaponry that, in comparison to that used by the Galactic Republic and Galactic Empire, were extremely advanced and deadly. Over 60 gunners on each ship used energy web generators and null-burst projectors to destroy enemy ships with ease, although the Aing-Tii often rammed other vessels instead. The monks used non-deadly weapons to dissuade those who had taken an interest in them; the mysterious weapons altered the victim's perception of time, allowing the Aing-Tii to escape to their home territory. Aing-Tii ships usually traveled in groups of three or four, although it was not uncommon for a ship to wander by itself. The Sanhedrims were also able to evade being picked up by other ships' sensors."},{"type":"paragraph","text":"The Aing-Tii were reported to have a sort of symbiotic connection with the ships they served on. The Aing-Tii developed a method of moving from one destination to another, which was barely comprehensible to anyone but the monks. They used the Force in conjunction with their unique technology to instantaneously move their ship through space. It was this technology, combined with their natural ability as navigators, that allowed them to travel through the dangerous Kathol Rift unhindered."},{"type":"paragraph","text":"Another piece of Aing-Tii technology was the Vor'cha stun stick. These appeared to be wooden sticks wrapped in some kind of wire that could deliver a powerful energy charge, rendering a victim unconscious. The Vor'cha were able to penetrate armor and electrocute a victim regardless of what he or she was wearing."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20080306221355\/starwars\/images\/thumb\/1\/14\/Aing-TiiSanhedrim.jpg\/250px-Aing-TiiSanhedrim.jpg","caption":"An Aing-Tii Sanhedrim ship."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The galaxy knew very little of the Aing-Tii's early history, and for centuries their existence was known only to a select few who had seen them in the flesh. The species' reclusive nature meant that they rarely interacted with the other inhabitants of the Rift, and then only to banish slavers or answer pleas for help. Their rumored powers piqued the curiosity of spacers, who made several attempts to learn more about the monks. One group managed to sneak a micro-espionage droid onto an Aing-Tii ship during the time of the Galactic Republic; this provided the rest of the galaxy with its first images of the reclusive species. This attempt was eventually halted by the monks, although around the same period an Aing-Tii vessel crashed on a remote world and provided the denizens of the Kathol Sector with much information on the species and their technology. Nevertheless, knowledge of the monks was always scarce."},{"type":"paragraph","text":"The Jedi Order had learned of the Aing-Tii by the time of the Ruusan Reformation and the species received an entry in the Jedi training manual The Jedi Path, although the Aing-Tii themselves were indifferent towards Jedi. Some time before the Battle of Yavin, the Jedi Master Yoda sent Jorj Car'das, a former smuggler whose health was deteriorating, to the monks so that he could be healed. The Aing-Tii agreed to heal Car'das, though only on the condition that he spend his life learning of their ways. Although Car'das was not Force-sensitive, he learned of their abilities and studied under them for decades. They eventually allowed him to leave and live out his life on Exocron."},{"type":"paragraph","text":"At some point, the Aing-Tii began searching for the Codex, a pyramidal construct made of ancient DarkStryder technology. They saw the Codex as sacred, and their culture dictated that an Aing-Tii could not physically touch the item, which could enhance one's ability to use the Force. They believed it was a remnant from \"Those Who Dwell Beyond The Veil,\" and that it granted the ability to contact the mysterious beings. Desperate to get their hands on it, the monks kidnapped a Human named Makezh around 7 ABY and reprogrammed him, subconsciously teaching him to locate and retrieve the Codex, as he was not bound by their customs. The Aing-Tii had a limited knowledge of the Human psyche, and Makezh suffered from a state of mild insanity, and the near eradication of his memories as a result of the brainwashing."},{"type":"paragraph","text":"Makezh joined the crew of the New Republic vessel FarStar at Danoor; they required a navigator to traverse the Kathol Rift as they were tracking a rogue Imperial Moff named Kentor Sarne. Before the vessel could enter the Rift, however, they were engaged by an Imperial II-class Star Destroyer and a CR90 corvette named the Lialic II. During the battle, an Aing-Tii Sanhedrim ship assisted the FarStar in defeating the Imperial force."},{"type":"paragraph","text":"During the FarStar's trip through the Rift, they encountered an alien construct. A mission group went aboard, and while searching the construct, they discovered the Codex, although they were not aware of its purpose or significance to the Aing-Tii. Makezh, aware of the Codex's presence, was compelled by his programming to steal it, and he absconded from the ship over the planet Demonsgate, traveling to the surface to present it to the Aing-Tii. Nevertheless, Makezh was pursued by Imperial stormtroopers and bounty hunters, forcing the Aing-Tii into a confrontation wherein they used their Vor'cha to incapacitate the soldiers. The Aing-Tii eventually took the device for themselves; rather than repaying Makezh for all he had gone through to get the Codex for them, they took him, along with many of the unconscious Imperials, onto their ships to study. The Aing-Tii were later involved in the Battle of Kathol System, an engagement between the FarStar and her allies against Moff Sarne's Imperial forces. Some reports claim that the Aing-Tii were responsible for the destruction of the FarStar during the battle, but the New Republic attempted to keep the ship's mission secret, and details on it were kept quiet."},{"type":"paragraph","text":"Around the same time, an elderly female Bith trader named Maddie Macatten put great effort into tracking down the Aing-Tii and discovering their homeworld. The monks had previously freed her from slavers, and she wished to find them and thank her rescuers face-to-face. Macatten discovered a large amount of accurate information on the monks, although she was extremely old and most considered her insane, shrouding her findings in questions about their accuracy. The Aing-Tii also made an enemy during this period: the government of Sapella held a grudge against the monks after one of the Aing-Tii Sanhedrim collided with and destroyed one of their defense vessels. It was in actuality an accident, although the people of Sapella claimed that the Aing-Tii had attacked them on purpose."},{"type":"paragraph","text":"Jorj Car'das, the smuggler whose life the Aing-Tii had saved, kept in contact with his former hosts and occasionally called in favors from them. In 19 ABY, the Aing-Tii attacked a fleet of slavers commanded by a Rodian named Rei'Kas, who had assaulted Exocron. The monks destroyed the slavers at Car'das's request and transported his ally Talon Karrde to Bastion on one of the monks' rare journeys away from the Kathol Outback. Car'das later bade the Aing-Tii use their ships to transport him when he completed various errands. The Aing-Tii ships would later be compared to those of the extra-galactic Yuuzhan Vong after their assault on Obroa-skai in 25 ABY."},{"type":"paragraph","text":"After the end of the Yuuzhan Vong War in 29 ABY, the Jedi Knight Jacen Solo journeyed to the Kathol Rift to study with the Aing-Tii monks. He learned much from them. By the time of his departure the monks had come to view Solo as a flawed student, but they did impart to him the knowledge of flow-walking, guiding and instructing the traveling Jedi Knight in the use of the intricate ability. When Solo returned to the New Jedi Order, he made a report based on his findings, which, along with an essay on the monks written by Talon Karrde, was published by Tionne Solusar in her guide to the Force. Solo, however, kept much of what he had learned from the monks secret from his fellow Jedi, and Karrde had learned little from Car'das, so the Aing-Tii remained largely unknown to the wider galaxy."},{"type":"paragraph","text":"In 43.5 ABY Luke Skywalker and his son Ben traveled to the Kathol Rift, hoping to learn more about what caused Jacen Solo's fall to the dark side. They arrived on the Aing-Tii homeworld and were met by Tadar'Ro, the monks' liaison. Over the next few days the Skywalkers were taught the arts of flow-walking and Force teleportation. They were also brought into the Embrace, a series of caves and caverns below the planet surface where the Aing-Tii kept sacred objects, which they called relics. Luke was allowed to touch the object known as the Codex, which he hoped would grant him some sort of revelation. While the relic held no answers for him, Luke did sense a mass of dark energy that he believed originated from The Maw. Their visit proved inconclusive, so the two Skywalkers left the planet soon thereafter."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080306221416\/starwars\/images\/thumb\/9\/90\/Aing-Tii_vs._Empire.jpg\/220px-Aing-Tii_vs._Empire.jpg","caption":"The Aing-Tii battling Imperial forces on Demonsgate."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Aing-Tii were created for The DarkStryder Campaign, a West End Games Star Wars: The Roleplaying Game adventure series released in 1995. In the supplement, gamemasters are encouraged to feature the Aing-Tii as either enemies or allies, and they play a recurring role in the campaign's storyline. Timothy Zahn, who was involved in the DarkStryder Campaign, reused them in his novel Vision of the Future in 1998, providing them with their first non-game appearance. Since Vision of the Future, the Aing-Tii have been mentioned in a number of sources, including James Luceno's The New Jedi Order: Agents of Chaos I: Hero's Trial, Troy Denning's Dark Nest I: The Joiner King, the Legacy of the Force series, and Jedi vs. Sith: The Essential Guide to the Force. They are featured heavily in the second Fate of the Jedi novel, Omen."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"Galaxy's Edge\"—The Kathol Outback","elements":[]},{"text":" \"Waystation\"—The Kathol Rift","elements":[]},{"text":" \"Showdown\"—The Kathol Rift","elements":[]},{"text":"Vision of the Future","elements":[]},{"text":"The New Jedi Order: Agents of Chaos I: Hero's Trial","elements":[]},{"text":"Dark Nest I: The Joiner King","elements":[]},{"text":"Legacy of the Force: Bloodlines","elements":[]},{"text":"Legacy of the Force: Tempest","elements":[]},{"text":"Legacy of the Force: Invincible","elements":[]},{"text":"Fate of the Jedi: Omen","elements":[]},{"text":"Fate of the Jedi: Abyss","elements":[]},{"text":"Fate of the Jedi: Allies","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Kathol Outback","elements":[]},{"text":"The Kathol Rift","elements":[]},{"text":"Endgame","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"Jedi vs. Sith: The Essential Guide to the Force","elements":[]},{"text":"Scum and Villainy","elements":[]},{"text":" The Complete Star Wars Encyclopedia Spreads on StarWars.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Jedi Academy Training Manual","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force","elements":[]},{"text":"Book of Sith: Secrets from the Dark Side","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" \"The Imperial Warlords: Despoilers of an Empire, Part 1,\" The Official Star Wars Blog","elements":[]},{"text":" \"The Imperial Warlords: Despoilers of an Empire, Part 3,\" The Official Star Wars Blog","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" Terror From Beyond the Rim on StarWars.com","elements":[]}]}],"images":[]}]}