{"sections":[{"title":"Aaris","level":1,"content":[{"type":"paragraph","text":"The Aaris were one-meter-tall reptilian sentients native to the planet Aaris III in the Kathol sector of the Outer Rim Territories. Thousands of years prior to the Galactic Civil War, the Aaris built an industrial society across their homeworld, raising large cities. They had a strong tradition of oral communication, to the extent of developing a unique method of recording their knowledge. Although a peaceful race, the Aaris tore their society apart in a civil war, a conflict perpetrated by the arrival of the Plaque of Victory on their planet. The Plaque was a sentient lifeform—although it was inanimate and held within a metal ingot—that sought to influence the minds of other beings into doing its bidding. The Plaque caused the Aaris people to become violent and homicidal, turning factions against one another as they all sought to gain possession of the artifact. Eventually, the Aaris fell into decline, and their cities became ruins reclaimed by the jungle. By 8 ABY, the primitive descendants of the Aaris lived in warrens tunneled through the ruins of their former cities."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Aaris were a species of reptilian humanoids covered in warts, who generally stood one meter tall."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Aaris were a relatively peaceful race who had knowledge of governmental structures, as well as formal learning systems; as such, they developed some scholars. They also maintained professional soldiers, organized into both city guard companies and legions."},{"type":"paragraph","text":"The Aaris language was tonal in nature, utilizing beeps, rumbles, notes, and chirps to convey meaning. Because of this, the Aaris had a strong tradition of oral history and did not develop a true written language. Instead, they developed a form of oral recording that served a similar purpose. The Aaris created bas-relief pictographs that, when pressed, emitted sounds emulating their language. They used these to record their history and to store knowledge."},{"type":"paragraph","text":"By 8 ABY, the Aaris had fallen into decline, having torn their society apart in a civil war. Their descendants inhabited the ruins of their cities, living in warrens burrowed through soil and rock. These Aaris were primitive compared to their ancestors, wielding crudely made weapons and defending their territory against outside invasion."},{"type":"paragraph","text":"The Aaris were not known to the galactic community. No records of a civilization on the planet existed before the Imperial science team MS-133 conducted an archaeological expedition to the planet in 8 ABY and began translating the records that the Aaris had left behind."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Aaris civilization reached its height several thousand years before the Galactic Civil War. Based on the planet Aaris III in the Kathol sector, the Aaris established an industrial society that resulted in the construction of cities across the face of the planet. Although generally peaceful, they did engage in occasional wars between one another."},{"type":"paragraph","text":"One night, a comet streaked through Aaris III's skies. Several days later, a military legion from an outpost entered one of the Aaris's cities with an artifact—a triangular metal ingot they called the \"Plaque of Victory.\" Unknown to the Aaris was the fact that the inanimate artifact was actually a sentient lifeform which fed off the life-force of organic beings. The Plaque's goal was to destroy those around it, but not by any action of its own; instead, the Plaque manipulated the feelings of individuals, causing them to act in paranoid, irrational, and homicidal ways."},{"type":"paragraph","text":"Six days after the arrival of the artifact in the city, civil unrest had increased, with a rise in violent crimes which often resulted in the death of the victim. The situation quickly escalated, as more citizens began to become involved in violent acts, including street gangs and even units of the city guard. Each faction had one thing in common—they claimed that the Plaque of Victory had spoken to them, and each claimed to be its appointed guardian. One faction, who had access to the relic, removed it from its place in the gushaz and took it to a tower in the city's governmental complex, which rose high above the city. There, it was given over to Kastays, a noted scholar, with the hope that if the artifact was high above the population, its effects would be diminished. To safeguard it, Kastays hid it in a floor vault. The plan failed, however, and the Aaris civilization descended into civil war and anarchy, all but destroying itself in the process. Kastays recorded the events using the Aaris's bas-relief pictographs, calling it \"the last days.\""},{"type":"paragraph","text":"Despite the fall of their society, the Aaris continued to live on. As the Aaris cities fell into disrepair, the jungle covered the extensive structures, hiding most of the ruins from general view. The primitive descendants of the survivors made their home in the lower levels of the ruins, tunneling large warrens throughout the rock and soil that surrounded them. Fashioning crude weapons, they vigorously defended their homes from all invaders."},{"type":"paragraph","text":"In 8 ABY, the Plaque of Victory was discovered in its hiding place by Imperial science team MS-133, who were conducting an archaeological expedition on Aaris III. The Plaque once again asserted its influence, causing the members of the team to experience feelings of paranoia and heightened aggression. The remnants of the Aaris then attacked MS-133, killing the majority of its personnel."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090222022751\/starwars\/images\/thumb\/7\/7b\/Plaque_of_Victory.jpg\/180px-Plaque_of_Victory.jpg","caption":"The Plaque of Victory"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Aaris were created for the roleplaying adventure Artifact of Aaris, which was published in The DarkStryder Campaign by West End Games. The Aaris were not encountered directly in the scenario, as their society had fallen into ruin during the time period in which it was set, although an adventure hook for further missions on their homeworld, Aaris III, provided a way to meet their primitive descendants."},{"type":"paragraph","text":"While the adventure implies that MS-133 began turning on one another under the influence of the Plaque of Victory, The Complete Star Wars Encyclopedia—published in 2008—confirmed that the team came under attack from the remnants of the Aaris civilization."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"Artifact of Aaris\"—The DarkStryder Campaign","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The DarkStryder Campaign","elements":[]},{"text":"The DarkStryder Campaign, Deluxe","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}