{"sections":[{"title":"Aefan","level":1,"content":[{"type":"paragraph","text":"The Aefans were a sentient species of small, orange-skinned, humanoids who were native to the planet Aefao, in the Outer Rim Territories. Their homeworld was contested during the Clone Wars, and later during the Imperial Period, the Aefan's homeworld was visited by several t'landa Til, vassals of the Hutt Besadii crime family. Many Aefans were exposed to the t'landa Til's Exultation, a biological phenomenon that induced rapturous feeling; consequently, over a hundred Aefans followed the t'landa Til to their colony on the planet Ylesia. Visiting Human smuggler, Han Solo, managed to convince several Aefans not to follow the offworlders."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Aefans were a sentient species. They were humanoid in form—having two arms and two legs—and were considered small in size by the Human Han Solo. The Aefans had orange skin and were physically susceptible to the Exultation, in which members of the t'landa Til species used their physiology to create a resonance frequency that stimulated the brain's pleasure centers. The Aefans could hear and understand language."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Aefans were native to Aefao, a remote planet located in the Corosi sector of the Outer Rim Territories. The region of space surrounding their homeworld was explored by the Galactic Republic between 3000 BBY to 1000 BBY."},{"type":"paragraph","text":"During the Clone Wars of 22 BBY to 19 BBY, Aefao remained within Republic territory, although it was the site of several battles against the Republic's enemy, the Confederacy of Independent Systems. The Republic battled Separatist forces commanded by Major Hoom Garaf in the Third Battle of Aefao. The battle was won by the Republic after the Chevin commander was executed by his tactical droid, sparking chaos in the Separatist's rear guard."},{"type":"paragraph","text":"Once, prior to 2 BBY, Aefan was visited by members of the t'landa Til species, aligned with the Hutt Besadii crime family. The t'landa Til performed the Exultation, stimulating the brains of many Aefans. Over a hundred Aefans, still enraptured by the sensation, chose to accompany the t'landa Til to the planet Ylesia as \"pilgrims\" for the Cult of The One and The All, an ostensible religious organization. In actuality, the pilgrims were used by the t'landa Til to process the addictive spice glitterstim, which was later sold to profit the kajidic. Han Solo, a Human smuggler formerly linked with the Ylesian operation, was present on Aefao at the time and managed to persuade a few of the Aefans not to travel with the t'landa Til."},{"type":"paragraph","text":"Under the Galactic Empire, the Aefans' homeworld was part of Oversector Outer, and it remained part of various Imperial polities until at least 17 ABY."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20121009050204\/starwars\/images\/thumb\/6\/6f\/Exultation-ERC.jpg\/180px-Exultation-ERC.jpg","caption":"An Exultation ceremony, pictured, duped many Aefans into traveling to Ylesia."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"A. C. Crispin created the Aefans for her novel Rebel Dawn, published by Bantam Spectra in 1998. The species later received an entry in The Complete Star Wars Encyclopedia, published in 2008, and their homeworld was mentioned in The Essential Guide to Warfare, published in 2012."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Rebel Dawn","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]}]}],"images":[]}]}