{"sections":[{"title":"Adnerem","level":1,"content":[{"type":"paragraph","text":"The Adnerem were a tall, thin, humanoid species of mammal native to the pleasure planet of Adner in the Yataga sector of the Expansion Region. Descended from scavenger-hunters, they had large triangular heads with wide eyes and a large lump in the center of the forehead called an echo chamber. Their thin arms each ended in four talons with no opposable thumb. Adnerem society was based on small, non-genetic social units known as steri, the singular of which was steris, who dwelt together in steri-houses. The members of a steris were known as sterisi, and individual couples who formed a close friendship within a steris were known as a sterika. An Adnerem's status was judged entirely by the status of his or her steris, and different steri sometimes battled for balance of power in a conflict known as a raid-war."},{"type":"paragraph","text":"As a species, Adnerem were generally antisocial and remained independent from the rest of the galaxy's economy, although their homeworld was a tourist trap with many theme parks and casinos. During the Galactic Civil War, the largest of these casinos, the Red Lisken, was run by an Adnerem named Etsero, who had ties to the gangster Jabba the Hutt and to various Imperial sympathizers. Those Adnerem who left Adner often remained together in their steris and found group occupations. Steri away from their homeworld usually worked as management in large corporations, criminal organizations, or mercenary agencies, such as the Interstellar Strike Force."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Adnerem were a species of tall, slender, omnivorousmammal who normally stood between 1.8 and 2.2 meters tall. Originally descended from a scavenger-hunter precursor species, they were humanoid with many features in common with the Human species, such as a bipedal gait, upright posture, and two different sexes. While they had a mouth and a nose similar to those of Humans, they had distinctive triangle-shaped heads with no ears, a narrow face and a wide brain pan, which supported a large lump on top of their skull. The lump was a firm, hollow echo chamber, which functioned as an ear for the species, although Humans often mistkook it for a tumor. An Adnerem's skin was wrinkled in texture, dark gray in color and completely hairless across their entire body, except for a single small vestigial patch of hair at the back of the skull."},{"type":"paragraph","text":"The species possessed only four fingers on each of their hands, lacking an opposable thumb. The nails on each finger could grow incredibly long and sturdy. Adnerem's eyelids evolved to be narrow to protect their pair of eyes—which were usually light colors such as blue or green—against the twin suns of their homeworld of Adner, in the Yataga sector of the Expansion Region."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Adnerem culture was based upon that of their ancient scavenger-hunter ancestors, who were semi-social and banded together in tribes that ranged in size from five to twenty individuals. The Adnerem themselves upheld the same group culture with a society based around socioeconomic social units of five to one hundred individuals, with the groups traditionally consisting of sixty-four adults whom were not necessarily related to one another genetically. These groups were known as steris individually, with the plural being steri and those within a steris known as its sterisi. The members of a steris lived together in a steri-house, which normally took the form of a one or two floored disc-shaped building designed to evenly spread heat. Maintenance and housekeeping duties were shared amongst the sterisi, or another steris was employed to carry them out if the steri-house owners were wealthy enough. The building was divided into two areas, public and private, with individuals known to the steris allowed in the public section but none except the sterisi allowed in the private rooms."},{"type":"paragraph","text":"Adnerem were born into a steris and raised by caregiving sterisi—not necessarily their parents—within the steri-house until the age of six years old. At that point, the child was transferred into an education-steris to be broadly educated and assessed until the age of fourteen. At that point, the child chose an initial vocation. The next ten years of an Adnerem's life were spent training in the chosen occupation and paying back the steris for costs incurred during child-rearing. At the age of twenty-four, an Adnerem ceremonially left the steris and chose which steris to join as an adult. Most steri offered special incentives for their own sterisi to rejoin them, which resulted in roughly half of all Adnerem remaining with the steris they had been born into. Once the decision had been made, it was rare for an Adnerem to leave the chosen steris due to the fact that such a departure resulted in a forfeit of all assets associated with the abandoned steris and carried a slight stigma—although leaving was still seen as socially acceptable. Only Adnerem who had been promised far greater opportunity or status in another steris ever considered such a change."},{"type":"paragraph","text":"The Adnerem devoutly followed a system of systematic pragmatism such that any Adnerem who wished to increase his or her position did so by improving his or her steris. That endeavor was mainly accomplished by increasing the steris's influence and wealth, usually through trade with other steri. Most Adnerem worked hard at this task, although usually out of self-interest. Larger steri sometimes had smaller steri as clients whom they paid to gather resources for them, a position that the more powerful steri rarely abused. A less common way for steris's status to change was for them to engage in raid-wars. These were small conflicts between two or more steri, the goal of which was to weaken the enemy and so lower their status. Powerful steri engaged in such activities if they and another steris had conflicting goals, and smaller steri looking to make a name for themselves or to rise up against a powerful steris abusing its power might band together and engage in the conflicts. The battles were almost always short-lived and small in scale, with the objective never being total annihilation of the enemy, due to the fact that a weakened steris might prove useful later as an ally to the victor."},{"type":"paragraph","text":"Due to the steris system, the species had no social classes or social discrimination against either gender, and each individual was judged purely based on the status of the steris and his or her earned status within it. Adnerem therefore had particular difficulty understanding the concept of ranks and social positions used by other species. Despite this handicap, particularly wealthy Adnerem grew their nails to an extremely long length to show that they need not work. Female Adnerem often differentiated themselves from the males by growing their single patch of hair long and braiding it. The species generally wore clothing typical of many other humanoid species throughout the galaxy, particularly robes."},{"type":"paragraph","text":"Although all personality types were found amongst the Adnerem, most were cool, collected and patient, and so appeared calm and dispassionate in nature. However, internally they were far more intense but simply did not show it. As a race they were also, in general, asocial and introverted, choosing to spend the majority of their spare time on their own or occasionally in very small groups of five or less. In larger groups, it was rare for any to speak, making public areas on their homeworld almost totally silent. On the other hand, two Adnerem alone could become as active and talkative as a group of ten individuals of another species. Occasionally, a pair within the same steris formed an incredibly close friendship known as a sterika. Sterika were non-sexual in nature, but the two individuals became so close that they considered themselves one entity. The reason for such pairings was unknown to the galaxy at large, although they usually occurred spontaneously after a period of stress for one or both of the Adnerem. Sterika were not sought out by Adnerem as other species sought love; however, Adnerem not in a sterika sometimes seemed to envy those who were. In total, only about ten percent of the Adnerem population at any one time was in a sterika; apart from such pairings, it was rare for Adnerem to become emotionally attached or form a strong bond with other individuals, whether of their own species or others. Such social distancing often led others to see Adnerem as remote and manipulative."},{"type":"paragraph","text":"Long-term immersion in galactic society eventually resulted in Adner's technology level catching up with the galactic standard. The Adnerem kept themselves separate from the galactic economy and remained financially isolated, investing heavily in remaining self-sufficient and independent from any kind of imports or investments offworld, with only specialty goods and information being imported in large quantities. The species' main income came from the entertainment industry they maintained on Adner, as well as a number of other planets that consisted primarily of pleasure and gambling establishments. For over two thousand years, the casinos on Adner were incredibly popular with offworld tourists, with hundreds of thousands flocking to the planet solely to visit them each year. The casinos, run by some of the most powerful steri, became adept at catering to the large number of visitors' needs, and employed mainly highly trained non-Adnerem as workers."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130112175222\/starwars\/images\/thumb\/6\/62\/Adnerem_in_Bar.jpg\/140px-Adnerem_in_Bar.jpg","caption":"An Adnerem in a drinking establishment"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Adnerem evolved from a species of primitive scavenger-hunters on the planet of Adner. Their ancestors originally lived in small tribes of five to twenty individuals. As the Adnerem developed socially, they remained highly group-oriented, and their groups became social units known as steri. Outsiders first reached the area of space where Adner was located between 8000 BBY and 5500 BBY. Members of the Duros species were the first to encounter the Adnerem on Adner. Nevertheless, offworld contact had little effect on their culture except for slowly introducing new technology. Adnerem culture kept the same steris-based system, and major historical events on Adner continued to be simple power shifts between different steri."}],"images":[]},{"title":"Adnerem in the galaxy","level":2,"content":[{"type":"paragraph","text":"Adnerem generally preferred to remain at home on Adner and compete amongst themselves rather than the rest of the galaxy. Many Adnerem worked in the management of the casinos on Adner. One such individual was Etsero, who lived during the reign of both the Galactic Empire and New Republic. Etsero ran a casino named the Red Lisken, which was one of the largest establishments on Adner. He came to be indebted to Jabba Desilijic Tiure, a powerful Hutt crime lord who ran his illicit empire from the planet of Tatooine. After the Hutt's death at the Battle of the Great Pit of Carkoon, in 4 ABY, the debt shifted to a separate party, who had Imperial loyalties. The situation led to the Adnerem being included on a document called \"Wanted by Cracken,\" a list of wanted criminals and Imperials sought by Airen Cracken, a general in the New Republic. Etsero was a known associate of fellow criminal, the Human Theol Dunoche, who rescued two Twi'lek women from slavery on the planet Ryloth and brought them to work at Etsero's casino on Adner."},{"type":"paragraph","text":"Adnerem who left their homeworld almost always did so with other members of their steris. Some steri took up interstellar trading, running individual large cargo ships or fleets of smaller craft. A small number of steri hired themselves out to large galactic corporations as management teams on projects of small or medium size."},{"type":"paragraph","text":"One steris that left Adner set itself up as a mercenary company known as the Interstellar Strike Force. The steris acted as the command and control, while highly trained non-Adnerem were hired to act as the special operation units. Another Adnerem at large became a mercenary; the Adnerem made the acquaintance of Bitthævrian Colonel Quaal Tavier Catharius and joined the m'Yalfor'ac Order—an anti-Republic military order on the planet Guiteica—that Tavier led. The mercenary became part of a four-person leading committee for the order, as well as one of only two non-Bitthævrians in the organization."},{"type":"paragraph","text":"Some steri turned their business skills to crime and operated small-scale criminal organizations, rarely larger in size than a few star systems. Such Adnerem criminals performed business quietly and eliminated threats and obstacles so as to draw as little attention as possible, often maximizing profit by having a broad range of small, easily hidable incomes instead of making big, risky attempts at a single large pay off, such as a bank robbery. One such Adnerem ended up on the planet Tresidiss, a haven for criminals that was privately owned by Herglic criminals who ran a large number of gambling establishments there and tolerated the illegal activities openly performed by the criminals who frequented the world."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20071110225936\/starwars\/images\/thumb\/2\/29\/Etsero.jpg\/140px-Etsero.jpg","caption":"Etsero, a wealthy Adnerem casino owner"},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20061215230910\/starwars\/images\/thumb\/a\/a6\/Adnerem_GG11.jpg\/180px-Adnerem_GG11.jpg","caption":"An Adnerem on the planet Tresidiss"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Adnerem first appeared as a species in Wanted by Cracken, a sourcebook written by Louis J. Prosperi, which was released by West End Games in 1993 for their Star Wars roleplaying game. The book contained a list of individuals to act as opponents for player characters in the game, including Etsero, an Adnerem, although the book gave no details about his species apart from their homeworld. The image used for Etsero was concept art drawn by artist Nilo Rodis-Jamero for the character Bib Fortuna in Star Wars: Episode VI Return of the Jedi. However, the design was not selected for use in the film. The same sketch had previously appeared in the 1983 concept art book The Art of Star Wars Episode VI: Return of the Jedi."},{"type":"paragraph","text":"It also appeared in the 1993 book Monsters and Aliens from George Lucas, written by Bob Carrau, alongside another Rodis-Jamero Bib Fortuna concept sketch. The images accompanied a holiday newsletter from a family named the Lingsnots, in which they detailed the activities of the three Lingsnot children, Ussto, Miiliki-spoorr and Ciption, over the past year. The aliens were never identified as Adnerem, and nothing in the letter referenced Adnerem culture—for example, the Lingsnots were a \"family\" instead of a \"steris.\" Material from Monsters and Aliens from George Lucas is considered non-canon unless such material is referenced in later publications. The image of the second Lingsnot character was used in the book The Illustrated Star Wars Universe to represent a character named Po Ruddle Lingsnot, but his surname was the only link to the holiday letter, leaving the family's canonical status unclear."},{"type":"paragraph","text":"Another Adnerem, drawn by Mike Vilardi and based on the Bib Fortuna concept art used for Etsero, was pictured in the 1994 West End Games sourcebook Galaxy Guide 11: Criminal Organizations. Another West End roleplaying book, Alliance Intelligence Reports, written by Bill Smith and published in 1995, mentioned an Adnerem mercenary as member of the M'Yalfor'ac Order. In 1996, author Timothy S. O'Brien gave the species an entry in his article \"Alien Encounters,\" published in Star Wars Adventure Journal 11, also published by West End Games. The article gave a far more detailed account of the species' biology and culture. It reused Rodis-Jamero's Bib Fortuna concept art and included another image of an Adnerem drawn by Scott Neely. The article provided role playing statistics for the Adnerem, which showed they favored perception and knowledge, but were weak in technological aptitude. Etsero was mentioned in another West End Games book, No Disintegrations, published in 1997. The article from Adventure Journal 11 was republished in a reduced form in the book Alien Encounters in 1998, a collection of alien species compiled by Paul Sudlow. The book also revealed that Adnerem were mammals in its appendix, which listed all species in the book by type. The Adnerem received an entry in The Complete Star Wars Encyclopedia, published in 2008 and written by Stephen J. Sansweet and Pablo Hidalgo."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130124140549\/starwars\/images\/thumb\/2\/25\/Monsters_and_Aliens_Adnerem.jpg\/180px-Monsters_and_Aliens_Adnerem.jpg","caption":"The use of the Adnerem image in Monsters and Aliens from George Lucas"}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Wanted by Cracken","elements":[]},{"text":"Galaxy Guide 11: Criminal Organizations","elements":[]},{"text":"\"Alien Encounters\"—Star Wars Adventure Journal 11","elements":[]},{"text":"Alliance Intelligence Reports","elements":[]},{"text":"No Disintegrations","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" Star Wars Aliens: Recycling Abandoned Film Concepts on StarWars.com","elements":[]}]}],"images":[]}]}