{"sections":[{"title":"Agee","level":1,"content":[{"type":"paragraph","text":"The Agee were a tiny, winged, sentient species that came in two varieties: those capable of flight and those not. In 17 ABY, several Agee resided on Coruscant, the galactic capital. One such Agee was almost trapped in the Crystal Jewel casino when it started to collapse following the Bombing of the Senate Hall. Another Agee went to visit Mon Mothma following her ascension to Chief of State of the New Republic after incumbent Leia Organa Solo resigned to rescue her brother, Luke Skywalker; however, the Agee left before she could meet with Mothma."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Agee were a tiny,sentient, species that had wings. The species existed in two varieties; one capable of independent flight and the other flightless. The latter variety was significantly more delicate than the former."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"In 17 ABY, several Agee resided on Coruscant, the capital of the galaxy and then under New Republic control. That year, an Agee was present in the Crystal Jewel, an underground casino, when explosions rocked the nearby Senate Hall. As the shockwave from the explosion threatened to collapse the casino, the Agee was trapped on a crumbling section of the ceiling until helped down by a fellow patron, Han Solo. Solo also shot the lock on the casino door, allowing its patrons to vacate the unstable premises."},{"type":"paragraph","text":"The explosions were caused by darksider Kueller, who kidnapped Jedi Master Luke Skywalker, holding him hostage in a gambit to force Skywalker's sister and then Chief of State, Leia Organa Solo, to transfer presidency of the New Republic to him. Organa Solo, however, resigned her position, passing it to Mon Mothma, before leaving Coruscant to rescue her brother. Following these events, many individuals visited Mothma's anteroom, hoping to convey to her their well-wishes. These individuals included a female Agee that decided to visit Mothma on a lark. Mon Mothma's receptionist droid placed the Agee ahead of the droids R2-D2 and C-3PO, who were waiting to convey the findings of their investigation into the Senate Hall bombing to the Chief of State. When R2-D2 made a shrill noise in order to prevent C-3PO from revealing their findings—that the bombing had been caused by Imperial detonators—the Agee quickly flew out of the room."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Kristine Kathryn Rusch created the Agee species for her novel The New Rebellion, published by Bantam Spectra in 1996. They were subsequently mentioned in the Star Wars Encyclopedia (1998) and the The Complete Star Wars Encyclopedia (2008). The latter source introduces new material that appears to be a retcon explaining why The New Rebellion portrays an Agee as trapped on a ceiling when it later describes the species as capable of flight. The Complete Star Wars Encyclopedia handles this by creating two varieties of Agee, which is calls \"flightless and winged\" despite both Agee in the novel possessing wings."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The New Rebellion","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}