{"sections":[{"title":"Arcona","level":1,"content":[{"type":"paragraph","text":"Arcona, sometimes singular Arconan, were scaleless reptiles with humanoid bodies. Hailing from the tropical desert planet of Cona in the Teke Ro system, they had poor eyesight, despite their large eyes, and had a small organ between their eyes which, often mistaken for their nose, helped them to see. An Arcona's lifespan was roughly the same as a Human's. The Arcona lived in a family based community, where the males took care of the young, as the females were generally reckless and thrill-seeking. Despite not being a particularly technological species, by the time the Galactic Empire rose to power Arcona could be seen in every corner of the galaxy. They were also notorious for their easy addiction to common salt."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Arcona had flat, anvil-shaped heads, sharp claws, clear, marble-like eyes, and thick, protective skin that ranged in tone from olive to ebony. Cona, the native planet of the Arcona, was always hot, and had very little water. The atmosphere was filled with ammonia vapor. The Arcona adapted to this environment by eating the ammonia-converting roots of the complex flora of Cona as a source of water (the only water planet-wide). The Arcona depended on the ammonia to live and, as a result, Arcona living offworld had to take ammonia supplements or risk death."},{"type":"paragraph","text":"Despite their bulbous eyes, the Arcona had very poor eyesight. Their eyes could not detect fine shapes as they were made up of thousands of tiny photoreceptors like to an insect; and so they only saw blurry objects. To aid their poor eyesight, the Arcona had a small diamond shaped sensory organ between their eyes. Often mistaken for their nose, this organ detected heat patterns from living beings. Thus, the Arcona could recognize someone or something by its heat pattern. Like many reptiles, the Arcona had olfactory organs located in their ever moving tongues. This helped them distinguish objects in their environment that they otherwise could not make out and also gave them a keen sense of smell."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130225033736\/starwars\/images\/thumb\/1\/17\/Arcona.png\/200px-Arcona.png","caption":"Hem Dazon, in the Mos Eisley Cantina in 0 BBY."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Arcona normally thought of themselves not as individuals but as a collective whole. Largely foresaking individuality they often referred to themselves as \"we\" even when alone. The Arcona lived in loose, family-based communities called nests, which were ruled by a Grand Nest. Because Arcona were born in nests underground they obtained a close sense of family living in close quarters with brothers and sisters."},{"type":"paragraph","text":"The language of the Arcona was Arconese, which came from their home planet of Cona. However, on off-world colonies, Arcona young were rarely taught Arconese, as they could learn Basic easily. Arcona females were considered far more reckless and free-spirited than their male counterparts, and so the males usually raised the children. Arcona took much time courting a partner, and the commitment to marry was also a commitment to parent. Arcona were highly susceptible to salt addiction, which served as a hallucinogen. Their eyes shifted from green to gold after prolonged addiction. The effects of salt on the Arcona resembled that of intoxication; an Arcona was seen in a dive bar consuming a soup in which he had poured an entire salt shaker's worth of salt, then was observed stumbling out of a cantina \"Like it was last call.\""}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070627121229\/starwars\/images\/thumb\/f\/f3\/ArconaUUA.jpg\/150px-ArconaUUA.jpg","caption":"An Arcona"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Before they made contact with the greater galaxy, the Arcona were not technologically advanced. Although they eventually used sentient technology, they never developed any of their own. When scouts from the Galactic Republic first arrived on Cona, many Arcona were extremely enthusiastic about exploring the galaxy; oftentimes, whole communities sought to travel off-world. As a consequence, Arcona colonies were quite common throughout the galaxy. After adapting to other species' technology not present on Cona, the Arcona were commonly seen in every spaceport in the galaxy."},{"type":"paragraph","text":"Offworlders initially traded water for mineral rights, but soon discovered that salt was a highly addictive hallucinogen for the Arcona. Traders then imported large amounts of salt before communities outlawed the dealings. In the long run, it was only the Republic that saved the Arcona from pandemic addiction, passing laws which punished salt sales on Cona. Salt-addicted Arcona could be easily recognized because their eyes turned from green to gold. Because of the large number of addicts, many people believed that the natural Arcona eye color was gold."},{"type":"paragraph","text":"When the Galactic Empire came to power, the Arcona largely made up the institutions most vocal supporters when they learned of its desire to form a united galaxy. Fitting with their notion of a uniform galaxy, the Arcona quickly pledged support but had joined the New Republic sometime during the Imperial Civil War. When the Yuuzhan Vong invaded the galaxy, the Arcona homeworld was attacked and invaded by the alien horde and only freed after the war's end by the Galactic Alliance."}],"images":[]},{"title":"Arcona in the galaxy","level":2,"content":[{"type":"paragraph","text":"Due to their communal nature, the majority of Arcona who travel offworld seek scientific development to bring back to their nests on Cona. Having spread out across the galaxy to follow the urge of exploration, entire families can be found living near every major spaceport working as employees of major shipping or mining conglomerates, as well as simple tourists. At the time of the Galactic Civil War, a camp for salt-addicted Arcona was established on the jungle world Kashyyyk."},{"type":"paragraph","text":"Force-sensitivity was a trait not uncommon among the Arcona and many found themselves involved in the Force-traditions of the greater galaxy. While no Arcona were ever recorded as joining the Sith Empire, many Forceful Arcona were initiated in the Jedi Order up until the time of the Great Jedi Purge and the collapse of the Republic. Two Arcona Jedi Knights served the Order after it was rebuilt during the time of the Galactic Alliance; Vaala Razelle and Izal Waz."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140126180206\/starwars\/images\/thumb\/3\/32\/Arcona_Rumor_Monger-BotF.jpg\/210px-Arcona_Rumor_Monger-BotF.jpg","caption":"An Arcona rumor monger"}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Galaxy Guide 6: Tramp Freighters","elements":[]},{"text":"Planets of the Galaxy, Volume One","elements":[]},{"text":"The Star Wars Planets Collection","elements":[]},{"text":"Galaxy Guide 11: Criminal Organizations","elements":[]},{"text":"Shadows of the Empire Planets Guide","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Wildlife of Star Wars: A Field Guide","elements":[]},{"text":"Alien Anthology","elements":[]},{"text":" Star Wars Customizable Card Game – A New Hope Limited","elements":[]},{"text":"\"Who's Who in the New Jedi Order\"—Star Wars Insider 57","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"\"Rebel Rumblings\"—Star Wars Insider 72","elements":[]},{"text":" \"Race for the Tessent\"—Star Wars Gamer 9","elements":[]},{"text":"Obsessed With Star Wars","elements":[]},{"text":" Planet Hoppers: Cona on Wizards.com","elements":[]},{"text":"\"Jedi Library\"—Star Wars Insider 92","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: The Clone Wars Comic UK 6.15","elements":[]},{"text":"Star Wars: The Clone Wars: The Complete Season Three","elements":[]},{"text":" Abyssin in the Databank","elements":[]},{"text":" Arcona in the Databank","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" Star Wars: The Card Game – The Battle of Hoth","elements":[]},{"text":" Star Wars: The Card Game – Star Wars: The Card Game - Balance of the Force","elements":[]}]}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20060701112539\/starwars\/images\/thumb\/9\/9a\/Arcona_AA.JPG\/150px-Arcona_AA.JPG","caption":"An Arcona with marble-like eyes"}]},{"title":"See also","level":2,"content":[{"type":"list","elements":[{"text":"Arcona Mineral Harvest Corporation","elements":[]},{"text":"Dactyl","elements":[]},{"text":"Grand Nest","elements":[]},{"text":"Nest Leader","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Arcona on Star Wars: The Old Republic Wiki","elements":[]},{"text":"Arcona on SWG Wiki","elements":[]}]}],"images":[]}]}