{"sections":[{"title":"Amaran","level":1,"content":[{"type":"paragraph","text":"The Amarans were a sentient species characterized by both vulpine and canine characteristics. The Amaran anatomy included pointed ears; a narrow, bewhiskered snout; a furry body; a bipedal stance; and a bushy tail. As unrepentant hagglers, Amarans made natural traders, especially of non-sentient beasts, which they tamed and bred."},{"type":"paragraph","text":"Natives of the planet Amar, the Amarans became integrated into the galaxy by 15,000 BBY. Over time, Amarans emigrated to worlds such as Vulpter and Naboo. On the former planet, the vulpines served as managers of underground storage facilities owned by the Trade Federation cartel and staffed by workers drawn from the planet's native Vulptereen population. On Naboo, on the other hand, Amarans captured, tamed, and sold creatures such as the bursa."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Amarans were a species of small,sentient bipeds who were considered both vulpine and canine in nature. They had four clawed digits per limb and walked digitigrade upon their toes. Each member of the species had a bushy tail. The black eyes gazed forward, and a pointed muzzle held a red mouth and narrowed to a small, black nose surrounded by whiskers. Two large, pointed ears stood erect at the top of the head."},{"type":"paragraph","text":"Each Amaran was covered in variegated fur. One possible pattern paired red-orange fur across the back, tail, and outside of the arms and legs with white patches on the insides of the limbs and ears, on the snout, on the soles of the feet, and across the neck and belly. The fur grew short on most of the body with the exceptions of the tail and of tufted jowls."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Amarans were well-known for their propensity to bargain and dicker over transactions. Some Amarans were known as beast charmers; a typical member of the profession might carry a staff in the course of his or her duties. The species wore clothing items such as trousers, vests, shirts,earrings, and necklaces."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Amarans evolved on the planet Amar. The world became integrated into the greater galaxy at some point between 25,000 and 15,000 BBY, when it became part of the Airon sector, located in the Inner Rim portion of the Slice. The planet remained part of space controlled by the Galactic Republic during the Jedi Civil War of 3959 to 3956 BBY, the Mandalorian Wars of 3976 to 3960 BBY, and the Clone Wars of 22 to 19 BBY.Years later, in 137 ABY, the Amaran homeworld had fallen into space considered part of the Sith Lord Darth Krayt's Galactic Empire."}],"images":[]},{"title":"Amarans in the galaxy","level":2,"content":[{"type":"paragraph","text":"Amar's location in the Stenness Node afforded the species access to the ancient hyperspace terminal that traveled through it. By the time of the Clone Wars, Amarans had begun emigrating from Amar to other worlds. During the period in which the planet Vulpter was under Trade Federation control, six percent of the world's 421 million inhabitants—or 25.3 million individuals—were members of the Amaran species. The management staff of Trade Federation–owned underground storage tunnels on the planet was drawn entirely from Vulpter's Amaran population; the facilities were otherwise staffed by the planet's native species, the Vulptereens. The arrangement caused tension between the two species, since the Vulptereen laborers felt they were ill compensated for their hard labor in the subterranean locales."},{"type":"paragraph","text":"During the regime of the New Republic, some Amarans had established themselves in the Gungan Swamp on the planet Naboo. There, the Amarans captured wild bursas for breeding and off-world sales. They plied this trade on the planet Coruscant as well, with Amaran dealers constituting a major segment of the Coruscant Livestock Exchange and Exhibition, where they were known to have a wide selection of hard-to-find creatures.One such dealer negotiated with a Pacithhip who was interested in reselling a bursa to Hutts; meanwhile, a smaller Amaran spoke with a Veknoid."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110716050723\/starwars\/images\/thumb\/4\/4b\/Amaran_bursa_deal.jpg\/180px-Amaran_bursa_deal.jpg","caption":"Amaran animal dealers operated on planets ranging from Naboo to Coruscant."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Author and illustrator Amy Pronovost designed the Amarans for a work known as The Essential Guide to Episode I at the request of its author, Daniel Wallace. Although The Essential Guide to Episode I was ultimately canceled, artist Terryl Whitlatch used the concept art created by Pronovost as inspiration for Amaran characters she included in illustrations for The Wildlife of Star Wars: A Field Guide, which was published by Chronicle Books in 2001."},{"type":"paragraph","text":"Some confusion has surrounded the name of the Amarans' homeworld. The article \"The University of Sanbra Guide to Intelligent Life: The Marvel Series,\" published in Star Wars Gamer 1 in 2000, mentions a planet named \"Amara\" but otherwise makes no mention of the Amaran species. However, the 2008 reference work The Complete Star Wars Encyclopedia includes an entry on the species, which names their homeworld \"Amar.\"2009's The Essential Atlas, for its part, provides a cartographic placement for the Amar system, seemingly confirming the spelling \"Amar\" as correct. Indeed, a forum posting by Daniel Wallace that same year confirms the fact that \"Amara\" and \"Amar\" refer to the same world. This article follows the latter spelling, since it is the most current."},{"type":"paragraph","text":"On January 31, 2010, Pronovost presented her personal description of the Amarans—with the caveat that the ideas were non-canon until used in a licensed source—for the use of Star Wars fans who wished to add such characters to their role-playing scenarios. According to Pronovost, members of the species were relatively diminutive, standing between 3.5 and 4 feet in height. Each Amaran tended toward a wiry frame, and his or her long tail acted as a counterweight that afforded great dexterity. The species's fur came in colors as diverse as white, orange, black, yellow-orange, and gray, with white and gray the most common. Their eyes, meanwhile, were generally black, although green, blue, and red were also known. Male Amarans tended to be slightly larger than females. Amaran mothers generally bore one pup at a time; only when breast-feeding young did female Amarans exhibit obvious breasts. An Amaran was considered an adult at age eighteen."},{"type":"paragraph","text":"Pronovost's ideas about Amaran society and culture state that Amaran religion revered the stars and other celestial objects, such as their world's moon, Rurrri. An Amaran myth told of Rurrri being lonesome and venturing to Amar in the form of a white fox. He cried all night, so the sun, Surru, manifested as a gold-furred Amaran to keep Rurrri company. The two mated, and their offspring became the stars. The species that evolved tended toward frivolity and canniness, traits they put to work in careers such as trading, flying vehicles, and conning unsuspecting targets. They were naturally comfortable with non-sentient animals, and the species was known for its animal handlers. The world's beast-tamers were able to capture and tame even large creatures, including the Vrrryyyk, a flying beast with both bird and reptile characteristics that served as the preferred Amaran means of transportation. They had a love for expensive food, drink, and clothing. The species maintained their tails in top order through grooming, as the tail was a source of pride."},{"type":"paragraph","text":"The Amarans, according to Pronovost, took great pains to preserve the natural environment of their homeworld, a planet that abounded with life; in Amaran culture, poaching was considered a heinous crime. Members of the species congregated in cities. Mining was a large industry on Amar, but the Amarans were careful to conduct such operations through non-destructive means whenever possible. Amar's exports included artwork, foodstuffs, creatures, ores, cloth, and energy crystals."},{"type":"paragraph","text":"Pronovost's notes explain that reverence for the stars prompted the Amarans to develop a primitive form of hyperspace travel on their own. With the advance, they discovered the planet Naboo, a world that served as their gateway to the larger galactic community. Amarans who emigrated from their homeworld often served as merchants, confidence people, gamblers, and tourists. A large population of Amarans moved to Naboo, where they sold local tamed creatures to offworlders as well as the planet's natives, the Human Naboo, and the non-Human Gungans. The Amarans of Naboo grew wealthy from their swamp settlements and even saved the Naboo bursa from extinction at the hands of Gungan hunters. Some Amarans exhibited Force-sensitivity, but only a few became Jedi due to the foreignness of the discipline required by the Jedi Order; accordingly, Amaran Jedi were seen as odd by their non-Jedi fellows."},{"type":"paragraph","text":"Pronovost has since included Amaran characters in her sketch cards for Star Wars Galaxy Series 5. The series was published by Topps in 2010."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110716051137\/starwars\/images\/thumb\/f\/f1\/Amaran_concept_art.jpg\/180px-Amaran_concept_art.jpg","caption":"Amy Pronovost's concept art of the Amarans served as the inspiration for Terryl Whitlatch's version of the species."},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110716051907\/starwars\/images\/thumb\/b\/b4\/Amaran_Galaxy_sketch_card.jpg\/140px-Amaran_Galaxy_sketch_card.jpg","caption":"Pronovost included Amarans in her sketch cards for Topps' Star Wars Galaxy Series 5."}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"The Wildlife of Star Wars: A Field Guide","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":" Byss and the Deep Core on Wizards.com","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":" Star Wars Galaxy Series 5","elements":[]}]}],"images":[]}]}