{"sections":[{"title":"Andalese","level":1,"content":[{"type":"paragraph","text":"The Andalese were a sentient species of bipedal humanoids known in the wider galaxy by 17 ABY. Largely resembling Humans in appearance, their distinguishing features included small, pointed horns on the head and symbiosis grafts on the body. New Republic General Han Solo suspected Enara, a female Fallanassi adept active during the Black Fleet Crisis, to be an Andalese."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Andalese were a sentient species that had a basic humanoid appearance, with two arms and two legs that provided an upright, bipedal posture. They grew hair on their heads, on which they also had small, pointed horns that could be concealed by the hair. Another Andalese physical trait was the application of symbiosis grafts to their bodies. As they otherwise resembled Humans, the Andalese could pass for members of that species if they dressed in reasonably loose clothes and hid their horns. Nevertheless, they were distinct enough that, even when not flaunting their identity, they could be recognized by other features or mannerisms. The species had at least one sex, female."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"At least some Andalese had access to spacefaring technology by the reign of the New Republic. Some members of the species were known to speak Galactic Basic Standard."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Andalese were known to the greater galactic community by 17 ABY. That year, the Human New Republic General Han Solo was held captive aboard the Executor-class Star Dreadnought Pride of Yevetha during the Black Fleet Crisis, a confrontation between the Yevethan government and the New Republic. Among other prisoners onboard was Enara—a member of the all-femaleFallanassi order devoted to an aspect of the Force that they called the White Current—whom Solo believed to be possibly Andalese, despite her appearance indicating she was a baseline Human."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The first and only mention of the Andalese species in Star Wars canon is in Tyrant's Test (1997), the third book of The Black Fleet Crisis trilogy by Michael P. Kube-McDowell. Although indicating that an Andalese could pass for a Human, the novel does not establish whether they are a near-Human species that shares common biological ancestry with baseline Humans, or whether they have developed similar physical characteristics independently."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Tyrant's Test","elements":[]}]}],"images":[]}]}