{"sections":[{"title":"Amorphiian","level":1,"content":[{"type":"paragraph","text":"The Amorphiians, or Amorphiian beings, were a sentient species indigenous to the planet Amorphiia in the Mid Rim. Although they appeared identical to baseline Humans, the Amorphiians' motor abilities suffered frequent power fluctuations, causing them to speed up, slow down, or gyrate wildly, depending on the nature of a particular malfunction. Amorphiians had the ability to restore normal functionality to a limp or uncooperative body structure by rubbing, pushing, moving, or otherwise stimulating the body part."},{"type":"paragraph","text":"At least one Amorphiian company was selling a brand of mini-transmitter in 1 ABY. The model shipped with an instruction cassette hosted by an Amorphiian named Dromboid. The recording's opening announcement touted the cassette as a unique chance for consumers in the galaxy to meet an Amorphiian being. Nevertheless, the manufacturer was careful to note that the Amorphiians' propensity for power glitches was in no way a reflection on the safety or utility of their product."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Amorphiians, also known as Amorphiian beings, looked like standard Humans, with proportions and outward anatomy matching those of other sentient humanoid species. At least one member of the species had gray hair, blue eyes, and pale skin. Amorphiians had neural-cranial synapses and the ability to feel pain."},{"type":"paragraph","text":"Amorphiians were distinguished from other species by their machine-like qualities. For example, an Amorphiian's movements were accompanied by a whirring noise. Members of the species also exhibited various quirks: an Amorphiian could beep or gesticulate rapidly in a localized area of the body, such as the chin, eyelids, fingers, neck, or tongue. Amorphiians experienced frequent problems with their neural motor systems. This resulted in a lack of power to the body or a portion thereof, leading to slower, faster, or erratic movements. Such fluctuations caused the voice to vary in pitch and speed, the eyes to cross, or the body to sway oddly. Amorphiians dealt with these losses of power by stimulating a part of the body to restore normal functionality. For instance, a malfunctioning Amorphiian could return to normal by re-extending a limp finger, pressing on stalled hips, rubbing the forehead, flapping the arms, or even using standard tools to tweak a stalled smile. On a total loss of power, an Amorphiian collapsed."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"At least one Amorphiian company sold mini-transmitters outside the the species' home, the Amorphiia system; the purpose of these items was to translate speech into one of 1,000 other languages. The Wookiee Lumpawarrump owned one of these units on the planet Kashyyyk in 1 ABY. This mini-transmitter came with a bag of tools, a circuit-breaker module, an impulse-to-voice translator, and an instruction cassette to explain the assembly process."},{"type":"paragraph","text":"The announcement preceding the instructional cassette acknowledged the power fluctuations experienced by Amorphiians but insisted that these malfunctions did not affect the product itself. The disclaimer also insinuated that encountering an Amorphiian was a rare occasion for most members of the galactic community. The instruction video itself was hosted by a male Amorphiian named Dromboid. The host wore clothing standard for most other spacefaring species: a shirt, trousers, a jacket, and a belt. Dromboid was a fastidious representative of his species, speaking in an even and emotionless keel, yet purporting to appreciate beauty. Dromboid's instructions revealed, however, that the erratic nature of Amorphiians could be frustrating to members of other species."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Amorphiians hailed from the planet Amorphiia, located in the Amorphiia system in the Eidoloni sector of the Mid Rim. Their region of the galaxy had been reached by outsiders sometime between 3000 and 1000 BBY. The world remained in unaligned or contested space during the last few years of the New Sith Wars, from 1004 to 1,000 BBY. By the time of the Clone Wars, it was in Galactic Republic space. By 1 ABY, the Amorphiians had established a mini-transmitter industry, exporting their products beyond their home star system along with instruction cassettes that touted the consumer's chance to meet a member of the Amorphiian species, albeit only virtually. The region of Amorphiia had a low average population density of between one and ten million inhabitants per system c. 25 ABY. The planet was within territory controlled by Darth Krayt as part of his Galactic Empire by 137 ABY."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Amorphiian named Dromboid appears in a short comedy segment in The Star Wars Holiday Special, which aired on television in 1978. The character, portrayed by American comedian Harvey Korman, teaches the young Wookiee Lumpy how to assemble a mini-transmitter. All the while, Dromboid's constant malfunctions frustrate the young Wookiee. The fourth draft script of the special spells the species' name Amorphiian, a spelling that is echoed as canonical in The Complete Star Wars Encyclopedia, published in 2008."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Star Wars Holiday Special","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"I Have a Bad Feeling About This!\"—Star Wars Insider 106","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" \"We'll Miss You, Gormaanda,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}