{"sections":[{"title":"Abyssin","level":1,"content":[{"type":"paragraph","text":"Abyssin were a species of mammalian, cycloptic humanoids native to the Outer Rim world Byss in the Byss and Abyss system. As a people the Abyssin were often described as \"primitive and violent\", and were often hired as petty thugs."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"At about two meters tall, the hulking Abyssin had long limbs and a single large eye that dominated their greenish-tan foreheads. Typically well-muscled, the Abyssin had a slightly hunched appearance. A distinctive trait of the Abyssin was their ability to heal quickly and regenerate any body part, which some believe contributed to an especially violent racial culture. Their fast regeneration is believed to have been an adaptation to prevent fluid loss from bleeding. Abyssin body cells were replaced every 80 hours and organs which typically were paired in other species appeared singularly in the Abyssin body. Because of their regenerative abilities, Abyssin could live up to 300 standard years."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"A primitive tribal society, the Abyssin of Byss were known as violent and brutish and their planet was avoided by most beings in the civilized galaxy. On the arid planet of Byss, unstable resources did not allow for mass population growth or for the stabilization of a central government, economy or trade system. Existing simply in nomadic tribes, the Abyssin groups could and did interact peacefully with one another through trading, though only if both groups had plentiful water and food supplies. Otherwise, they began a 'Blooding', a brawl which ended only when one tribe's warriors were all killed, captured, or incapacitated. Warriors who survived a Blooding were usually allowed to join the winning tribe once they finished their regeneration. This tradition led to some violent incidents when spacers tried to trade with Abyssin tribes with scarce water resources, especially since the Abyssin assumed the alien traders could regenerate as quickly as they did. Elderly Abyssin lost these regenerative abilities, and either voluntarily exiled themselves to die in the desert or were ritually killed by their tribe."},{"type":"paragraph","text":"The Abyssin (language) consisted of grunts and growls while they used hieroglyphs to communicate in written form. Abyssin did not keep family names and typically were known only by a single name. Examples of Abyssin names included Anami, Easym, Mador, and Polcyc."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070424161749\/starwars\/images\/thumb\/7\/7b\/Abyssin.jpg\/200px-Abyssin.jpg","caption":"Myo at Chalmun's Spaceport Cantina."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Discovered during the Kymoodon Era by Arconan scouts hailing from the Galactic Republic, the Abyssin were greatly distrustful of the explorers when they attempted to create a dialogue with them. Rebuffing all attempts to establish relations with the Arcona, the Abyssin finally relented and the Arcona shared their desert survival techniques in order to establish trust and respect. While the Abyssin had no desire to leave their homeworld, the travelers who had heard of the planet's strong, vicious warriors flocked to acquire slaves. Rarely impacting the galactic political or economic climate, the Abyssin have fought on the side of the Republic and its opponents throughout the course of history. By the time of the Galactic Empire's rise to power, a number of Abyssin lived on Phaeda and Dubrava."}],"images":[]},{"title":"Abyssin in the galaxy","level":2,"content":[{"type":"paragraph","text":"Abyssin were uncommon in the greater galaxy. Those who were found off Byss were often slaves, bodyguards, or mercenaries. Abyssin were sometimes referred to as \"monocs\", \"cyclops\", or \"One-Eye\". The Abyssin generally found these terms insulting, and would often react violently to them. One of many Abyssin slaves of the Sith Empire during the Cold War, Qawohl served the Sith apprentice Teneb Kel dutifully until witnessing his master's treasonous deeds in the Imperial capital Kaas City. Demanding his freedom, Kel killed Qawohl while feeling mildly regretful. Several millennia after the Sith Empire's destruction, an Abyssin had been trained in the ways of the Force and achieved the rank of Jedi Master. Master Quarmall was active during the Clone Wars and considered a radical by the Jedi High Council due to his decision to take on the training of the entire Bergruutfa Clan as his Padawans."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"Galaxy Guide 6: Tramp Freighters","elements":[]},{"text":"Heir to the Empire Sourcebook","elements":[]},{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"A Guide to the Star Wars Universe, Third Edition","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"\"Unknown Soldier: The Story of General Grievous\"—Star Wars Insider 86","elements":[]},{"text":"Star Wars Miniatures: Universe","elements":[]},{"text":" Star Wars Customizable Card Game – Jabba's Palace Limited","elements":[]},{"text":"\"Rebel Rumblings\"—Star Wars Insider 72","elements":[]},{"text":"The Official Star Wars Fact File 138","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 7","elements":[]},{"text":"Obsessed With Star Wars","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" Sebulba in the Databank","elements":[]},{"text":" Abyssin in the Databank","elements":[]},{"text":" Star Wars Galaxy Series 7","elements":[]},{"text":"Star Wars: Force Collection","elements":[]},{"text":" Mos Eisley Cantina in the Encyclopedia","elements":[]},{"text":" \"Drawing from the Imagination: Mythological Creatures in Star Wars, Part 2,\" The Official Star Wars Blog","elements":[]},{"text":" \"The Star Wars Holiday Special Cantina: Who's Who,\" The Official Star Wars Blog","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Abyssin on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}