{"sections":[{"title":"Aqualish","level":1,"content":[{"type":"paragraph","text":"The Aqualish were tusked bipeds from the planet Ando whose appearance combined aspects of arachnids and pinniped aquatic mammals. Aqualish had a reputation for being nasty, crude and aggressive, and generally pursued off-world careers as mercenaries, bounty hunters, and pirates. One of the most infamous such Aqualish was the smuggler Ponda Baba."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"An amphibious species native to the planet Ando, the Aqualish people were made up of three distinct races which included the Aquala, the Ualaq and the Quara. Although they all had their differences, their baseline genetic structure was the same and their appearances did not vary so drastically as to characterize them as different species. All Aqualish had two facial tusks which curved down over their mouths; a trait which added to their appearance as arachnids. Indeed, the Aqualish had some arachnid genetic material in their distant past, as demonstrative in their relationship with the Harch species. These facial tusks were highly sensitive to heat and cold, and were used for cracking open the hard shells of shellfish or burrowing through the swampy loam of their homeworld."},{"type":"paragraph","text":"The Aquala subspecies was considered to be the baseline Aqualish breed. Having finned hands and two bulbous black eyes, the Aquala were unable to manipulate most machinery or equipment developed by the galaxy's many species which designed these tools for beings with digits. As a result, Aquala tended to remain on their homeworld in greater numbers than either of the other subspecies. The Aquala hated their Quara relatives, which was characteristic of each of the subspecies shared hatred of each other as they believed their race to be the most superior. The Quara had developed clawed, five-fingered hands and like the Aquala had two eyes. Combined with the Ualaq, the Quara made up only ten percent of the Aqualish population. This was due to their ability to use equipment offworld designed for fingered species; Thus, they were the subspecies more commonly found off-world. The Ualaq, considered by some specialists to be the result of genetic mutation, had four eyes instead of two and fingered hands which varied from three to five digits on each. The least common subspecies, the Ualaq often times journeyed far from Ando to avoid discrimination by the Aquala."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070423102136\/starwars\/images\/thumb\/b\/bd\/Aqualish2.jpg\/180px-Aqualish2.jpg","caption":"A male Quara (left) and a female Aquala (right)."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Aquala hated their Quara relatives, as they blamed them for the image the Aqualish had in the galaxy as thugs. Because of this the latter subspecies were considered pariahs on Ando, which had a lower population of Aqualish than the galaxy itself. All three Aqualish subspecies spoke mutually intelligible dialects of the same language. Quarrelsome and thug-like, the Aqualish culture revolved around aggression and toughness, with diplomacy being one of their weakest attributes."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Aqualish evolved into three races which were constantly at war with each other: the Aquala, the baseline race of the oceans, the Quara of the wetlands, and the Ualaq of the caves and dark rain forests. Each race believed they were the dominant branch, and allegations leveled by the Aquala that the other two races caused a decline in the harvests of fish eventually escalated into the Aqualish Civil War. In a shocking turn of events, the war ultimately ended in a treaty which saw the unification of all three races. After the war ended, a group of Human settlers stumbled upon the world and were killed by the startled and aggressive Aqualish. Confiscating the ship which brought the supposed invaders to the world, the Aqualish extrapolated the secrets of space travel from the exploratory craft and set forth on a campaign of conquest to the neighboring world of Andando. Not long after the landing, Andando was left a smoldering ruin, rendered inhospitable by the barbarous Aqualish."},{"type":"paragraph","text":"Discovered by the Galactic Republic during the Great Manifest Period, envoys attempted to make contact with the inhabitants of Ando and were rebuked with hostile fire. This quickly led to the Aqualish–Republic War that, while bloody, quickly ended in the defeat of the Aqualish. Defeated, Ando joined the Republic in 15,000 BBY and began an era of colonization which resulted in the formation of the Andoan Free Colonies; an event concurrent with the Ando separation. Due to the constant violence erupting across the world however, the Republic dispatched the Ando Demilitarization Observation Group to ensure the de-escalation of violence; Master Jorus C'baoth of the Jedi Order served as one of the group's primary observers."},{"type":"paragraph","text":"Represented in the Galactic Senate by Po Nudo before the Separatist Crisis, the world seceded in 23 BBY along with Sy Myrth, a move contested by the Andoan Free Colonies, which retained representation in the Senate under Gorothin Vagger. Nudo became a prominent Separatist leader and a member of the Separatist Council. As the Clone Wars spread across the galaxy, a civil war broke out between both Nudo and Vagger's factions of Aqualish. Despite assistance from the Grand Army of the Republic and Jedi Master Shaak Ti, the battle ended in a Separatist victory. When the Galactic Empire rose to power at the end of the war, former Separatist worlds suffered heavily from intense Imperial scrutiny. Appointing an Aquala Senator to replace the recently murdered Nudo, the Senator served until the disbanding of the Imperial Senate in 0 BBY. Establishing an Imperial garrison on Ando, the Imperials ravaged the world's natural resources, using them to further the Empire's war machine. Following the death of Emperor Palpatine, Ando joined the New Republic only to fall into the sight of one of Grand Admiral Mitth'raw'nuruodo's feint attacks in preparation for his attack on Ukio. Sending the Bellicose in 9 ABY, the world was taken by Thrawn's confederation."},{"type":"paragraph","text":"During the Yuuzhan Vong War, Ando was attacked by the invaders but was issued an ultimatum: surrender a member of the Jedi Order and destroy all droids on the planet and the Yuuzhan Vong would leave in peace. The Aqualish quickly turned on visiting Jedi Knight Dorsk 82, but this was ignored by Warmaster Tsavong Lah and an invasion and occupation of their planet ensued, enslaving the race to the foreign invaders. After the war's end, the Yuuzhan Vong abandoned the planet, thus freeing the Aqualish from occupation. Ando remained independent and disunited, and therefore never joined the Galactic Alliance. As of 137 ABY, Ando was a member of Darth Krayt's Galactic Empire."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20081010132850\/starwars\/images\/thumb\/8\/89\/Pirate_TotG.jpg\/180px-Pirate_TotG.jpg","caption":"An Aqualish pirate"}]},{"title":"Aqualish in the galaxy","level":3,"content":[{"type":"paragraph","text":"While originally confined to their homeworld, contact with the Galactic Republic opened up space transit for the Aqualish and the colonization of the Andoan Free Colonies. A community of Whiphids and Aqualish lived on the planet Gertafuu VI, trading with exotic foodstuff and furs."},{"type":"paragraph","text":"There were also a number of Aqualish in Bartyn's Landing, the capital town of Lamaredd, c. 29 BBY."},{"type":"paragraph","text":"While Forceful Aqualish were quite rare, members of the species did go on to train in both the Jedi Order and the Sith Empire. During the Jedi Civil War, an Aqualish acolyte attempted to become initiated in the ways of the Sith on Korriban but was ultimately dissuaded by Jedi Master Revan. Millennium later, two Quara were trained as Jedi; both Windo Nend and an able Jedi pilot were killed during the Clone Wars."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20130225025836\/starwars\/images\/thumb\/1\/10\/Pondababa.png\/180px-Pondababa.png","caption":"Ponda Baba, a Quara bounty hunter active during the Galactic Civil War."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In one of A New Hope's best known continuity errors, Ponda Baba's arm has fin-like hands when still attached, but is hairy and clawed in the close-up shots of the severed arm on the floor. This inspired the writers at West End Games to develop the Aquala and Quara types of Aqualish. Star Wars: The Complete Visual Dictionary retconned the error by creating a new character, Teak Sidbam, said to be sometimes mistaken for Baba."},{"type":"paragraph","text":"When Aqualish characters appeared in the prequel trilogy, more detailed, four-eyed masks—Ualaq masks—were used."},{"type":"paragraph","text":"In the game files (Kotor Tool) of Star Wars: Knights of the Old Republic, the Quara Aqualish are referred to as \"walrusmen\"."}],"images":[]},{"title":"Appearances","level":2,"content":[],"images":[]},{"title":"Non-canon appearances","level":3,"content":[{"type":"list","elements":[{"text":"LEGO Star Wars: The Complete Saga","elements":[]},{"text":"Tag & Bink: Revenge of the Clone Menace","elements":[]},{"text":"LEGO Star Wars II: The Original Trilogy","elements":[]},{"text":"\"Smuggler's Blues\"—Star Wars Tales 14","elements":[]},{"text":"Star Wars Infinities: A New Hope","elements":[]},{"text":"\"The Emperor's Court\"—Star Wars Tales 14","elements":[]},{"text":"The Return of Tag & Bink: Special Edition","elements":[]},{"text":"\"The Revenge of Tag & Bink\"—Star Wars Tales 12","elements":[]},{"text":"LEGO Star Wars: The Padawan Menace","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Aqualish on SWG Wiki","elements":[]}]}],"images":[]}]}