{"sections":[{"title":"Aruzan","level":1,"content":[{"type":"paragraph","text":"Aruzans were the native people of Aruza. They were small humanoid or Near-Human beings with faintly blue skin and dark, almost black, hair."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Aruzans had the ability to share their memories and emotions with one another through cybernetic implants called Attanni. Aruzans felt the barriers of individual identities slip away when using their Attanni, as though they and whoever they had linked with were the same person. Certain Human cyborgs could also share these links."},{"type":"paragraph","text":"While under Imperial rule, the peaceful Aruzans were subjected to what COMPNOR called \"processional orientation experiments\". General Sinick Kritkeen directed these experiments in an attempt to turn the pacifist species into feral warriors who would be useful to the New Order. Though the bounty hunter Dengar was contracted by the Aruzans to assassinate Kritkeen, it is likely that COMPNOR's \"Redesign\" efforts continued under a new COMPNOR officer, probably with severe reprisals carried out against the Aruzan population."},{"type":"paragraph","text":"A famous Aruzan was Manaroo, a dancer Dengar rescued from Aruza before she was scheduled for \"processing\". She later became a slave and dancer for Jabba Desilijic Tiure, and married Dengar shortly after Jabba's death."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Payback: The Tale of Dengar","elements":[]},{"text":"The Mandalorian Armor","elements":[]},{"text":"Hard Merchandise","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Aurra Sing: Dawn of the Bounty Hunters","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Rebellion Era Campaign Guide","elements":[]},{"text":"The Essential Reader's Companion","elements":[]}]}],"images":[]}]}