{"sections":[{"title":"Adarian","level":1,"content":[{"type":"paragraph","text":"Adarians were a species of bipedal humanoids from the planet Adari in the Inner Rim of the galaxy; although Adari was not believed to be their original homeworld."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"A humanoid species of mammalians, the Adarians had elongated skulls made distinct by the large hole which penetrated it. Lacking ears and noses, their skulls were covered in fine hairs which were very sensitive to sound waves, and their skin was underlaid by glands that allowed them to detect odors. Sharp, bony ridges around their mouths substituted for lips seen in other species. The Adarians had distendable throat pouches; elongating them to emit a loud subsonic call which helped in communication over long distances, reaching over 20 kilometers."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090924204849\/starwars\/images\/thumb\/7\/7c\/Adarian-CSWE.jpg\/180px-Adarian-CSWE.jpg","caption":"An Adarian."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Adarian society was based around a rigid caste system known as screel'sara. Their governmental headquarters was the Hall of Decisions from which the upper tier of society had absolute control over those in lower classes. Operating a corporation-like government, the Adarians boasted that their society had never suffered from civil strife. They had unique, advanced carbon-ice drive technology which they developed before contact with the Galactic Republic. Their native language was Adarese, a written and spoken language; speaking Galactic Basic Standard was difficult for the lipless species and was spoken with a heavy accent. Adarian naming conventions included a first name and a family name; some examples included Ador Beldune, Denka Melru, Luur Tenefor and Yeeru Meekel."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Discovered circa 25,000 BBY, the Adarians swiftly became a member state of the Galactic Republic. Remaining loyal to the Republic through the Clone Wars, the planet bought neutrality during the Galactic Civil War by supplying the Galactic Empire with extensive resources and retained a seat in the Imperial Senate. Located in relative proximity to Dantooine, Adarians welcomed outcast Jedi and Rebel Alliance troops earning Adari the reputation of being a \"refuge planet\"."},{"type":"paragraph","text":"Staying out of galactic affairs, the planet was annexed by Grand Admiral Thrawn during his campaigns against the New Republic. When the Imperial Remnant was finally driven from the core, the Adarians joined the Republic, only to be cut off with the invasion by the Yuuzhan Vong in 26 ABY. When the Republic retook Coruscant and reorganized into the Galactic Alliance, the Adarians quickly joined. Remaining neutral in future wars, the species' homeworld was a member of Darth Krayt's Galactic Empire as of 137 ABY."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20080520083409\/starwars\/images\/thumb\/e\/e2\/Trade_on_the_OITS.jpg\/200px-Trade_on_the_OITS.jpg","caption":"An Adarian onboard Omze's Incredible Traveling Starport."}]},{"title":"Adarian in the galaxy","level":2,"content":[{"type":"paragraph","text":"Most Adarians active in the galaxy are scouts under the employ of mining corporations or the Adari government, searching for mineral rich planets or moons to exploit. While the higher class have no need to leave the world, some lower class individuals will abandon their homeworld in search of a better existence. Seeing work as smugglers and joining criminal organizations, the Adari also found work in more prestigious positions. One Adarian served as a junior officer in the Republic Military at the Battle of Sebaddon during the Cold War."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20090601064557\/starwars\/images\/thumb\/e\/eb\/Adarian_smuggler.jpg\/150px-Adarian_smuggler.jpg","caption":"An Adarian smuggler."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"A member of this species was meant to appear in Jabba's Palace in Return of the Jedi but was cut from the finished film. The species was designed and sculpted from the chest up, and was nicknamed \"Hole in the Head\". The species was first seen in The Last Command comic after being identified by the Galaxy Guide 12: Aliens — Enemies and Allies."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"The Old Republic: Fatal Alliance","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Dining at Dex's","elements":[]},{"text":"Star Wars: Agent of the Empire—Iron Eclipse, Part 4","elements":[]},{"text":"Allegiance","elements":[]},{"text":"Star Wars: Episode VI Return of the Jedi","elements":[]},{"text":"The Last Command comic","elements":[]},{"text":"Star Wars: Invasion: Revelations 1","elements":[]},{"text":"Star Wars: Legacy 20: Indomitable, Part 1","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Platt's Starport Guide","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"\"The Ultimate Return of the Jedi Insider's Guide\"—Star Wars Insider 67","elements":[]},{"text":"The Official Star Wars Fact File 72","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Dining at Dex's on Hyperspace","elements":[]}]}],"images":[]}]}