{"sections":[{"title":"Anx","level":1,"content":[{"type":"paragraph","text":"The Anx were a large, reptilian species of bipeds native to the planet Gravlex Med, a high gravity world located in Anx Space on the Outer Rim Territories."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Anx were a bipedal, reptilian species discernible by their height, their tall crests, and their tails. From a world with higher-than-average gravity, the Anx possessed a stooped stature and long necks. Their heads were tall and blade-shaped, with a soaring crest which acted as a sinus cavity. While their crests changed color to reflect their moods, its primary function gave Anx a low rumbling voice. The language which developed on Gravlex Med was one of loud, low-frequency noises that they could use to communicate across distances of several kilometers. Even after the Anx adopted Galactic Basic Standard, their low, rumbling voices could uncomfortably vibrate the bones of other species. In order to counter the weight of their large heads, the Anx had a muscular tail which maintained their balance. Descended from herbivores, their height aided in reaching the bountiful branches of Gravlex Med's chiliox trees. Possessing three stomachs, Anx chewed their cud while as part of a vegetarian diet. To compensate for poor eyesight, Anx had an acute sense of smell."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080303051801\/starwars\/images\/thumb\/2\/20\/Zo_Howler_and_Fo_Kuna.jpg\/180px-Zo_Howler_and_Fo_Kuna.jpg","caption":"Senator Zo Howler and aide Fo Kuna in the Galactic Senate."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Evolving from herd animals, the Anx were a very sociable race known for developing a near fanatical interest in groups they related to. Living in complicated clan structures, Anx enjoy the company of their large families and are more comfortable in groups. Developing spacecraft before encountering other societies, the Anx were curious explorers and fast colonizers. An innate trait among the Anx was a formidable knowledge of anatomy, especially in regard to nerves, muscles and bone structures. Due to this extensive knowledge, even in species they had never encountered, the Anx were considered dangerous unarmed combatants and skilled warriors, capable of defeating most opponents with a single, well-placed attack. While preferring to live without clothing on their homeworld, Anx would wear long flowing robes when traveling to conform to standard galactic customs and views on proper dress. Due to the fact their cranial crests would change color depending on mood, Anx who found themselves in the profession of gambling or diplomacy would often drape their crest with a simple shroud to conceal their feelings."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100420163631\/starwars\/images\/thumb\/d\/dc\/AnxSenator.JPG\/150px-AnxSenator.JPG","caption":"An Anx diplomat displays his pet pikobi."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"An early spacefaring race, the Anx species had built massive cannons from which they launched spacecraft into space for short-distance interstellar travel. Colonizing the surrounding planets in what would come to be known as Anx Space, Gravlex Med became the heart of the society. As an unintended consequence of their journeying, the Anx homeworld was invaded briefly in circa 10,000 BBY by Shusugaunt conquerors. Driven nearly to extinction by the invaders, the Anx eventually found salvation in their world's natural defenses. Unable to survive in the high-gravity ecosystem of Gravlex Med, the Shusugaunt were forced to abandoned their conquests and flee the world. In 5000 BBY, the Galactic Republic discovered the Anx species and accepted them into the Galactic Senate. At the end of the Clone Wars in 19 BBY the Republic was replaced by the Galactic Empire and life on Gravlex Med changed forever. Taking control of Gravlex Launchworks, Imperial mismanagement of the hazardous wastes contained in the factories caused the near extinction of the Anx species and drove all survivors off world."}],"images":[]},{"title":"Anx in the galaxy","level":2,"content":[{"type":"paragraph","text":"Having been early spacefarers, the Anx possessed many colonies across the region of the Raioballo sector known as Anx Space. Extremely sociable beings, the Anx could be found across the galaxy in small numbers, typically remaining in a political atmosphere. During the Cold War between the Republic and the Sith Empire, an Anx by the name of Pipalidi served as a captain in the Republic Navy.Senator Horox Ryyder represented his people in the Galactic Senate during the years leading up to the Clone Wars and was later replaced by former President of Gravlex Med, Zo Howler While Anx were rare in the underworld, slave trader Graxol Kelvyyn of Ryloth was active during the Separatist Crisis and was known to frequent podraces such as the Boonta Eve Classic, held on Tatooine in 32 BBY."},{"type":"paragraph","text":"Rarely producing Force-sensitives, members of the Anx species had been discovered by the Jedi Order and trained in the ways of the Force. The earliest record Anx Jedi was the Coruscant Jedi Temple's battlemaster in the years proceeding the Ruusan Reformations, Master Skarch Vaunk. Venerable and wise, Vaunk was remembered in the Order for authoring several chapters in the The Jedi Path: A Manual for Students of the Force, a handbook which codified many of the Order's bylaws and principals for future generations. During the final decades of the Galactic Republic J'Mikel was an active Jedi Knight while Jedi Master Tsui Choi took the young Anx Theen Fida as his Padawan, only to see him die during the Yinchorri Uprising. Decades later, the female Madurrin achieved Jedi mastery in the rebuilt Order's early years."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20110304191635\/starwars\/images\/thumb\/e\/e6\/Vaunk.jpg\/150px-Vaunk.jpg","caption":"Jedi Temple battlemaster Skarch Vaunk."}]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Episode I: The Phantom Menace: The Official Souvenir Magazine","elements":[]},{"text":"Star Wars: Episode I toy line","elements":[]},{"text":"Star Wars: Power of the Jedi","elements":[]},{"text":"Star Wars: The Complete Visual Dictionary","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Essential Chronology","elements":[]},{"text":"\"Who's Who in the Jedi Order\"—Star Wars Insider 62","elements":[]},{"text":"Coruscant and the Core Worlds","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":" \"The University of Sanbra Guide to Intelligent Life: The Anx\"—Star Wars Gamer 7","elements":[]},{"text":"The Wildlife of Star Wars: A Field Guide","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":"The Clone Wars Campaign Guide","elements":[]},{"text":"The Jedi Path: A Manual for Students of the Force (real-life book)","elements":[]},{"text":" Horox Ryyder in the Databank","elements":[]},{"text":"\"Rogues Gallery: An Audience of Aliens\"—Star Wars Insider 131","elements":[]},{"text":" The Creatures of Episode III on StarWars.com","elements":[]}]}],"images":[]}]}