{"sections":[{"title":"Anomid","level":1,"content":[{"type":"paragraph","text":"The Anomids, pale-skinned humanoids native to Yablari, were among the galaxy's wealthiest societies, thanks to their natural technical aptitude. Anomids had long been part of the Galactic Republic, and were seen throughout the populated galaxy as technicians, explorers, or tourists."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Anomids were tall, well-built humanoids ranging from 1.7 to 1.9 meters tall. Anomid skin was translucent with a faint coloring ranging from a light violet to a pale purple and was smooth, but wrinkled with age. They had large, slender hands with six fingers on each; two end fingers, two center fingers and two thumbs, with a sharp claw on each. The fingers were paired in twos and slightly spaced apart from the others. The eyes of the Anomids were solid, with no visible irises or pupils and have been seen in varying shades of yellow or blue. The Anomids had pointed, fin-like ears that protruded from the sides of their heads. Anomid hair was often long and well kept, and were always found in shades of black, gray or white. Some Anomids had bald domes with wrinkled skin and sparse hairs, though this could have been an effect of aging as other, presumably younger, Anomids were seen with full heads of hair. The most notable thing about Anomids, appearance wise, were the metallic, often elaborate and aesthetic masks they wore on the bottom half of their faces. These were not breathing masks, as many offworlders might have assumed, but rather vocalizer units. The Anomids were born without vocal chords so many decided to adorn their faces with these machines to better communicate with the galaxy, as learning or even understanding the six-fingered sign language of the Anomids was difficult to near impossible for most humanoids or humanoid-built droids."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Anomids almost always wore elaborate masks which covered most of their faces. These were not breath masks, but vocalizer units. Since Anomids had no vocal cords, they relied on these vocalizer masks to communicate with other species. These masks were often elaborately customized to reflect an Anomid's social status, family origin, or profession. Among themselves, Anomids communicated using an elaborate sign language. Anomid sign language required six-fingered hands, which made it difficult for Humans or Human-programmed protocol droids to use."},{"type":"paragraph","text":"Anomids were governed by a Central Council, whose members were appointed by regional groups of techno-nobles, scholars, and business leaders for one to seven year terms. Their legal system was cumbersome, as laws were never repealed. Instead, new laws were added to counter or modify old ones. Offworlders often studied the intricacies of the Anomid legal system, either for ideas for their own legal systems, or as examples of what not to do."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20070105115127\/starwars\/images\/thumb\/4\/47\/Anomidgg12.jpg\/200px-Anomidgg12.jpg","caption":"Anomids with vocalizers."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Anomid civilization had a long history of pacifism and technical achievement. Though they developed hyperdrive technology first, they did not leave their home system for a century. They finally sent probes to other systems when a drought threatened food production on their home planet, by the year 15,000 BBY. After coming across a Duros colony which could bolster the Yablari system's food supplies, the Anomids developed a strong interest in meeting other cultures. They soon became active members of the Galactic Republic, learning technologies and other ideas from foreign cultures in order to benefit their society. Among the first technologies they acquired were advanced Ithorian agricultural techniques, for which the Anomids were always grateful. Much of the technology developed or acquired by the Anomids had to do with agriculture—food was the main export and import to the Yablari system. They were also experts in the miniaturization of computer components, though they refused to work on computers with military applications."},{"type":"paragraph","text":"Most Anomids were pacifists—historians believed that no major wars had ever been fought in the Yablari system. However, around 50 BBY, a nonconformist subculture developed among the younger Anomids. These nonconformists wore light, sleeveless clothes rather than the oversized robes favored by most Anomids, and rejected their traditional pacifist ideals. In the years preceding the Clone Wars, many Anomids living on Coruscant were afflicted with an outbreak of Brainworm Rot Type A, as were Wol Cabasshites."},{"type":"paragraph","text":"During the Imperial era, the Central Council was internally divided, but supported the Empire for the good of the Yablari system. Rebel operatives, on the other hand, liked to befriend Anomid travelers who might be persuaded to give money to the cause. Some Rebel safeworlds used Anomid food technology to stretch limited supplies."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20091221004338\/starwars\/images\/thumb\/9\/9c\/Anomid_RM.png\/200px-Anomid_RM.png","caption":"Anomids on Aris."}]},{"title":"Anomid in the galaxy","level":2,"content":[{"type":"paragraph","text":"Anomids who ventured away from their homeworld typically were rogues or nonconformists whose political ideologies clashed with that of their homeworld's Central Council. During the Great Galactic War and the ensuing Cold War, most Anomids sided with the Republic, while those marauders found throughout the galaxy could be found with a number of allegiances, including the Hutt Empire and Darth Malgus' Sith Empire in an organization known as the Schism Collective. Others sought new technologies or corporate connections which could be made in other regions of the Republic. Rarely getting involved in any form of military or defense force, Force-sensitive Anomid were drawn to the ideology of the Jedi Order."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic 32: Vindication, Part 1","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"Star Wars: The Old Republic: Shadow of Revan","elements":[]},{"text":" One Night at the Dealer's Den on The Old Republic's official website","elements":[]},{"text":" Port Crowding Increases Virus Risks—HoloNet News Vol. 531 51","elements":[]},{"text":"Shadow Games","elements":[]},{"text":"Rebel Dawn","elements":[]},{"text":"Riders of the Maelstrom","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 11: Criminal Organizations","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Wretched Hives of Scum & Villainy","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Art and Making of Star Wars: The Old Republic","elements":[]},{"text":"Star Wars: The Old Republic Explorer's Guide","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":"Star Wars: The Old Republic Encyclopedia","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Anomid on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}