{"sections":[{"title":"Araquia","level":1,"content":[{"type":"paragraph","text":"The Araquia were arachnoid sapients indigenous to Kirtania."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Description","level":2,"content":[{"type":"paragraph","text":"Native to the planet Kirtania, the Araquia were large six-legged sentient arachnoids. They were colored greenish-black, and their faces featured six black beady eyes and mandibles. Omnivores, the Araquia's main diet was rodents, insects and birds."},{"type":"paragraph","text":"An arachnid species, the Araquia had the ability to spin sticky webs from their own body. They used these webs for a variety of purposes. They could use the anchor strands to lower themselves to the ground, or create elaborately spun webbing platforms. These platforms could be cut loose by the Araquia and used to glide on prevailing winds. The Araquia had minimal control over the glide, relying on updrafts and wind conditions to reach higher altitudes, although they could fill their bodies with air to make themselves lighter during the flight. The webs could also be used to catch prey, such as shooting the web at an opponent and ensnaring them, or by cutting loose a web platform and dropping it on prey from above. The stickiness of the web hindered whoever was caught up in it, but the Araquia were not bothered by it. The Araquia possessed a paralyzing bite that they employed against opponents and prey once they were caught. The paralytic in the bite did not disrupt a target's autonomous nervous system."},{"type":"paragraph","text":"Araquia were organized into tribes headed by a council and a witch doctor. Araquia were generally pacifistic, and did not like to kill except when it was necessary for them to eat. They refused to prey on fellow intelligence species, finding the concept to be repugnant and disturbing."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Araquia once numbered in the thousands on their homeworld of Kirtania, until Human colonization occurred. Human disturbance of Kirtania's natural environment and a misunderstanding between the two species led to the Araquia being hunted and nearly exterminated as a threat during the early years of colonization. By the time of the Galactic Civil War, the Araquia numbered around 1,500 individuals. Self-proclaimed overlords and protectors of Kirtania's forests and woodlands, the Araquia tribes made their homes in the lower canopies of forests where their webs trapped prey for them to eat."},{"type":"paragraph","text":"The Araquia's affinity with their natural environment led them to gain an extensive knowledge of the planet's plant life, and Araquia experts were instrumental in developing cures for rare diseases throughout the galaxy. The Araquia acted as guides to those wishing to enter the rain forest, and educated beings in the value of the forest. They harvested the plants, roots and fungi of the forests, and the production of medicines become one of Kirtania's chief exports."},{"type":"paragraph","text":"During the Galactic Civil War, the rulers of the state of Kinkosa invited the Galactic Empire to the planet. In exchange for favorable trading terms over the other economic states on the planet, the Kinkosans gave over a large swathe of their territory to the Empire to build a supply station. The Imperials began a campaign of deforestation, and noted Araquian scientist Doctor T'Jaleq Kith'Araquia attempted to reason with the Imperials to stop. When that failed, he attempted to get legislation passed to stop the Imperial's destruction of the forest. The Empire labelled Kith'Araquia as a Rebel sympathizer and was set to arrest him, but the doctor was tipped off. He and his tribe retreated into the rain forest to prepare for a war to protect their ecosystem."},{"type":"paragraph","text":"Doctor Kith'Araquia acted as his tribe's military strategist and witch doctor, directing a campaign against the Imperial forces engaged in the destruction of the rain forest. Due to their pacifism, they limited their assaults to property and equipment, hoping to make the Imperial operation in the forest too costly to continue."}],"images":[]},{"title":"Araquia in the galaxy","level":2,"content":[{"type":"paragraph","text":"The most famous Araquia was Doctor T'Jaleq Kith'Araquia who, alongside the noted Ho'Din pharmacologist Sirta Kum, developed the cure for the Direllian Plague."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"The Quality of Mercy\"—Star Wars Adventure Journal 1","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Alien Encounters","elements":[]}]}],"images":[]}]}