{"sections":[{"title":"Anointed People","level":1,"content":[{"type":"paragraph","text":"The Anointed People were a species of sentient reptiles native to the planet Abonshee. Their bodies were sturdy and roughly humanoid, standing on two feet with a tail used for balance. Members of the species used sharp teeth and a spiked tail as natural weapons and hard, green skin as armor. As of 1 ABY, the Anointed People had a feudal society divided into castes, including the working-class Unwashed and the ruling Godlings, all serving a planetary monarch known as the Godking."},{"type":"paragraph","text":"The galactic community believed them to be a primitive and hostile species, based on obsolete scouting reports from the time of the Galactic Republic that portrayed the Anointed People as a non-technological, unsophisticated species that constantly waged civil wars. However, soon after the Battle of Yavin, representatives of the Alliance to Restore the Republic rediscovered the Anointed People and found them to be intelligent and sophisticated, if still not technological. By that point, the Anointed People, mostly under the rule of Godking Trisstan, had made important social advances, replacing their constant warring with a sport-like activity."},{"type":"paragraph","text":"The agents of the Alliance tried to convince the Anointed People to join their faction in the Galactic Civil War, but Godking Trisstan was reluctant to agree: he had recently been the victim of Jayhawk, a con artist who claimed to be a member of the Alliance. Trisstan tested the might and the nature of the aliens before deciding. The Anointed People eventually joined the Alliance in their fight against the Galactic Empire and fought Imperial stormtroopers when the Empire landed on Abonshee."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The self-designated Anointed People were a sentient species that evolved on the planet Abonshee. The Anointed People were reptiles, like many of the animal lifeforms on their planet, and like most reptiles, they lacked hair. Although their precursor species were four-legged, non-shelled, scaled animals, they evolved into anthropoids that walked on two legs—with their long tail providing additional balance. They also evolved strong bones that protected them from bludgeoning damage."},{"type":"paragraph","text":"The Anointed People had natural weapons in the form of a thagomizer—a spiked tail—and that of big, pointed teeth in their narrow, long heads. They had hard, green skin that provided them with a natural armor against physical and, to a lesser extent, energetic damage. Generally stronger and taller than Humans, members of the species ranged in height from 1.5 to 2.5 meters. As a norm, the Anointed People were clumsier and less dexterous than Humans."}],"images":[]},{"title":"Society and culture","level":2,"content":[],"images":[]},{"title":"Hierarchy","level":3,"content":[{"type":"paragraph","text":"During the last years of the Galactic Republic and until at least the time of the Galactic Civil War, the Anointed People lived in a feudal society, primitive by galactic standards.Political power was centralized in the hands of one individual, known as the Godking. This person's subjects belonged to two classes: the Unwashed and the Godlings. The Unwashed were stout serfs and workers, while the Godlings were aristocrats, ruling over a number of Unwashed individuals—mostly through verbose and meaningless speeches—and in turn obeying the Godking's orders. Some Godlings also occupied roles as the Godking's aides. Both groups favored brightly-colored clothing; the Godlings enjoyed expensive scale armor while the Unwashed were permitted to wear only common robes. As of 1 ABY, parts of their grandiose pomp and nobiliary titles were only symbolic remnants of a previous age, lacking any practical value."},{"type":"paragraph","text":"The aristocracy kept the Unwashed content but uneducated, and they were unaware of life on other planets beyond their native Abonshee, a place called \"Masterhome\" by the locals. Consequently, the Unwashed concentrated their leisure time in domestic ventures and entertainment, such as drinking distilled beverages and gambling. In contrast, the Godlings were aware of intelligent life from beyond the stars and understood that it could be a great opportunity for them; at the same time the Godlings were frightened by their limited knowledge of life beyond the stars, including ignorance of the goals and abilities of those aliens. As such, the Godlings were commonly cautious when dealing with alien sentients, directing them to the Godking."},{"type":"paragraph","text":"The Godking dynasties were selected from among the Unwashed families. The Godking was supposed to retain power only as long as he could stop any Godling from overthrowing him. As such, the Godking commonly tried to manipulate ambitious aristocrats into infighting and internal rivalries."}],"images":[]},{"title":"Technology","level":3,"content":[{"type":"paragraph","text":"With a medieval technological level, and no proof of more advanced technology on their planet, the Anointed People were technologically unsophisticated by the standards of spacefaring cultures. They used carts pulled by draft animals and had the usual problems of pre-industrial societies, including poor medical care and a high rate of infant mortality."},{"type":"paragraph","text":"With their limited mechanization, the Anointed People built homes from stone and wood, commonly a one- or two-floor house or farm in a forest clearing. The Godlings lived in small castles, built as military structures and usually surrounded by five-meter high walls and a moat, with a personal guard of fifteen People. The castle was commonly built near some water well or a path crossing, and some two dozen houses surrounded it, forming a town. Individual farms could be beyond the sight of the castle."},{"type":"paragraph","text":"The greatest city of the northern hemisphere, which was the seat of the Godking government, was inhabited by twenty thousand Anointed People, spaced across six square kilometers. The Godking lived in a palace, three times as large as any Godling castle, baroquely decorated with tapestries and full of courtesans and pages. Its guard also tripled the defense complement of any Godling."},{"type":"paragraph","text":"For large engagements, the Anointed People used catapults and ballistas. Typical melee weapons used by the Godlings included broadswords and shields, while the Unwashed had to make do even more primitive clubs. For hunting, some males used only a bag and a spear; with just these tools, they still managing to capture forest-dwelling griffs, whose meat was considered a delicacy. However, none of this gear was enough to deal with the gargantuan local predator known as the eater. Some wealthy males rode the native likka, using reigns tied to the beast's eyelids."},{"type":"paragraph","text":"The Anointed People were known to use gold and jewelry in their treasure, and silver to build the crown of the Godking."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100719093933\/starwars\/images\/thumb\/0\/0d\/Anointed_People_architecture.png\/180px-Anointed_People_architecture.png","caption":"Construction was primitive among the Anointed People."}]},{"title":"Customs","level":3,"content":[{"type":"paragraph","text":"Although not technologically sophisticated, the Anointed People had a complex culture. Having previously been a warlike people, they adapted and changed to minimize bloodshed as much as possible—in part, because they considered physical bloodshed to be aesthetically unpleasant, but also because they erroneously believed advanced civilizations, such as a galaxy-spanning ones, would naturally tend to be peaceful."},{"type":"paragraph","text":"By the time of the Galactic Empire, the Anointed People had renounced waging violent civil wars against each other. However, due to their tendency to respect and maintain ancient traditions, the Anointed People evolved this practice by fighting mock battles. Every spring, almost every Godling would recruit his or her vassals, equip them, and go to a neighboring castle. The marching army would then formally challenge the other Godling to battle and wait for that person to arrange his or her own army. The resulting battle used only clubs—no edged weapons—meaning that the strong bones of the Anointed People protected them from permanent damage; the bludgeoning weapons rarely caused real injuries, and any damage inflicted was comparable to what might be expected from a sports match."},{"type":"paragraph","text":"Eventually, one of the belligerents would surrender or retire. Custom dictated that the losing Godling pay tribute to the victor, commonly sponsoring a three-day fiesta for both armies. The Unwashed particularly enjoyed these events, taking the opportunity to dress in comical clothes, see other lands, meet potential mates, and most of all, thrill at the final jamboree."},{"type":"paragraph","text":"The Anointed People had a language that outsiders could learn using recorded tapes."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Anointed People evolved on Abonshee, a temperate planet with moderate seasonal variation and abundant and diverse plant and animal life. Located in the Colonies' Fakir sector, the planet was well outside the sector's trade routes. From reptiles with four legs and scales, they developed into two-legged humanoids with a spiked tail and natural armor in the form of hard skin and strong bones. Traditionally a bloodthirsty, militaristic species, the Anointed People were frequently involved in armed territorial disputes during their early history. As a consequence, they constructed fortified strongholds, with villages clustering around such structures for protection. Power became centralized in the Godking; however, the position was coveted and so the Godking was almost constantly trying to quell rebellions."},{"type":"paragraph","text":"Circa 89 BBY, a scout starship of the Galactic Republic visited Abonshee, met the locals, and received a hostile reception. The explorers recorded their observations of the Anointed People, including their technology level, social structure, and hawkish attitude. Their computer tapes also included a translation program for the local language and a warning for visitors to the planet."},{"type":"paragraph","text":"Soon afterward, around 74 BBY, the last real civil war on Abonshee ended, and the practice was replaced with the spring tradition of simulating a war. Around 39 BBY, a crafty individual known as Trisstan became the Godking of Abonshee. Initiating a visionary taxation policy and good public relations, Trisstan brought unparalleled freedom and prosperity to the world."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20100719100033\/starwars\/images\/thumb\/c\/c6\/Godking%27s_castle.png\/180px-Godking%27s_castle.png","caption":"Prisons within the Godking's castle"}]},{"title":"The Rebel Alliance","level":3,"content":[{"type":"paragraph","text":"In 19 BBY, the Galactic Empire became the governing body of the galaxy. The Empire sent no forces to Abonshee, believing the planet lacked any notable resources and that the reportedly truculent Anointed People would require a significant investment of time and forces to pacify."},{"type":"paragraph","text":"Around the time of the Battle of Yavin, Abonshee was visited by a Human known as Jayhawk. This offworlder presented himself as a representative of the Alliance to Restore the Republic who wanted to meet and negotiate with the Godking. In reality, Jayhawk was a con artist, with no affiliation to the Alliance. He claimed that the Alliance wanted the Anointed People to join the Rebellion against the Empire and offered to exchange an elixir of eternal life for their support. Godking Trisstan met with Jayhawk for several days, until Jayhawk killed two guards, stole hundreds of kilograms of gold and jewels from the royal treasury, and left the planet at night. Realizing he had been deceived by the Human, Trisstan silenced any reference to this event."},{"type":"paragraph","text":"Contemporaneously, the Alliance—unaware of Jayhawk's deceitful activities—sought to enlist Abonshee in their rebellion. The Alliance representatives in the Fakir sector, Reekeene's Roughnecks, sent a starship, the Long Shot, containing Green squad, to open diplomatic relations with the Anointed People and to buy food in exchange for technology and qualified staff—munitions, however, were excluded from their tradeable commodities. The Anointed People greeted the Rebels with civility to the surprise of their guests, who, provided only with the obsolete data of the Old Republic explorers, expected to find bellicose locals. The Rebels were directed to the Godking to draft a treaty."},{"type":"paragraph","text":"The Godking, still smarting from his encounter with Jayhawk, had reservations over trusting the newcomers. Accordingly, Trisstan decided to clandestinely test their rectitude: should their resulting behavior be innocent, he would apologize, reveal the history of his encounter with Jayhawk, and place his support behind the Rebellion. However, if their behavior revealed deceit, he would imprison them. He tested the foreigners through questioning and other means to determine their honesty, physical strength, greed, alertness, technology, and skills. For instance, on Trisstan's secret orders, the Godling Satrank pretended to be a conspirator wanting the Rebels to join him in overthrowing Trisstan."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20080327094118\/starwars\/images\/thumb\/6\/67\/TheLongShot.jpg\/180px-TheLongShot.jpg","caption":"The crew of the Long Shot made contact with the Anointed People."}]},{"title":"Imperial intervention","level":3,"content":[{"type":"paragraph","text":"While Green squad was negotiating on Abonshee, the Resurgence, an Imperial shuttle that was ferrying Lord Dixton, Governor General of the Fakir sector, and his entourage, suffered damage in a skirmish and was forced to land on the world to perform necessary repairs. The crew of the Long Shot detected the shuttle arriving and escaped to hyperspace, leaving the diplomats behind but promising to return as soon as they could get some military reinforcements."},{"type":"paragraph","text":"The shuttle landed, and some thirty stormtroopers were deployed around it. Seeing this, Godking Trisstan sent Godling Grissom as his emissary, accompanied by an honor guard of twenty-five soldiers of the Anointed People. The stormtroopers ordered the Godling to stop in the name of the Emperor and, when Grissom did not comply, the troops fired on Grissom, the guards, and several nearby civilians. Hearing word of this unprovoked assault, Trisstan retreated to the palace and officially joined the Rebel Alliance in the name of Abonshee."},{"type":"paragraph","text":"Not a military strategist, Trisstan wanted to expel the invaders, but he could not come up with a better plan than a frontal assault with two hundred soldiers that would result in the death of seventy-five percent of the warriors. The Anointed People were prepared to fight even at such odds, but Trisstan appealed for any advice that could minimize casualties."},{"type":"paragraph","text":"Together, the Anointed People and the Rebel diplomats battled the Imperials and, eventually, were joined by the returning Long Shot with two X-wing starfighters and one Light Cruiser, achieving victory against the invaders. The Anointed People received all the visiting Rebels with a large party, and the diplomats were proclaimed \"Heroes of the Realm\" and knighted \"Assistant Demi-gods\" before leaving the planet."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100517093141\/starwars\/images\/thumb\/0\/0e\/Anointed_v_Stormtroopers.png\/180px-Anointed_v_Stormtroopers.png","caption":"The Anointed People battle Imperial stormtroopers."}]},{"title":"Anointed People in the galaxy","level":2,"content":[{"type":"paragraph","text":"Before their contact with the Alliance to Restore the Republic, the Anointed People had little presence outside of Abonshee. Afterward, the Alliance was happy to accept any individual wanting to join their army. Also from this time on, the Empire took interest in the Anointed People and went to the planetary surface of Abonshee to fight them."},{"type":"paragraph","text":"Beyond that, the Anointed People showed little need to visit other planets or the space between them. The Godlings were uninterested in far away places, and the Unwashed rarely believed in, or cared about, such things even when faced with them directly."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Anointed People first appeared in \"The Long Shot Campaign,\" a chapter of the role-playing book Star Wars Campaign Pack, written by Paul Murphy and published by West End Games in 1988 for Star Wars: The Roleplaying Game. \"The Long Shot Campaign\" includes drafts of several adventures that the gamemaster can expand with more details; one of these, \"Tests of the Godking,\" includes information on the Anointed People, presented both as a draft and as an already-expanded adventure, ready to be played. \"The Long Shot Campaign\" was later re-published in 1994, along with another campaign, in Classic Campaigns. \"The Long Shot Campaign\" mentions that Jayhawk visited Abonshee several years before the events in the adventure, and then contradicts itself saying that Jayhawk had visited Abonshee only months before the events in the adventure. This article assumes that the event had been recent."},{"type":"paragraph","text":"The book Star Wars Miniatures Battles (1991), also published by West End Games, includes an image of miniatures of the \"Anointed People\" fighting against invading Imperial stormtroopers. The caption identifies the miniatures as \"lizard men,\" sculpted by Grenadier Models, Inc. for a different role-playing game, Martial Metals, and Ral Partha. The cabin in the background is identified as a product of Gallia Reproductions, and the stormtroopers, not identified, are the only figures specifically made for the Star Wars roleplaying game; they were also sculpted by Grenadier Models, Inc., the authorized distributor for West End Games' Star Wars roleplaying game. The caption is not specific enough to define whether this is a graphic depiction of the events in \"The Long Shot Campaign\" or a representation of further happenings: \"The Long Shot Campaign\" describes that the battle is inevitable and that it would probably take place with the Anointed People attacking the Imperial headquarters around a shuttle, while Miniature Battles show Imperial stormtroopers attacking a house or a village of the Anointed People that does not coincide with the description of the capital city in \"The Long Shot Campaign.\" However, \"The Long Shot Campaign\" does not describe the Battle of Abonshee in detail, and as such this article does not include information about the battle under \"History.\""},{"type":"paragraph","text":"In 1998, Alien Encounters adds new information to the background of the species and repeats some previously-known data. No canonical source has mentioned the singular form for \"Anointed People.\" The reason for their name, why they consider themselves to be anointed, and by whom, has also not been explained."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"The Long Shot Campaign\"—Star Wars Campaign Pack","elements":[]},{"text":" \"The Long Shot Campaign\"—Classic Campaigns","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars Miniatures Battles","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":"The Essential Atlas","elements":[]}]}],"images":[]}]}