{"sections":[{"title":"Asogian","level":1,"content":[{"type":"paragraph","text":"Asogians were paddle-footed, large-eyed sentients indigenous to Brodo Asogi. During the last decades of the Galactic Republic, the Asogians were represented in the Galactic Senate by Senator Grebleips and a trio of aides. More than twenty years later, during the Galactic Civil War, an Asogian infochant named Braxas operated on the Outer Rim planet of Solay."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Asogians were paddle-footed sentients, small-sized and squat, with long arms that could touch the ground as they walked. Their hands ended in four long fingers. Their head, dominated by two large eyes, was perched atop an extensible neck. Some Asogians had brown, completely hairless skin, while others were yellow-skinned with scattered black hair on the head. Possible eye colors included blue and red."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Like many other species, including the reptilian Anx of Gravlex Med, and the furry Togorians of Togoria, the Asogians routinely went about their business unclothed. They used grub-sticks as eating ustensils, and at least some of them consumed meat."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The Asogians hailed from Brodo Asogi, a planet located in the Perinn sector of the Outer Rim Territories. At some point, they joined the Galactic Republic, the democratic union that governed most of the galaxy."}],"images":[]},{"title":"Asogians in the galaxy","level":2,"content":[{"type":"paragraph","text":"By 33 BBY, the Asogians were represented the Galactic Senate of the Republic by a Senator Grebleips and three aides. Before the onslaught of the Clone Wars in 22 BBY, Grebleips notably declared his intention to fund an extra-galactic expedition project."},{"type":"paragraph","text":"During the Galactic Civil War, a disabled Asogian named Braxas made a career as an infochant on the planet of Solay, in the Dominus sector of the Outer Rim Territories. When the Galactic Empire seized Solay, the Asogian decided to leave the planet. Braxas then hired Luke Skywalker, a young hero of the Alliance to Restore the Republic and a skilled pilot, to transport him offworld."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20120114183826\/starwars\/images\/thumb\/4\/45\/Brodo_Asogi_Delegation.jpg\/220px-Brodo_Asogi_Delegation.jpg","caption":"Grebleips and the Brodo Asogi delegation in the Galactic Senate."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Asogians originated in Star Wars: Episode I The Phantom Menace, the first movie in the prequel trilogy of Star Wars, as a cameo appearance of the famous aliens of Steven Spielberg's 1982 film E.T. the Extra-Terrestrial. Those creatures were inserted in the movie to make good on a promise—after Steven Spielberg included a Yoda cameo and Star Wars toys in E.T., George Lucas promised to include an E.T. cameo in the next Star Wars film he made—The Phantom Menace. While this was primarily an easter egg, and E.T. is probably not meant to be taken as part of Star Wars canon, some Star Wars references in E.T. can be reinterpreted in light of the E.T. references in Star Wars."},{"type":"paragraph","text":"E.T.: The Book of the Green Planet reveals \"Children of the Green Planet\" to be the translated name of E.T.'s species. It also mentions several names which other alien species have given E.T.'s homeworld, such as Brodo Asogi, all of which translate to \"Green Planet.\" While a species with the same name and appearance is itself part of Star Wars canon, and the homeworld name is given in Cloak of Deception, the species name is not specified."},{"type":"paragraph","text":"When E.T. goes trick-or-treating with the children, he spots a child in a Yoda mask and begins to follow that child saying \"Home… home…\" (Composer John Williams included a snippet of his \"Yoda Theme\" from The Empire Strikes Back to accompany this scene.) This could be interpreted as E.T. recognizing a familiar species from his home galaxy."},{"type":"paragraph","text":"HoloNet News Vol. 531 50 also mentions that Senator Grebleips of Brodo Asogi funded an expedition to another galaxy. This is another reference to E.T., since E.T. visits Earth from another galaxy in the film."},{"type":"paragraph","text":"The name of the Senator itself, 'Grebleips', is 'Spielberg' spelled backwards."},{"type":"paragraph","text":"Pat Welsh, the woman who did the voice for E.T. in E.T. the Extra-Terrestrial, also did the voice for the bounty hunter Boushh in Star Wars: Episode VI Return of the Jedi."},{"type":"paragraph","text":"In his novella SkyeWalkers: A Clone Wars Story, author Abel G. Peña mentioned \"a pair of Asogian grub-sticks,\" which was specifically meant to refer to the chopsticks used by Braxas in Star Wars 89: I'll See You in the Throne Room. In doing this, Peña simultaneously named the species and confirmed Braxas as one of them."},{"type":"paragraph","text":"E.T. also made a cameo appearance in Hate Leads to Lollipops, a light-hearted comic story by David McCaig, where he was seen among the patrons of the Mon Calamari Fish Market. That particular panel also included characters belonging to other science-fiction movies, namely Derek from Teenagers from Outer Space, the Mutant from This Island Earth, and Mac from Mac and Me."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070204235523\/starwars\/images\/thumb\/6\/61\/GreenPlanet.JPG\/180px-GreenPlanet.JPG","caption":"E.T. the Extra-Terrestrial."}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"\"Hate Leads to Lollipops\"—Star Wars Tales 9","elements":[]},{"text":"Cloak of Deception","elements":[]},{"text":"Star Wars: Episode I The Phantom Menace","elements":[]},{"text":"Star Wars: Republic 61: Dead Ends","elements":[]},{"text":"Republic HoloNet News Special Inaugural Edition 16:5:24","elements":[]},{"text":"SkyeWalkers: A Clone Wars Story","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" Phone home on StarWars.com","elements":[]},{"text":"\"Episode I Easter Eggs\"—Star Wars Insider 48","elements":[]},{"text":"\"Star Wars Q&A\"—Star Wars Insider 74","elements":[]},{"text":"\"Classic Moment\"—Star Wars Insider 128","elements":[]},{"text":" Galactic Senate in the Encyclopedia","elements":[]},{"text":"@starwars (StarWars.com) on Twitter","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" The Cinema Behind Star Wars: E.T. the Extra-Terrestrial on StarWars.com","elements":[]}]}],"images":[]}]}