{"sections":[{"title":"Arpor-Lan","level":1,"content":[{"type":"paragraph","text":"Arpor-Lan was the name of a sentient species of Humanoids with horned chins. Coming from Arporatal-Lanin, Arpor-Lans were famous through the galaxy as scouts and trackers. During the last centuries of the Galactic Republic, the Arpor-Lan were slaves to the noble houses ruling the Juvex. Later, some Arpor-Lan became officers of the Alliance to Restore the Republic, such as Lieutenants Deeve and Fraj T'lin"}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and Appearance","level":2,"content":[{"type":"paragraph","text":"Arpor-Lan were sentient Humanoids sharing a general physical outline with Humans: They had two arms and two legs, and continued effort made them hurt. They were known to sweat near their eyes, and they had a versatile enough tongue to manipulate the monitor pads of a breath mask. They were similar enough to Humans to use Human-oriented technology such as a face breather. An Arpor-Lan had hair on the top of the head, like a Human."},{"type":"paragraph","text":"However, the face showed two important disimilarities. The eyebrows of an Arpor-Lan showed external bones as plaques, and the chin showed stubby horns. Some Arpor-Lan tugged their horns or cleared their throats when nervous. Arpor-Lan were not immune to phobias."}],"images":[]},{"title":"Society and Culture","level":2,"content":[{"type":"paragraph","text":"Arpor-Lan's homeworld was Arporatal-Lanin, in the Juvex sector of the Mid Rim. The native Arpor-Lan were galaxy-wide famous as hunters, scouts and trackers."},{"type":"paragraph","text":"In times of the Galactic Civil War, Arpor-Lan travelled through the galaxy. A number of them were armed and instinctively drew a blaster when they felt threatened."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Arpor-Lan were the native species of Arporatal-Lanin, a planet that had not been discovered by the galactic community. Circa 1000 BBY, the tycoon Thull Vandron gathered seventeen noble houses of the Core Worlds and took them to a hidden cluster of worlds. These planets were divided in two groups, Senex and Juvex. Arportal-Lanin was in Juvex, an area that was assigned to Houses Carbinol, Hallikeenovich, Kassido, Kellermin, Mekuun, Pilor, Sisemon and Sreethyn. These aristocrats found native species in their worlds, and spent one century bending them using starships and blaster cannons. Arporatal-Lanin and the other planets in Juvex became property of the aristocrats."},{"type":"paragraph","text":"By 700 BBY, all the native species of Juvex, including the Arpor-Lan, had been enslaved for so long that they deemed freedom an old myth. But by then the Galactic Republic found Senex and Juvex and began a restless relationship with the ruling houses. Republic pilots heard rumors about the enslaved locals. In 553 BBY, a Republic warlord began to free some of the species in the area. During the Fourth Nantama Synod, the Houses joined the Republic, with Senex and Juvex becoming sectors."},{"type":"paragraph","text":"However, the Galactic Senate was unhappy with the slaving ways of the Houses, as they were violating the Rights of Sentience. The Houses demanded that they could keep that integral part of their culture. This led to a number of disputes during the following centuries."}],"images":[]},{"title":"Arpor-Lan in the galaxy","level":3,"content":[{"type":"paragraph","text":"In 0 ABY, a number of Arpor-Lan had joined the Alliance to Restore the Republic. Lieutenant Fraj T'lin, an Arpor-Lan, served in the Rebel base on Yavin 4 soon after the Battle of Yavin. In 2 ABY, the premier scout Lieutenant Deeve was one of the more famous Arpor-Lan in the Alliance, and he also worked for Alliance Intelligence. During the New Republic, Deeve worked for the Bureau of Scouting and Exploration Services of the New Republic."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100701172133\/starwars\/images\/thumb\/3\/3d\/NRSSDeeve.PNG\/180px-NRSSDeeve.PNG","caption":"Deeve, agent of NRSS"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"While Deeve first appeared in Galaxy Guide 8: Scouts (1993), his species was only identified in Alliance Intelligence Reports (1995). The graphic depiction of Deeve in this last book shares several traits with depictions of the Zygerrians."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":" \"A Typical Survey\"—Galaxy Guide 8: Scouts","elements":[]},{"text":"Rebel Force: Renegade","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Alliance Intelligence Reports","elements":[]},{"text":"The Essential Atlas","elements":[]}]}],"images":[]}]}