{"sections":[{"title":"Argazdan","level":1,"content":[{"type":"paragraph","text":"The Argazdans were a green-skinned near-Human species native to the planet Argazda in the Kanz sector. The species developed from a stock of mainline Humans who colonized Argazda when the Galactic Republic was still young. They brought the Vianist faith with them and spread the religion among the other species of the region. The Argazdans became infamous in the galaxy for seceding from the Republic under the leadership of Governor Myrial. The actions of Myrial's supporters—the Myrialites—taken at a time when the Jedi Knights and Galactic Republic were preoccupied with other conflicts, ignited the Kanz Disorders in 3970 BBY. The Disorders were a 300-year period during which the Argazdans enslaved their neighbors, formed an independent navy, and refashioned the Kanz sector as a dictatorship known as the Argazdan Redoubt. Their control of the area wrought profound changes; for example, when Argazdan slave owners forbade the enslaved Human inhabitants of the planet Lorrd to speak to one another, the Lorrdians compensated by developing non-verbal, kinetic communication. Meanwhile, the Argazdans enlisted the aid of an alien scientist who had turned up in the Redoubt. Under her command, the Argazdans ordered enslaved Lorrdians to construct the Slave Pits of Lorrd, a vast structure that housed a biological superweapon. The project came to a halt when Jedi Knights led by the Lorrdian Jedi Mari-Elan Nora attacked the Argazdan Redoubt and won it back for the Republic."},{"type":"paragraph","text":"Although millennia later, the Argazdans had come to view the Kanz Disorders as a black mark on their reputation, outsiders still largely viewed them as cowardly and self-interested by the time of the Galactic Civil War. At least one member of the species, the academic and scientist Doctor Raygar, showed no compunctions about wearing the garb of an Argazdan slave lord, even among former slave species, such as the Lorrdians. Raygar earned a reputation in scholarly circles as an eccentric quester after artifacts he believed to be imbued with power. On one such mission, Raygar sought the weapon hidden in the Slave Pits of Lorrd, while on another he searched for the Sunstar kept by the Ewoks of Bright Tree Village on the Forest Moon of the planet Endor."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"As a sentient species descended from baseline Humans, the Argazdans shared much in common with their genetic forebears. Each member of the species was humanoid in shape, with two arms and legs, a torso, and a head. The Argazdan face featured two ears, two eyes, a nose, and a mouth with Human-like dentition and tongue; these features were capable of forming expressions similar to those that a Human could produce. They had five fingers per hand. However, an Argazdan differed from his or her ancestors due to the species' stark white head hair, prominent facial bones, deep depressions along the temples, light green or yellow-green skin, and yellow eyes. When an Argazdan exhibited bags under his or her eyes, the affected skin took on a darker greenish hue."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"During the early years of their contact with the broader galaxy, the Argazdans were a species prone to profound conservatism. They disdained the culture of the Galactic Republic and considered it morally reprehensible. From their earliest days, many members of the species adhered to a faith known as Vianism, which venerated the goddess Via, whose name simply meant \"goddess\" in the species' native Argazdan."},{"type":"paragraph","text":"Nevertheless, after the Argazdan ruler Myrial purged the Kanz sector of Argazdans loyal to the Republic and declared independence for the sector as the Argazdan Redoubt, the species quickly became known as unrepentant slavers throughout their territory. During the period that became known as the Kanz Disorders, the Argazdans possessed technology on par with the rest of the galaxy, including droids and heavy machines. Still, they relied upon non-lethal weapons such as whips to control the populations they enslaved. One item the Argazdans developed during the period was the Argazdan riot buster, a ranged weapon that knocked down and stunned its target but caused no other harm. The species had a major weapon stored within a structure known as the Slave Pits of Lorrd during the period as well. Argazdan architecture during the Kanz Disorders used black stone as its main construction material. Some Argazdan slavers wore black suits, which consisted of a jacket with tails, a shirt, a pair of pants, and a set of boots. Argazdan slave lords wore a black body suit, complete with a partial red cape, tall, curved shoulder guards, and a form-fitting hood with a pointed crest on its top."},{"type":"paragraph","text":"The Kanz Disorders sullied the Argazdans' reputation such that they were long regarded as craven and opportunistic in the wider galaxy. However, by the time of the Galactic Civil War, most Argazdans felt ashamed about their species's role in the Kanz Disorders. They had made amends with at least one of the species they once had subjugated, the Lorrdians, and members of the former enemy species lived side-by-side on the planet Lorrd. Nevertheless, at least one Argazdan, an academic known as Doctor Raygar, felt no compunction about sporting the attire of an Argazdan slave lord in public on Lorrd. Other Argazdans on the world took great offense to his outfit, and some even spat upon the scholar for his mode of dress."},{"type":"paragraph","text":"In addition to their native tongue, Argazdans were capable of learning to speak Basic and at least one language from the Forest Moon of Endor."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20090725013418\/starwars\/images\/thumb\/b\/b2\/Raygar_bust.jpg\/180px-Raygar_bust.jpg","caption":"The attire of the Argazdan academic Raygar was associated with the Argazdans' slaver past."}]},{"title":"History","level":2,"content":[],"images":[]},{"title":"Early history","level":3,"content":[{"type":"paragraph","text":"The Argazdans were descended from Human colonists from the Core who settled on the planet Argazda during the early years of the Galactic Republic. After establishing themselves on the cool, wooded world, the settlers lost contact with the Core and developed independently. They evolved into a distinct species, characterized by green skin, white hair, and a distinctive facial structure. The Argazdan language evolved with them."},{"type":"paragraph","text":"The colonists retained at least some knowledge of space flight, and they made contact with neighboring species and cultures. The Argazdans had brought with them the religion of Vianism, and their missionaries converted members of neighboring groups, including the Sipsk'ud species and the Lorrdian Humans."},{"type":"paragraph","text":"Argazda re-established contact with the rest of the galaxy at some point between 5,000 and 4200 BBY. Circa 4,200 BBY, the Argazdans had come under threat from a species known as the Ereesi, who were intent on enslaving the green-skinned humanoids. Argazda lay beyond the borders of the Galactic Republic at the time, so the Argazdans petitioned the galactic government to admit them as a member world and thus permit Republic forces to protect them from the Ereesi threat. Although the planet was located far from any stable trade route, the Galactic Senate overcame its misgivings and voted to admit Argazda and its neighboring region as the Kanz sector and thus to bring the area under Republic protection. Republic forces voyaged to the newly admitted territory and battled the Ereesi on the Argazdans' behalf, but the encounter with the allies from outside the region shocked and dismayed the Argazdans, who found their visitors heinous and immoral. Still, the Republic abated the threat posed by the Ereesi and turned military operations over to the Argazdans once the species was deemed capable of handling the conflict on their own."},{"type":"paragraph","text":"The war brought the Kanz sector and the Argazdan homeworld within the confines of the known galaxy. The world eventually became a stop on the Veragi Trade Route. Argazda became part of a larger region known as the New Territories."}],"images":[]},{"title":"The Kanz Disorders","level":3,"content":[{"type":"paragraph","text":"Myrial, the female Argazdan who was serving as the provisional governor of Argazda, carefully cultivated her power base in the region over several years: she weeded out opponents in the sector fleet and established a spy network. In 4000 BBY, Myrial felt the time was ripe, so she ordered Argazdan supporters of the Republic killed in mass executions and around 3970 BBY declared the independence of the Kanz sector, which she renamed the Argazdan Redoubt, with her as the dictator. The beleaguered Republic, facing a new threat in the form of the Mandalorians, was embroiled in the Mandalorian Wars. With the Jedi Knights and Republic occupied by the conflict, Myrial quickly established an Argazdan battle fleet, which she dispatched to Ereesus. There, the fleet's weaponry scoured the surface of the planet and destroyed all life on the Ereesi homeworld. The event marked the beginning of a period of turmoil that would come to be called the Kanz Disorders."},{"type":"paragraph","text":"Myrial's followers became known as Myrialites. Over the next three centuries, the Myrialites transformed the Redoubt into a site of constant conflict and destruction as they dropped bombs on recalcitrant worlds and enslaved rebellious groups to serve as laborers for Argazdan colonists to their worlds or else for sale on the slave market. Pleas by the Argazdans' victims to the Republic went unheeded as the galactic government struggled to survive its own travails."},{"type":"paragraph","text":"When a resistance movement began on the planet Amaltanna, the inhabitants of a neighboring planet, Lorrd, joined forces with them to resist Argazdan expansionism. In retaliation, Myrial ordered Lorrd bombarded with ordnance and the Lorrdian species enslaved. The Argazdan attack damaged major cities, such as Frezen and New Shallos. Argazdan warriors landed on Lorrd and carried out the order. The Argazdan forces tracked Lorrdian refugees to Kinyov province, where they were rounded up to be enslaved, with some destined for sale offworld. The Argazdans established their Lorrdian headquarters in a small Kinyov city known as Qatamer. Soon, Argazdan slave lords were commanding Lorrdian slaves in such tasks as constructing fortresses from black stone from which their masters could govern the world. The Argazdans found non-lethal weapons to be a prized commodity, including the Argazdan riot buster."},{"type":"paragraph","text":"The Argazdans faced the Sisterhood of the Glorious Radiance, a sect of the Vianism religion, which had attracted Force-sensitives to its fold. The Myrialites forbade the enslaved Lorrdians to speak to one another, but the Sisters of the Glorious Radiance began teaching non-Force-sensitive Lorrdians to read body language and gesture so as to permit secret communication. The Sisters' status as members of the Vianist religion, widespread among the Argazdans as well, sheltered them from Argazdan reprisals, although the green-skinned species suspected complicity between the Sisterhood and local resistance movements. Eventually, Myrial ordered the Sisters relocated to Lorrd II, the planet's moon, a move that isolated the Sisters from the rest of the Lorrdian population. Near the end of the Mandalorian Wars, the Argazdans faced an early incursion by the Jedi Knights when the rogue Jedi Revanchists raided the moon and liberated the slaves there to gain access to Lorrdian gemstones, which were useful as lightsaber crystals."},{"type":"paragraph","text":"Although Argazdan slavery of Lorrdians continued on Lorrd proper, by the time of the Sisters' relocation, the spread of kinetic communication and the reading of subtle body language had become widespread among the enslaved Lorrdians. Unbeknownst to the Argazdans, the Lorrdians learned to decipher their masters' body language, facial expressions, and vocal inflections, an ability that allowed the Lorrdians to endure their subjugation. Meanwhile, the Argazdans faced a Lorrdian guerrilla movement that consisted of several divisions that could communicate with one another and organize strikes silently without the Argazdans' notice. Meanwhile, other conflicts erupted in the greater galaxy that further preoccupied the Republic, such as a G0-T0 droid revolt in the Gordian Reach in 3946 BBY."},{"type":"paragraph","text":"Nearly 300 years after the declaration of the Argazdan Redoubt's independence, Argazdan patrols discovered an alien artisan and scientist who had arrived in the area after an experimental star drive had blasted her there. When Argazdan scientists revived the alien from stasis, linguists tried unsuccessfully to learn her language. Nevertheless, she learned the Argazdan tongue. The outsider was in reality a Yuuzhan Vong shaper, but to the Argazdans, she was a demonic alien and habensa, the Argazdan word for \"one who builds\" or \"one who shapes.\" In a bid to maintain his power in the face of growing opposition from the Galactic Republic, the Argazdan Regent, Torphceris, struck a deal with the habensa: he ordered the Lorrdians to begin work on their planet on a construction project that became known as the Slave Pits of Lorrd. Despite the availability of heavy machinery on the planet, the stranger forbade the Argazdans to use advanced technology in the pits' construction. Instead, the Argazdans commanded the Lorrdians to dig the pits out by hand, harsh conditions that killed thousands of Lorrdians. Within the bowels of the site, the Argazdans sheltered a major weapon, a bioengineered monster hidden behind a hefty door that opened only upon the commission of a Human sacrifice."},{"type":"paragraph","text":"Ultimately, however, the Argazdans proved unable to overcome the guerrilla resistance offered by the Lorrdians, which helped usher in the end of Argazdan domination on the world and in the Argazdan Redoubt more broadly. By 3670 BBY, five billion sentients had died in the Kanz Disorders. That year, the Jedi Order had sufficiently recovered from its losses in the Mandalorian Wars and moved to stem the violence in the former Kanz sector. Despite the Republic's continued engagement with another war against the Sith, the Jedi had enough support in the Galactic Senate for military intervention. The Lorrdian Jedi Knight Mari-Elan Nora led a joint Jedi and Republic task force to liberate the Kanz Sector. During the assault, Nora claimed that she witnessed Argazdan soldiers fleeing into the bowels of the Slave Pits of Lorrd, chased by Jedi; nevertheless, none who entered ever re-emerged. Despite dogged resistance from the Argazdans, the Jedi and Republic forces triumphed. The Argazdans and the Argazdan Redoubt—renamed the Kanz sector—were placed under the protection of Nora as the region's Jedi Watchman until she was killed by slavers on the planet Noremac."},{"type":"paragraph","text":"The turmoil convinced the Republic to be far more careful about admitting far-flung worlds to join the government. The Republic also became reluctant to send more colonists to the Kanz sector. The Kanz Disorders remained well known in the galaxy for millennia. The events served as a rallying point for both advocates of a more interventionist central galactic government and a more conservative government that did not extend its borders beyond its own means to protect them."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20110728033027\/starwars\/images\/thumb\/3\/37\/Kanz_Disorders.jpg\/180px-Kanz_Disorders.jpg","caption":"Argazdan overlords enslaved the Lorrdians during the Kanz Disorders."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20120306153150\/starwars\/images\/thumb\/6\/60\/Death_and_Slave_Pits_for_kids.png\/180px-Death_and_Slave_Pits_for_kids.png","caption":"The Slave Pits, as drawn by Tash Arranda in 0 ABY"}]},{"title":"Later history","level":3,"content":[{"type":"paragraph","text":"The Argazdan homeworld featured in later conflicts as well. During the Clone Wars, Argazda allied with the Confederacy of Independent Systems. By the time of the Imperial Period, the events of the Kanz Disorders were a legend not only among the Argazdans but in the galaxy at large. The strange alien for whom the Slave Pits had been built took on the status of a myth, a demon with whom the Argazdans had made a deal during the conflicts. Most Argazdans regarded their ancestors' actions in the Kanz Disorders as shameful, and the species eventually re-established positive ties with the Lorrdians. The Lorrdian playwright Pordi zet Chatc wrote the tragedy Torphceris about the final ruler of the Argazdan Redoubt and his diabolical deal with a demon, who demanded the Slave Pits be built to focus her dark energies and offered Torphceris mystical powers in return."},{"type":"paragraph","text":"In 4 ABY, Argazda fell within territory of Oversector Outer controlled by Grand Moff Ardus Kaine. By 7 ABY and into 11 ABY, it was allied with the Galactic Empire. From 12 to 17 ABY, the system fell within the Imperial Remnant. Circa 25 ABY, the Argazda system had a population between 100 and 500 million. It had fallen into Roan Fel's Empire-in-Exile by 137 ABY."}],"images":[]},{"title":"Argazdans in the galaxy","level":2,"content":[{"type":"paragraph","text":"Argazdans were present in the wider galaxy for millennia. Indeed, before the outbreak of the Kanz Disorders, Argazdan missionaries spread the Vianist faith among neighboring peoples, such as the Lorrdians and the Sipsk'ud."},{"type":"paragraph","text":"The pro-Imperial Argazdan archaeologist Doctor Raygar was an exception to the species's general disdain for their imperial past. The scientist traveled the galaxy as a participant in projects such as the Wolhanian expedition to Yavin Prime, but he lost financial backing from the academic community when he developed a fixation on unearthing ancient objects with supposed mystical powers. In 0 ABY, Raygar headed the excavation of the Slave Pits of Lorrd. Despite the Argazdans' and Lorrdians' entente, the scientist drew outrage from both species for his insistence on donning the costume of an Argazdan slave master. Raygar kept his true goal secret: to excavate the ancient weapon given to the Argazdans by the \"demon\" of ancient myth and present it to Emperor Palpatine. During a fraught encounter with the Human children Tash and Zak Arranda, who had followed Raygar into the depths of the Slave Pits, the scholar insisted that a Human sacrifice was necessary to access the weapon. Accordingly, he murdered his Imperial contact, Facet Anamor. The death seemingly awakened an ancient creature. In fear, Raygar and the children fled, but not before the scientist destroyed the site with a thermal detonator."},{"type":"paragraph","text":"In 3 ABY, Raygar's obsession with powerful artifacts brought him to the Endor system, where he sought a gemstone known as the Sunstar. He tracked the artifact to Bright Tree Village, an Ewok settlement on the Forest Moon of Endor, where he stole the artifact from its Ewok keeper, the shaman Logray. Back on his Imperial Star Destroyer, Raygar realized that the power afforded by the Sunstar would allow him to topple Palpatine and rule the galaxy in his stead. He developed a cannon powered by the artifact as his very own superweapon. Nevertheless, a band of Ewoks led by Wicket W. Warrick infiltrated the starship to recover the Sunstar. In the commotion, Raygar's cannon inadvertently fired upon Palpatine's approaching shuttle. Admiral Kazz, the Human in charge of the Star Destroyer, arrested Raygar and turned him over to the Emperor for punishment."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20150522175534\/starwars\/images\/thumb\/e\/e6\/RaygarSunstar.png\/180px-RaygarSunstar.png","caption":"The Argazdan scientist Raygar became obsessed with locating mystical artifacts, such as the Sunstar."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Argazdans merge two strands of continuity that date back to the earliest days of Star Wars. The species's prominent role in the Kanz Disorders hearkens back to the 1979 novel Han Solo's Revenge, the second installment of The Han Solo Adventures written by Brian Daley and published by Del Rey. In the story, the Corellian smuggler Han Solo and his Wookiee co-pilot, Chewbacca, join forces with the Lorrdian executive Hart-and-Parn Gorra-Fiolla. In connection with Fiolla, Daley tells of the Lorrdians' one-time enslavement to masters who go unnamed in the novel. The 1993 sourcebook Han Solo and the Corporate Sector Sourcebook, written by Michael Allen Horne for Star Wars: The Roleplaying Game by West End Games, describes the Kanz Disorders in greater detail and names the Argazdans as the Lorrdians' enslavers. Nevertheless, the book provides no indication that the name refers to a species."},{"type":"paragraph","text":"Another thread of continuity wrapped up with the Argazdans is the character Doctor Raygar, a humanoid scientist who appears in \"Battle for the Sunstar.\" An episode of the Star Wars: Ewoks television program, \"Battle\" first aired on December 6, 1986, during the show's second season. Still, the installment, written by Paul Dini and directed by Raymond Jafelice, provides little background for the academic."},{"type":"paragraph","text":"Two 2009 sources marry the elements from Han Solo's Revenge and Ewoks: The Essential Atlas, written by Jason Fry and Daniel Wallace and published by Del Rey, and \"Death in the Slave Pits of Lorrd,\" written by Adrick Tolliver and published as part of the Hyperspace website. As both works were in production simultaneously, Fry and Tolliver shared notes about the Kanz Disorders, the Argazdans' role in them, and the species' physical appearance. Fry developed the ideas of the Myrialites and the Disorders' link to the Mandalorian Wars, while Tolliver thought to connect the species to Doctor Raygar from Ewoks. An illustration by Chris Trevas in the Atlas depicts green-skinned Argazdan slavers and their Lorrdian slaves."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic II: The Sith Lords","elements":[]},{"text":"\"Speaking Silently\"—Star Wars Insider 139","elements":[]},{"text":"Han Solo's Revenge","elements":[]},{"text":"\"Death in the Slave Pits of Lorrd: A Hyperspace Exclusive\" on Hyperspace","elements":[]},{"text":"Star Wars: Ewoks—\"Battle for the Sunstar\"","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Han Solo and the Corporate Sector Sourcebook","elements":[]},{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Alien Encounters","elements":[]},{"text":"Star Wars Encyclopedia","elements":[]},{"text":"The Essential Chronology","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide","elements":[]},{"text":"The New Essential Chronology","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]},{"text":" CV Collecting Panels: Animation Art on StarWars.com","elements":[]}]}],"images":[]}]}