{"sections":[{"title":"Amani","level":1,"content":[{"type":"paragraph","text":"The Amanin (singular, Amani), sometimes called Amanaman, were a primitive race from the planet Maridun. Amanin stood two to three meters tall, and had bright yellow and green skin, arms long enough to reach the ground, and very short legs. They were found in the galaxy at large as mercenaries, heavy laborers and wilderness scouts."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Amanin were a sentient planarian species. They were tall with wrinkled deep yellow skin at the front and a dark green rear hood that ran from the neck to their feet and tail. Their skin coloration helped them blend in with their forest and grassland environment as well as being a signal of the skin's poisonous nature. It secreted a poisonous slime that served to keep the skin moist as well as serving to deter predators on their homeworld. The only creature from Maridun that was not discouraged by the slime was the Charnoq, which was consequently the only predator that the Amanin feared. Due to the susceptibility of their skin to drying, the Amanin preferred to build their shelters in humid environments such as rain forests."},{"type":"paragraph","text":"They had small red eyes that were adapted to see well in Maridun's dim light and a small mouth that widened to engulf raw game and contained numerous sharp teeth and a long tongue. Like other worm species, Amanin expelled their biological wastes through their mouth (although when off world they tended to do this in private after they learned how it disturbed other species). Amanin also had a small nose that provided them with a keen sense of smell, such that they were said to be able to detect strangers from ten kilometers away."},{"type":"paragraph","text":"Their arms and fingers were long and thin, while their legs were comparatively short and thick with large feet. Males and females were virtually indistinguishable by other species. Although they appeared ungainly when walking, their large hands and feet were ideally suited for an arboreal lifestyle on their homeworld where they made their homes in the high treetops."},{"type":"paragraph","text":"While their walking speed was painfully slow, the Amanin's flexible body allowed them to curl themselves into a ball and roll at speeds of up to 50 kilometers per hour across flat terrain. In this form they could not perceive the world around them but were able to use the technique to hurtle past a target and uncoil to deliver an effective attack."},{"type":"paragraph","text":"Amanin had small vital organs spread throughout their body and employed a redundant organ systems that included multiple versions of major organs such as the heart, liver, and lungs. Their brain consisted of multiple nerve clusters spread throughout their body. These characteristics meant that an Amani could withstand devastating injuries and still survive—and, in theory, if one member was bisected, two identical Amanin would reform."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20061205184749\/starwars\/images\/thumb\/f\/fe\/Amani_NEGAS.jpg\/180px-Amani_NEGAS.jpg","caption":"An Amani."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20071201021818\/starwars\/images\/thumb\/c\/cb\/Amani_1b.jpg\/250px-Amani_1b.jpg","caption":"Amanin rolled in a ball."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"On Maridun, Amanin lived in tribal groups led by lorekeepers. Their natural habitat was jungles and forests, where they lived primarily by hunting; these small forest were separated by open savanna land the Amanin called gruntak. When a forest was too crowded, Amanin would roll out onto the plains for another stand of trees, battling any other Amanin tribes who may already have been living there in a ritualistic battle called a takital."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090903174335\/starwars\/images\/thumb\/8\/80\/AmaniTribe-Neighbors.png\/250px-AmaniTribe-Neighbors.png","caption":"Amani warriors attack the Lurmen's transport."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Contact with Maridun by the Galactic Republic was made long before the rise of the Galactic Empire; though it was under the Empire that colonies were first officially established on the world. Before that however, in 22 BBY, a colony of Lurmen attempted to establish themselves on Maridun. They were met with hostility from the Amanin, who attacked their ship and ruined its engines. The Amanin seemed to both hate and venerate the vessel, and the Lurmen leader, Tee Watt Kaa, decided to give it to them, by ejecting an escape pod containing all his people."},{"type":"paragraph","text":"Around 10 BBY, the Galactic Empire began mining operations on Maridun. The Imperials, corporate slave traders, and criminal interests began taking Amanin slaves offworld. During the Galactic Civil War, Maridun was occupied by Galactic Empire forces. When Imperial forces commanded by General Ziering unwittingly crossed a border to sacred Amani battlegrounds, the local Amani tribe declared them to be participants in a Takital, a conflict that is known as the Battle of Maridun. A young officer called Lieutenant Janek Sunber distinguished himself during the conflict and eventually brokered an accord with the tribal lorekeeper."},{"type":"paragraph","text":"In the deal, all captives taken from other tribes during Takitals would be given to the Empire as slaves and in return, Imperial forces would keep off the tribal lands. Similar agreements were subsequently struck with other tribal leaders and as a result many Amani slaves were forced to work in the mines on Maridun or scattered throughout the galaxy as laborers for the Imperial machine."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20070118183809\/starwars\/images\/thumb\/b\/b6\/SWEMP17-FC.jpg\/150px-SWEMP17-FC.jpg","caption":"Amanin attack on Imperial troops during the Battle of Maridun."}]},{"title":"Amanin in the galaxy","level":2,"content":[{"type":"paragraph","text":"While not a spacefaring race, the Amanin were able to gain passage offworld during the Galactic Civil War as the Galactic Empire began a slaving agreement with Amanin leaders. Soon, Amanin were spread throughout the galaxy as slave laborers, mercenaries, or wilderness scouts. One such Amani, known only as \"Amanaman,\" was part of Jabba Desilijic Tiure's court. There was also an Amani among Kavil's Corsairs. As each new generation became more integrated in galactic society, they left some of their base tribal ways behind and came to find acceptance in the galaxy. While Force-sensitive Amanin were recorded as becoming Force Adepts, no records indicate their presence in either the Jedi Order or the Sith."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Jango Fett","elements":[]},{"text":"The Clone Wars: Neighbors","elements":[]},{"text":"Coruscant Nights II: Street of Shadows","elements":[]},{"text":"Coruscant Nights III: Patterns of Force","elements":[]},{"text":"The Last Jedi","elements":[]},{"text":"A Hunter's Fate: Greedo's Tale webstrip","elements":[]},{"text":"\"The Emperor's Court\"—Star Wars Tales 14","elements":[]},{"text":"Star Wars: Empire: To the Last Man","elements":[]},{"text":"Star Wars: Empire 37: The Wrong Side of the War, Part 2","elements":[]},{"text":"Star Wars: Episode VI Return of the Jedi","elements":[]},{"text":"\"Lapti Nek\" The Music Video from Jabba's Palace","elements":[]},{"text":"Star Wars: Legacy 1: Prisoner of the Floating World, Part 1","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"http:\/\/www.potf2.com\/potj\/forums\/topic.asp?TOPIC_ID=12331","elements":[]},{"text":"Star Wars Technical Commentaries - Amanaman","elements":[]}]}],"images":[]}]}