{"sections":[{"title":"Askajian","level":1,"content":[{"type":"paragraph","text":"Askajians were a sentient humanoid species from the planet Askaj."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"Externally, they appeared very similar to Humans, mainly differing in the thick, wrinkled skin on their forehead, their six breasts, and their girth. Internally, the Askajians were adapted to desert survival with large epidermal sacs for water storage. This allowed them to go for several weeks without water. An Askajian could shed up to sixty percent of the water in his or her body with no effect other than tremendous slimming. Askajians also had two hearts."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20100615161829\/starwars\/images\/thumb\/c\/c2\/AskajianNEGAS.jpg\/180px-AskajianNEGAS.jpg","caption":"An Askajian female."}]},{"title":"Society and culture","level":3,"content":[{"type":"paragraph","text":"Askajians lived in a primitive, tribal society, living mostly by gathering plants and hunting herds of large, woolly beasts called tomuons. One of the most important figures in an Askajian tribe was the weaver, who knew the secret techniques to create tomoun cloth. Tomoun cloth was a strong, yet soft and wrinkle-resistant fabric which was a high-demand luxury item as far away as the Core Worlds. As this was the only export the Askajians had, their tribes had been known to fight wars over the services of especially skilled weavers."},{"type":"paragraph","text":"The main political organizations among the Askajians were nomadic tribes composed of several extended families. These tribes were led by male or female herediary chieftains, depending on the region. Many tribes were formed loose military alliances with one another in order to make war on other tribal federations."},{"type":"paragraph","text":"Dancers were also important in Askajian culture. A skilled dancer acted as a shaman and loremaster, re-enacting tribal history and legend and leading worship of their main goddess, the Moon Lady. One of the most famous Askajians in galactic history was Yarna d'al' Gargan, who was one of Jabba's favorite dancers in his Palace. When she had stored as much water as she could hold, Yarna was said to remind Jabba of his mother."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"During the early years of the New Republic, several Askajian tribes migrated to Tatooine with the assistance of an Imperial defector, Gwend. They brought with them tomoun cloth to trade for the technology needed to survive on the planet."},{"type":"paragraph","text":"In 8 ABY a tribe of Askajians led by Borno helped Han Solo, Leia Organa Solo, Chewbacca, C-3PO, and three Squib companions evade capture by Imperial Stormtroopers."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Black Sun Vigo Dean is illustrated to look like an Askajian in Star Wars: Darth Maul 2, but The Complete Star Wars Encyclopedia identifies her as Human."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Alien Encounters","elements":[]},{"text":"The Essential Guide to Alien Species","elements":[]},{"text":"Star Wars: The Action Figure Archive","elements":[]},{"text":"The New Essential Guide to Alien Species","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"Star Wars: The Official Starships & Vehicles Collection 18","elements":[]},{"text":"The Essential Guide to Warfare","elements":[]},{"text":"The Essential Reader's Companion","elements":[]},{"text":" \"I'd Just as Soon Kiss a Wookiee: Star Wars Romances,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}