{"sections":[{"title":"Advozse","level":1,"content":[{"type":"paragraph","text":"Advozsec (singular: Advozse) were a humanoid species, easily distinguished by the single horn on top of their hairless heads. Their home planet of Riflor was geologically unstable, with frequent volcanic eruptions: a condition which shaped their culture and their place in the galaxy."}],"images":[]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Advozsec were evolved from herbivorous reptile-analogs which fed on the vegetation known to form around the planet Riflor's hot springs. Evolving into a class of reptomammal, the Advozsec had a single black horn at the crown of their heads, four digits on each hand and foot, pointed ears, and large black eyes. Their skin varied from yellow to dark brown. Advozsec were strictly vegetarian, being unable to properly digest meat. Nevertheless, at least some members of the species had sharp teeth."},{"type":"paragraph","text":"The Advozsec home planet of Riflor was geologically unstable, with frequent volcanic eruptions. The geothermal hot springs that appear on their homeworld forced the species to evolve thick skin in order to survive. The large, black eyes of the Advozsec were adaptations to the clouds of volcanic ash which darkened Riflor's skies. Though they were most comfortable in the naturally dim light of their homeworld, Advozsec could adjust to levels of light found on other worlds with minimal discomfort."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20061203021440\/starwars\/images\/thumb\/f\/f5\/Advozse_GG12.jpg\/150px-Advozse_GG12.jpg","caption":"An Advozse."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Since so much of the sunlight on Riflor was blocked by volcanic eruptions, Advozsec tended to settle near geothermal springs for heat. Unfortunately, these springs also tended to be in geologically unstable regions, and anything built near them was often destroyed or abandoned due to eruptions or groundquakes. As a result, the Advozse people ended up having little attachment to material goods or long-term plans, and developed a pessimistic, selfish, and even paranoid outlook on life. This facet of their culture remained long after contact with the Galactic Republic gave them access to modern construction techniques allowing for more permanent buildings. Seeing financial stability as the only truly achievable stability one could find in life, the Advozsec constantly strove to accumulate as much monetary wealth as they could in a lifetime in order to have the ability to rebuild when the worst happened."},{"type":"paragraph","text":"Reading and writing the language Advb, Advozsec generally used a first name and a second name. Typical names included Kol Nurn, Roda Lem, and Vel Ramdro. Other Advozsec, such as the warlord Tulak and his son Kalut, were only known by a single name."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Gaining representation in the Galactic Senate on Coruscant, the species was often perceived as being decent bureaucrats. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Riflor's Senator Silvu Donte attempted to secede from the Republic but the planet was quickly placed under the guardianship of the 19th Sector Army of the Grand Army of the Republic and was unable to support the Separatist cause in any substantial way. Despite this, a strong Separatist leaning permeated the society and representatives of the Republic were not welcome."},{"type":"paragraph","text":"When the Galactic Empire came to power, Advozsec involved in Riflor's rich mining operations were cut off from planetary decision making by their Imperial overseers. While most Advozsec supported the Empire, with many serving in its bureaucracy, the Imperial forces on Riflor had to put down several protests demanding a greater Advozse voice. In the decades following the Galactic Civil War, the world was invaded by the Yuuzhan Vong as they waged their campaign of conquest and terror across the galaxy. Creating a bio-virus which killed off Riflor's plant life, the Advozsec who remained on the world died of malnutrition. The species survived only through those Advozsec found on other planets and colonies."}],"images":[]},{"title":"Advozsec in the galaxy","level":2,"content":[{"type":"paragraph","text":"As part of galactic society, the skeptical and control-oriented Advozse temperament led many of them into bureaucratic careers with large corporations or the Republic. Other Advozsec were enemies of the Republic, however. These included the warlord Tulak who ravaged the planet Koba in circa 300 BBY, and Tulak's son Kalut, who attacked Koba a century later."},{"type":"paragraph","text":"Some Advozsec turned to smugglers or became smugglers themselves to get around high Imperial tariffs during the Galactic Civil War. Bom Vimdin, a smuggler who was often seen at the Mos Eisley Cantina, was one of the most prominent Advozsec during the Galactic Civil War. Another Advozse involved with illicit trade, Gjeel Dhantra, served as majordomo for Pok Nar-Ten, the Klatooinian Trade Guild representative on Boztrok. One famous Advozse was Grelk Micabra, who was a swoop racing champion of the Corellian sector."},{"type":"paragraph","text":"Force-sensitive Advozsec existed, as evidenced by an Advozse Sith Lord who joined the Brotherhood of Darkness during the New Sith Wars One Advosec known to have joined the Jedi Order was Goril Sevintran, a Jedi Knight who along with the rest of the Outer Rim Jedi Forces served during the Galactic War."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20061007085218\/starwars\/images\/thumb\/8\/87\/Advose_JvS.JPG\/200px-Advose_JvS.JPG","caption":"An Advozse Lord in the Brotherhood of Darkness."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"Bom Vimdin, the Advozse character that appears in Star Wars Episode IV: A New Hope was nicknamed Don Rickles by the crew due to its resemblance to the insult comic, according to starwars.com."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Knights of the Old Republic 32: Vindication, Part 1","elements":[]},{"text":"Star Wars: The Old Republic, Blood of the Empire Act 1: Shades of the Sith","elements":[]},{"text":"Star Wars: The Old Republic","elements":[]},{"text":"The Old Republic: Annihilation","elements":[]},{"text":"Star Wars: The Old Republic: Rise of the Hutt Cartel","elements":[]},{"text":"Star Wars: The Old Republic: Galactic Strongholds","elements":[]},{"text":"Star Wars: The Old Republic: Shadow of Revan","elements":[]},{"text":"Star Wars: Jedi vs. Sith 3","elements":[]},{"text":"\"Incident at Horn Station\"—Star Wars Tales 2","elements":[]},{"text":"\"Yaddle's Tale: The One Below\"—Star Wars Tales 5","elements":[]},{"text":"Star Wars: Republic 2: Prelude to Rebellion, Part 2","elements":[]},{"text":"Episode I: Anakin Skywalker","elements":[]},{"text":"Star Wars: Republic 8: Outlander, Part 2","elements":[]},{"text":"Star Wars: Republic: The Stark Hyperspace War","elements":[]},{"text":" Desrini Plagued by Dianogas—HoloNet News Vol. 531 55","elements":[]},{"text":"Star Wars: Republic 49: Sacrifice","elements":[]},{"text":"Star Wars: Republic 62: No Man's Land","elements":[]},{"text":"Star Wars: Republic: Show of Force","elements":[]},{"text":"Star Wars: Clone Wars – \"Chapter 21\"","elements":[]},{"text":"Star Wars: Republic: Trackdown","elements":[]},{"text":"Star Wars: Dark Times 15: Blue Harvest, Part 3","elements":[]},{"text":"Shadow Games","elements":[]},{"text":"\"Number Two in the Galaxy\"—Star Wars Tales 18","elements":[]},{"text":" Positive ID on Wizards.com","elements":[]},{"text":"\"Smuggler's Blues\"—Star Wars Tales 14","elements":[]},{"text":"Star Wars: Episode IV A New Hope","elements":[]},{"text":"Star Wars: Assault Team","elements":[]},{"text":"Rookies: Rendezvous","elements":[]},{"text":"The Star Wars Holiday Special","elements":[]},{"text":"Mara Jade: By the Emperor's Hand","elements":[]},{"text":"\"Tall Tales\"—Star Wars Tales 19","elements":[]},{"text":"Star Wars: Legacy: Broken","elements":[]},{"text":"Star Wars: Legacy: Claws of the Dragon","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Wanted by Cracken","elements":[]},{"text":"Smuggler's Log","elements":[]},{"text":"Galaxy Guide 12: Aliens — Enemies and Allies","elements":[]},{"text":"Platt's Smugglers Guide","elements":[]},{"text":"Star Wars Trilogy Sourcebook, Special Edition","elements":[]},{"text":" Star Wars Customizable Card Game – A New Hope Limited","elements":[]},{"text":"Ultimate Alien Anthology","elements":[]},{"text":" \"The University of Sanbra Guide to Intelligent Life: The Advozsec\"—Star Wars Gamer 4","elements":[]},{"text":"The Official Star Wars Fact File 105","elements":[]},{"text":"The Official Star Wars Fact File 134","elements":[]},{"text":"\"Jedi Library\"—Star Wars Insider 92","elements":[]},{"text":"The Complete Star Wars Encyclopedia, Vol. I ","elements":[]},{"text":"Legacy Era Campaign Guide","elements":[]},{"text":"Book of Sith: Secrets from the Dark Side","elements":[]},{"text":" Star Wars Galaxy Series 7","elements":[]},{"text":" Star Wars: The Card Game – Core Set","elements":[]},{"text":"Star Wars: Force Collection","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":"Advozse on Star Wars: The Old Republic Wiki","elements":[]}]}],"images":[]}]}