{"sections":[{"title":"Anzat (species)","level":1,"content":[{"type":"paragraph","text":"The Anzati (singular: Anzat) were a dangerous and mysterious Force-sensitive near-Human species with two tentacle-like proboscises that curled out and extended from their cheeks, with which the Anzati were able to feed upon the brains of their prey. With the tentacles retracted into seams along each side of their nose, Anzati were indistinguishable from any other humanoid species in the galaxy."},{"type":"paragraph","text":"They were an extremely long-lived species, also possessing regenerative capabilities beyond those of the average humanoid. The Anzati were also telepathic, growing more adept at the talent as they aged, allowing them to dominate someone's mind to give them a chance to feed."},{"type":"paragraph","text":"According to the Jedi Master Zao, the soup that Anzati drank was the future, and thus, the Force. Because of this, Anzati who drank the soup of another Force-sensitive would strengthen his connection to the Force."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Anzati were Human in appearance, with bulbous noses, flared nostrils, and grayish-hued skin. Their height ranged from 1.5 to 1.7 meters. Scientists and xenobiologists had little opportunity to study the Anzati, but sketchy medical reports found on the species indicated that they had no natural biorhythm; that is to say, no pulse, and as a result, no body heat. Therefore, it was a total mystery as to how their circulatory system functioned."},{"type":"paragraph","text":"The youngest Anzati were ancient. The ages of the eldest could be measured in eons. They roamed the galaxy when the Galactic Republic was just a dream of the Core Worlds. The Anzati could live for centuries, sustained by the life essence they drew from others. An Anzat who did not feed at least once every few days merely grew hungry. Lack of sufficient meals had no more of a supernatural aging effect on an Anzat than it did on a Human."},{"type":"paragraph","text":"Because the Anzati preyed upon those whose life force was strong, they must be stronger. While Anzati tended to possess exceptional might and often startling reflexes, at best, they could reflect thrice that of a pinnacle Human's athletic ability; at worst, they merely had the attributes of an ordinary Human. However, physical strength was only a small part of the equation. To sense the presence of a strong life essence in others, they had highly developed sensory organs unknown in other sentient species. To physically drain this life essence's connection from living beings, they had to be physically adapted to do so. For the Anzati, these things were interconnected."},{"type":"paragraph","text":"The Anzati were natural predators, preferring to hunt sentient races of every shape, size and species. To this end, they possessed two long, prehensile proboscises similar in appearance to tentacles. They kept these proboscises coiled in their twin cheek pockets for feeding on unsuspecting victims; when their proboscises were retracted, they were practically indistinguishable from Humans. They fed in a unique way that was described as grotesque."},{"type":"paragraph","text":"Using a natural ability akin to hypnosis, which Jedi who had encountered them claimed was akin to Force manipulation, they bewitched their victims in a manner similar to a Jedi mind trick. Using this telepathy, the Anzat lured in their unsuspecting targets by mesmerizing them with their telepathic control. This control strengthened at close range and was even further augmented and honed with age and use."},{"type":"paragraph","text":"Once a victim was within their power, the Anzati would uncoil their thin proboscises from their cheek pouches located on either side of its nose and usually inserted them into the subject's nostrils and into the cranium, where the brain was sucked out of the organism, though the Anzati fed by drawing soup out of wherever it resided in a victim, as it varied by species. In most humanoid races, it lay within the brain cavity. Almost of their own, the proboscises sought the victim's soup, and began draining it into the Anzat. The victim could struggle, though often the Anzat's attack was so sudden, so perfect, that it was too late. This action, however, required time and could not be rushed. This behavior led to the nickname of \"snot vampires.\" They also had been known to grasp the victim's head to hold it in place close to them as they fed."},{"type":"paragraph","text":"They called this meal \"soup,\" \"luck,\" or the \"Sea of Memory.\" The actual substance they drained out of living beings—the gelid, mucoid medium for the luck or life essence—they referred to as soup. In Anzati traditions, the term referred to the life essence, or spiritual power, of the victim. As well, the Anzati believed that this life essence governed a living being's personal presence. Thus, the more presence a victim had, the more potent the luck was likely to be. Particularly fortunate individuals were tasty meals for the Anzati. It was reputed that Anzati could keep their victims alive for several feedings, taking great pleasure in the fear and terror they felt throughout the ordeal."},{"type":"paragraph","text":"Though life essence and luck were manifestations of the Force, the luck upon which Anzati fed was only peripherally related. Certainly, beings who were particularly gifted in the Force were appetizing to an Anzat, but this was usually because their close connections with the life energy of the universe presented the appearance of a great personal presence. Of course, experienced Jedi usually had both powerful personal life essence and a close connection with the universe's through the Force. The Anzat who made a meal of such a Jedi was a rare and terrible creature indeed."},{"type":"paragraph","text":"The Anzati, of course, considered such discussions academic. \"The Force\" was a concept developed by younger species. It was a concept Anzati do not recognize as any more correct than any of a dozen theories before. They knew only that weak-willed beings were as unsatisfying as table scraps. To subsist on the average sentient, an Anzat would have to feed on a dozen beings every day; and since the meal rarely survived the feast, the Anzat would leave a trail of corpses. On a world without sentient beings, or in a place where soup is in short supply, an Anzat could easily starve to death. Most of the galaxy, however, was unfortunate in this regard: the Anzati were not liable to die off so easily—sentient beings were plentiful enough to feed a legion of them. Despite myths to the contrary, victims of the Anzati did not become Anzati themselves."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20110304140149\/starwars\/images\/thumb\/9\/99\/Aayla_kaarko.jpg\/180px-Aayla_kaarko.jpg","caption":"Volfe Karkko, exercising his mind control abilities on Aayla Secura."},{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20071126203822\/starwars\/images\/thumb\/2\/2b\/Anzati_feeding_G1.jpg\/225px-Anzati_feeding_G1.jpg","caption":"An Anzat feeding."}]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The drive to hunt for \"soup\" seemed to be the central factor of Anzati life; one could almost have considered them an addicted people. Once they began the hunt, they thought of nothing else but to satisfy this hunger, a hunger that grew stronger and more powerful with each passing year. Anzati were reported to view all other peoples as livestock to be harvested to fulfill their needs, although some were known to try and stave off the craving for as long as possible between feedings. Anzati were known to be creatures of a single-minded purpose, they spent their long lives surviving from one meal to the next—in the process, depriving living beings of their own lives."},{"type":"paragraph","text":"Either way, because the hunger grew as they aged, and they lived for such a long time, they ended up becoming more and more isolated in their need. The older the Anzati, the more unstable and obsessive they became, often to the point of insanity. They would lose focus on the world around them and in many cases would make a crucial mistake, leading to their ultimate destruction."},{"type":"paragraph","text":"Some Anzati believed that feeding on live vessels gave them eternal youth and energy. This belief can be traced to the Silent Voices, luminescent bands of gases that glowed in the Anzat atmosphere at night. Ancient Anzati believed that these were the life essences of their ancestors. Although such a possibility was not scientifically viable, it illustrated the level of importance that \"soup\" played in Anzati culture, morals, and belief structures."},{"type":"paragraph","text":"Anzati reproduced infrequently, and usually lived for many centuries. Parents did not typically give their children names, instead allowing them to seek names that best blended in with their chosen prey. Youthful Anzati reached puberty at approximately one hundred standard years of age, and, when that time came, they left Anzat to hunt for \"soup\" and continue their so-called eternal existence."},{"type":"paragraph","text":"Though it was easy to picture the Anzati as heartless predators, that was no more true of them than it was of any species that ate another species to live. With their long lives, Anzati had plenty of time to develop and pursue all manner of interests; many were devoted patrons of the arts. A few had even produced works of art of their own: books, music, paintings, sculpture, films, and holos. Few had created more than one example in any given medium, however. For a being so long-lived as an Anzat, perfection at a craft was pointless; reaching the pinnacle of an art was no real accomplishment if its only other practitioners died off a thousand years ago."},{"type":"paragraph","text":"A common misconception among those who studied tales of the Anzati was that they were hyper-developed scholars, experts in fields of knowledge and craft long since forgotten by younger species. While Anzati could remember things that happened centuries earlier, they had little or no interest in pursuing mastery of any given area of expertise or knowledge—other than feeding. To the Anzati, the important skills to pass on to their offspring were the arts of stealth and the kill; everything else was just amusing diversion, hardly worth the effort of committing to memory."},{"type":"paragraph","text":"The Anzati were accomplished hunters, tracking their quarry silently, invisibly and efficiently. Their abilities served them in avoiding notice as well. Despite occasional noticeable individuals, all Anzati diligently maintained as low a profile as possible, disappearing into the galaxy's crowds as soon as anyone appeared to notice their activities, abilities, or longevity. An Anzat used his or her sense of personal presence to hunt—to detect prey's soup. The stronger the target's soup, the more the target stood out to the Anzat's senses."},{"type":"paragraph","text":"Anzati were also difficult to capture. Because of their secrecy, hunting skills, and training, Anzati were often employed by organized crime factions as assassins. The Anzati simply dwelled among the sentient species of the galaxy, blending into the dizzying myriad of cultures—invisible because, until one revealed its true nature to a victim, an Anzat was just another alien; and, of course, once the victim saw the Anzat, it was too late to warn anyone else."},{"type":"paragraph","text":"Their anonymity was frequently used to their advantage, so they rarely, if ever, worked in groups. It was only in the capacity of a bounty hunter that they would abandon their lonely tendencies and band together to form a corporation or guild. On these exceptionally rare occasions, they would sometimes share prey and the financial rewards of their hunts. These corporations were temporary, often existing for only one hunt, as they typically ended up killing each other to eliminate competition for a very \"soupy\" victim."},{"type":"paragraph","text":"Thousands of worlds across the galaxy had legends of the Anzati, yet no culture's myths included their origin. To some, this implied that the Anzati had been around longer than any other species, or that they survived, for thousands of centuries, the only other species to share their homeworld. Others believed that the Anzati evolved simultaneously with Humankind, somewhere beyond the knowledge of sentient races, only to enter galactic society at large when hyperspace exploration put the Anzati homeworld within reach of the Republic. When the planet was later found, it was usually avoided for the race's tendencies."}],"images":[{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20060611210000\/starwars\/images\/thumb\/5\/5b\/Anzat_feed.jpg\/250px-Anzat_feed.jpg","caption":"An Anzat attempting to extract the \"soup\" from Quinlan Vos."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20090923052330\/starwars\/images\/thumb\/7\/78\/Akku.jpg\/175px-Akku.jpg","caption":"Akku Seii, an Anzati trainer in the arts of assassination."}]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Because Anzati were roamers, they were often considered mythical and to be nothing but the things of dark legends and folktales. For a long period of time the true location of their homeworld, Anzat, was a mystery. Scientists and explorers who traveled to the world reputed to be Anzat simply disappeared without a trace. There were some reports that placed it in the Mid Rim, near the Perlemian Trade Route."},{"type":"paragraph","text":"The Anzati were believed to be one of the first spacefaring races. According to anecdotal evidence offered by sentients fortunate enough to survive their encounters with Anzati, the race roamed and wandered the galaxy, returning to Anzat only to find a mate and reproduce and, in some cases, train with Anzati master assassins."},{"type":"paragraph","text":"It was believed that the Anzati encountered the ancient Sith species during the pre-Republic era, and it was from the Anzati that the Sith drew such practices as dining on bloodsoup on their homeworld of Korriban."},{"type":"paragraph","text":"Although the Anzati as a species were isolationists, there were several instances in which they were propelled into the galactic spotlight. The earliest known instance was the anomaly of the Jedi Anzat Volfe Karkko. It was rare for an Anzat to become a Jedi because it was believed that Anzati were of too violent a nature to be entrusted with such power as the Jedi wielded, and would not be able to resist using their power to drink the \"soup\" of those around them."},{"type":"paragraph","text":"With Karkko, this belief proved true, as he had been so well trained that he believed himself above the instinct shared by his species, having never tasted \"soup.\" Unfortunately, this same arrogance led Karkko to think that he could control his inbred nature, and he fed. This mistake in turn resulted in Karkko succumbing to the dark side of the Force."},{"type":"paragraph","text":"Karkko was captured and held in a stasis field for a millennium on the prison world of Kiffex. During his imprisonment, however, his mind remained active, originally so he could contemplate his actions. Unfortunately, he used this to his advantage, using it to draw numerous followers."},{"type":"paragraph","text":"Over time, his legend grew among the Anzati on Kiffex, who worshiped him as \"the Dreamer,\" converting his resting place into a sacred temple. Karkko fed his follower's baser instincts, turning them feral and causing them to prey on the residents of inmates of Kiffex with a ferocity that was striking even for an Anzat. Karkko was eventually killed by Quinlan Vos, thus ending his reign there."},{"type":"paragraph","text":"Nikkos Tyris was another fallen Anzat Jedi who was trained as one of Count Dooku's Dark Acolytes. It was he who founded a competing order of Force-users during the Clone Wars as the first Saarai-kaar of the Jensaarai. Fortunately, the Jensaarai did not pose significant harm to others, never rising to influence much beyond their homeworld and only seeking to serve as protectors. Because the first Jensaarai disciples had not yet been corrupted by the dark side and Sith training, those who followed in fact served the light side of the Force, despite their reverence for Sith traditions."},{"type":"paragraph","text":"Saljé Tasha, Akku Seii, and Rath Kelkko were three Anzati assassins who were involved with the Jedi in some way during the Clone Wars. Tasha, a female Anzat, was responsible for the death of Finis Valorum, and she and Kelkko were hired by Sora Bulq to train Morgukai warriors on Saleucami.Oppo Rancisis was later assassinated with the help of Rath Kelkko."},{"type":"paragraph","text":"When Bulq hired the Anzati to train the Morgukai clones, it left a shortage of assassin masters on Anzat, forcing Akku Seii to break tradition and train many Anzati at once. Because Akku was an acquaintance of Jedi Master Tholme, he aided the Jedi in finding the other Anzati masters. These masters were working with Bok, a Morgukai, to train the growing secret faction. Upon learning of them, Tholme sabotaged their efforts, causing them great displeasure before he killed them in the catacombs of Saleucami."},{"type":"paragraph","text":"Around 0 BBY, Dannik Jerriko, a male Anzat bounty hunter known as the Eater of Luck, came to prominence. He was paid handsomely for killing failed assassins, along with murderers, thieves and thugs for his own feeding, calculating that they would not be missed. He was irritable, being unable to tolerate clients who did not appreciate the value of his thorough work; as such, it was not uncommon for him to feed on an unhappy client."},{"type":"paragraph","text":"While searching for the \"soup\" of thieves on Tatooine, he encountered Obi-Wan Kenobi, whose life force he craved. However, he was unable to gain this and instead targeted the much more valuable Han Solo, in lieu of Jabba Desilijic Tiure's bounty on him. He was again unable to feed on his prey, and was later assigned to protect Tash Arranda, Zak Arranda, and Mammon Hoole."},{"type":"paragraph","text":"After that assignment, Jerriko returned to Tatooine to spy on Jabba. Still desirous of Solo's soup, the Anzati became excited upon the arrival of a carbonite slab containing Solo. However, Jerriko was deprived of his chance to drink Solo's soup when his Alliance to Restore the Republic comrades saved him. Frustrated at the loss of this opportunity, Jerriko accepted the option of feeding on Jabba, only to be foiled by the Hutt's death at the Great Pit of Carkoon. Mad with vampiric hunger and rage, Jerriko killed a number of unfortunate survivors at Jabba's Palace and then fled Tatooine to continue his endless search for beings on which to feed, with a large bounty on his own head by this time due to his actions."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100310212820\/starwars\/images\/thumb\/9\/9c\/VolfeKarkko-CSWE.jpg\/200px-VolfeKarkko-CSWE.jpg","caption":"Volfe Karkko, a deadly Anzati Dark Jedi."},{"src":"http:\/\/img1.wikia.nocookie.net\/__cb20070907013127\/starwars\/images\/thumb\/b\/bd\/Saje3.JPG\/175px-Saje3.JPG","caption":"Saljé Tasha, an Anzati assassin."},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130225041031\/starwars\/images\/thumb\/0\/06\/Anzat03.png\/180px-Anzat03.png","caption":"Dannik Jerriko at Mos Eisley Cantina"}]},{"title":"Feral Anzati","level":2,"content":[{"type":"paragraph","text":"There appeared to be a feral species of Anzat who were capable of shooting a ropy webbing out of their torso to trap their prey, though this was only seen among the Anzati drawn to Volfe Karkko. They were believed to have been Anzati who went to Kiffex in reverence to Karkko during his imprisonment. Somehow he leeched their vitality, causing them to become degenerate and feral. They retained the ability to speak, but this was usually limited to single words and small phrases."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20090711200019\/starwars\/images\/thumb\/7\/7e\/Feralanzati.jpg\/180px-Feralanzati.jpg","caption":"Feral Anzati."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"In The Essential Guide to Characters, it is stated that Anzati only consumed a victim's luck, and that a victim could survive. This, however, is contradicted by almost every other source in which an Anzat appears. Nonetheless, the The New Essential Guide to Alien Species does state that the Anzati had a range of names for their meals, among them \"Soup\", \"Luck\", and \"Sea of Memory\"."}],"images":[]}]}