{"sections":[{"title":"Amani\/Canon","level":1,"content":[{"type":"paragraph","text":"Amani were a species of tall, flat-bodied aliens with long, gangly arms and big hands. Their skin was wrinkly and covered in slime. They were considered dangerous by the Pau'an authorities, and their technology level was low."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20140430172811\/starwars\/images\/3\/3c\/Eras-canon.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Amani were tall, thin sentients with short legs, gangly arms long enough to reach the ground, and big hands. Their yellow-and-green skin was coated in slime. They were capable of curling themselves into a ball and roll as a means of locomotion."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Compared to many other species, the Amani were considered as primitives. They had a tribal organization and dwelled in simple tents. They were also regarded as dangerous, and Amani head hunters were once highly sought after. Amani were often seen carrying staffs on which were strung several skulls."}],"images":[]},{"title":"Amani in the galaxy","level":2,"content":[{"type":"paragraph","text":"Toward the end of the Clone Wars, the Amani had established settlements on Utapau, where they co-existed with the native Pau'ans and Utai. They set up their encampments on the plains or underground, but rarely ventured into the cities. At that time, General Grievous used a rogue Amani as a bodyguard to facilitate a major arm deal with the Sugi. The Jedi Master Tu-Anh was killed while investigating the matter, which prompted Anakin Skywalker and his master, Obi-Wan Kenobi, to travel to Utapau. Once there, they discovered evidence pointing to the conspiracy between the local Amani and the Confederacy of Independent Systems."},{"type":"paragraph","text":"Many years later, shortly before the Battle of Endor, an Amani was present in the palace of Jabba the Hutt on Tatooine."}],"images":[{"src":"http:\/\/img3.wikia.nocookie.net\/__cb20140926010648\/starwars\/images\/thumb\/b\/be\/Amani_camp.jpg\/180px-Amani_camp.jpg","caption":"An Amani camp on the plains of Utapau"}]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Clone Wars – \"A Death on Utapau\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"In Search of the Crystal\"","elements":[]},{"text":"Star Wars: The Clone Wars – \"Crystal Crisis\"","elements":[]},{"text":"Star Wars: Episode VI Return of the Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" Amani in the Databank","elements":[]}]}],"images":[]}]}