{"sections":[{"title":"Arhan","level":1,"content":[{"type":"paragraph","text":"The Arhan were a species of near-Humans who differed from base-line Humans in that they were thinner and more frail, with longer facial features. Filice Ginzork was an Arhan who was active during the Galactic Civil War. Along with her husband, Peert Ginzork, she was a member of The Shield, an organization specializing in private security."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The Arhan were a sentient species of near-Humans—a classification for species very similar to base-line Humans, but which through any number of factors evolved unique adaptations to their environment. As such, the Arhan were bipedal and largely resembled Humans; Arhans, however, were thinner and more frail and had longer facial features than base-line Humans."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"Arhan were active in the galaxy during the time of the Galactic Civil War. Filice Ginzork, a skilled slicer who married Peert Ginzork, was one such Arhan. Peert, a former assault trooper in the Imperial Army, formed an organization known as \"The Shield\" with his wife. The Shield originally protected corporate couriers before expanding into counter-espionage and executive bodyguard duties. Its members were also operatives of the Alliance to Restore the Republic, although this was unknown to both their corporate clients and the Galactic Empire. Filice operated as The Shield's slicer, while her husband provided brute force."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Arhan were created by Rick Olshak for the West End Games sourcebook Cracken's Rebel Operatives, published in 1994. The sourcebook made some general remarks about the species in the context of one particular member, Filice Ginzork. The one Arhan depicted was illustrated by Mike Vilardi."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Cracken's Rebel Operatives","elements":[]}]}],"images":[]}]}