{"sections":[{"title":"Avogwi","level":1,"content":[{"type":"paragraph","text":"Avogwi were a sentient species of predatory birds native to Altor 14, which was also home to the Nuiwit. Except for their muscular, scale-covered legs, their bodies were covered in orange feathers, which camouflaged them against Altor's orange skies. Adult Avogwi had a wingspan of four to five meters. They had three fingers at the joint of each wing, which served as hands when not in flight. Avogwi viewed the Nuiwit as merely another prey species, though tastier than most. They reacted violently to suggestions that the two species evolved from a common ancestor."},{"type":"paragraph","text":"Due to their entirely carnivorous diet and clumsy hands, Avogwi society was relatively primitive, based solely on hunting and water gathering. Avogwi were not very social, living in mated pairs which would claim about fifty square kilometers as their exclusive territory. They also had very little technology, and distrusted that of other species. Despite this, they had developed a complex philosophy based on the teachings of the legendary hero Toro-toral, said to be the first Avogwi to fly. The basic tenets of this philosophy were that all creatures that wanted to live must kill, and that all creatures that would not kill would die so that others could live. The sayings of Toro-toral were repeated by the Avogwi at their only large-scale gatherings: ceremonial duels to the death to determine the Avogwi leader, or Avog."},{"type":"paragraph","text":"Avogwi had little to trade to the rest of the galaxy other than mineral rights to the territory surrounding their aeries. This, they refused to do, as they were unable to understand why offworlders would trade them anything useful in exchange for anything the Avogwi owned, unless it was to make the Avogwi weaker. Since their Nuiwit neighbors were willing to trade, and their cities and farms continued to expand and drive Avogwi out of their hunting grounds, the Avogwi did not prosper when the Rego Mineral Company contacted Altor 14 in 15 BBY. Some, unable to find aeries of their own, went offworld, where they found work as bounty hunters, assassins, or similar violent occupations."},{"type":"paragraph","text":"An Avogwi worked as the port boss at Mud Station on Shador. Another well-known Avogwi was Nevid d'Hon, an outfitter on Ord Mantell."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Truce at Bakura Sourcebook makes mention of the sentient \"Altorians,\" though it is unclear whether the reference is meant to apply to the Avogwi or the Nuiwit."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Scoundrel's Luck","elements":[]},{"text":"Children of the Jedi","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galaxy Guide 4: Alien Races","elements":[]},{"text":"A Guide to the Star Wars Universe, Second Edition","elements":[]},{"text":"Galaxy Guide 4: Alien Races, Second Edition","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]}]}],"images":[]}]}