{"sections":[{"title":"Ayrou","level":1,"content":[{"type":"paragraph","text":"The Ayrou were an avian species of humanoids native to the planet Maya Kovel in the Moddell sector. Noted for their warbling, high-pitched voices, the Ayrou were descended from birdlike species and they were reputed to be a peaceful species, and experts in gathering information."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearance","level":2,"content":[{"type":"paragraph","text":"The harmonics in their voices made many species uncomfortable. Some Humans described Ayrou vocalizations as \"blood-curdling\", and other listeners likened the Ayrou language to a songbird being strangled. Some species even claimed actual physical harm, such as lost egg clutches, from hearing Ayrou speak. Their version of a snort was a warbling scream."},{"type":"paragraph","text":"Though their voices were often considered unpleasant, their appearance was generally held to be attractive. They were a tall, slim species, typically around two meters tall but only 65 kilograms in mass. They had long, triple-jointed limbs, with four tapered fingers on each hand. Their skin ranged from milky white to light purple. Ayrou had wide-spaced eyes, which came in brilliant shades of red, blue, or green. Their avian ancestry was obvious from the dazzling plumage they had instead of hair. Ayrou spent much of their time preening their feathers, since their appearance reflected their health and social status."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"Ayrou had an instinct to hoard items for future use: a trait non-Ayrou sometimes mistook for simple greed, but which the Ayrou themselves regarded as merely practical. This trait carried over to a drive to collect as much information as possible about anything and everything. It also made them treat haggling and negotiations as an art form. It did not carry over to aggressiveness or covetousness, however. Ayrou considered violence the mark of those who could not succeed through their intellects."},{"type":"paragraph","text":"Ayrou leaders would often debate a cultural or religious issue for several generations, before abruptly coming to a single conclusion. These sudden switches often baffled non-Ayrou observers. While they developed their own language, they also understood Galactic Basic Standard without speaking it. Common names among the Ayrou included Chee'ad, Kuusa, Noreekee, Tessyn and Tircee."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20070310110336\/starwars\/images\/thumb\/7\/7b\/Ayrou_SWG9.jpg\/180px-Ayrou_SWG9.jpg","caption":"An Ayrou."}]},{"title":"Ayrou in the galaxy","level":2,"content":[{"type":"paragraph","text":"As one of the first species to develop spaceflight in the Moddell sector, Ayrou were politically influential in their home sector. They had established populations on the factory world Ovise III, the penal colony of Thonner, the Vashan homeworld of Vasha, and the sector capital world Annaj. In 19 ABY, Ayrou Senator Muchardis Mulaxis represented the Moddell sector in the New Republic Senate. This senator was skeptical of Borsk Fey'lya's claims during the Caamas Document Crisis that the Bothans did not know which clans bore responsibility for the destruction of Caamas."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Specter of the Past","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Ultimate Alien Anthology","elements":[]},{"text":" \"Race for the Tessent\"—Star Wars Gamer 9","elements":[]},{"text":" \"Endor and the Moddell Sector\"—Star Wars Gamer 9","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":"The Essential Atlas","elements":[]}]}],"images":[]}]}