{"sections":[{"title":"Amphi-Hydrus","level":1,"content":[{"type":"paragraph","text":"The Amphi-Hydrus were amphibious beings native to Dac. Naturally telepathic, they tapped into the dark side of the Force, and were able to use imported rancors to cause carnage and destruction on the planet. Their rampage was brought to an end by the arrival of the Galactic Empire on Dac."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biology and appearances","level":2,"content":[{"type":"paragraph","text":"The Amphi-Hydrus were amphibious creatures, small and weak, physically. However, they possessed a natural ability to control the minds of others telepathically. As such, the Amphi-Hydrus were naturally Force-sensitive. They were bipedal, and also featured two arms. Their skin was green and brown in color, and they also featured red eyes."}],"images":[]},{"title":"Society and culture","level":2,"content":[{"type":"paragraph","text":"The Amphi-Hydrus were native to the planet Dac, or \"Mon Calamari\" as it was known. They used the dark side of the Force to control the minds of others. They collectively wrought destruction upon Dac briefly, but when their power was broken by invaders, they were forced to become swamp dwellers."}],"images":[]},{"title":"History","level":2,"content":[{"type":"paragraph","text":"The collective Amphi-Hydrus were able to briefly gain a foothold on their homeworld of Dac, putting their mind-control powers to use. Several rancors had been imported to the planet, and they were able to control the beings, bending them to their will. Mounting the rancors, the Amphi-Hydrus rode across the planet, wreaking havoc and destruction wherever they went. Their rampage came to an end when Dac fell under attack from the Galactic Empire, and the Amphi-Hydrus were forced to retreat to the planet's swamps. There, they waited, hoping that another chance would present itself for them to reclaim their former position of power."}],"images":[]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"The Amphi-Hydrus was designed and created by Daren Horley, an entrant in the \"Design An Alien\" competition run by Star Wars Galaxy magazine. The competition was initiated in Star Wars Galaxy Magazine 3 (1995), asking fans to contribute their own designs and ideas for aliens inspired by the Star Wars films. Horley was 29 at the time, and although his entry did not actually win, it was nevertheless published in Star Wars Galaxy Magazine 7 (1996), under the \"honorable mentions\" section of the \"16 and up\" division. Leland Chee, the Lucasfilm Ltd. continuity editor, has since declared that the published \"Design an Alien\" material is canon, although the Amphi-Hydrus are yet to be referenced in any other Star Wars material."}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"\"Design An Alien\"—Star Wars Galaxy Magazine 7","elements":[]}]}],"images":[]}]}