{"sections":[{"title":"Abominor","level":1,"content":[{"type":"paragraph","text":"The Abominor were an extra-galactic droid society from the Yuuzhan Vong galaxy."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"},{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20100810044415\/starwars\/images\/thumb\/2\/24\/GreatHeep-NEGD.jpg\/200px-GreatHeep-NEGD.jpg","caption":"The Great Heep"}]},{"title":"Details","level":2,"content":[{"type":"paragraph","text":"Abominors were immense droids which were composed of tubing as well as assorted parts from other droids; for example, one side of the only known member of the species—the Great Heep—was filled with various bouncing pistons beating in an appalling, terrible rhythm, and one arm chopped off at the elbow. Grinding blades filled its mouth, with tiny mechanical robots living in its hull like worms living in a mammal's stomach, feeding off its excess. Their culture was based on asymmetry and chaos which conflicted with that of the symmetrical Silentium, another sentient droid species. Some Abominor even grew until they were planet-sized monstrosities."},{"type":"paragraph","text":"An Abominor had massive boilers filled with fuel which often relied on moisture drained away from a planet’s life forms to cool its immense internal machinery. However, this process often plunged the planet into a drought or famine and caused great hardship for the inhabitants. Abominors also kept organic slaves and used them to fill their massive boilers."},{"type":"paragraph","text":"The Great Heep was known to have a droid harem which kept smaller, unassuming droids in luxury, treating them to oil baths and other droid pleasantries before their eventual demise, where it would consume them to add to its own structure."},{"type":"paragraph","text":"The Abominors and the Silentium fought a massive war, until their very galaxy became devastated by the conflict. The Abominor even came close to subduing the Yuuzhan Vong species. Eventually the organics of the galaxy, who had been ignored by the machines, rose up and waged war on both races. Both droid civilizations were forced to flee into the Unknown Regions of another galaxy where they reestablished their civilizations though they kept out of the affairs of that galaxy most of the time."},{"type":"paragraph","text":"However, an agent of the Abominor known as the Great Heep entered the known galaxy, although it ended up deactivated under unknown circumstances. Its body was then discovered and then placed into the Braltzamir Museum of Antiquated Machinery as an exhibit. Nearly 300 years later, the admiral of the then newly-formed Galactic Empire's starfleet, Terrinald Screed, arranged for a team of brilliant students from the Imperial Engineers Academy revive the Abominor agent, to which it eventually formed an alliance with the Galactic Empire in 15 BBY and was planted on Biitu where it immediately began stripping the planet of its natural resources."},{"type":"paragraph","text":"Adventurer Mungo Baobab, while on Biitu, discovered that the Heep was siphoning moisture away from the planet's farmlands. Seeing the native Biituians plunged into the ensuing drought, Baobab destroyed the machine with the help of his droids, R2-D2 and C-3PO. The Imperial ravaging of Biitu had ended."},{"type":"paragraph","text":"Sometime after its defeat, the Great Heep was found by a relative of Mungo's, Ebenn Q3 Baobab. Using the clout and wealth attached to his person, Baobab restored the droid and placed it on display at the Baobab Museum of Science. Researchers studying the droid, speculated that as many as 18 such Abominors had infiltrated the galaxy, including the being that made up the junkyard world of Ronyards. This revelation drove one of the researchers, Cantebarius H. Broom, mad with paranoia. He began dismantling every droid he came across, believing all mechanical life forms were after him."},{"type":"paragraph","text":"Their earlier actions in the Silentium-Abominor War were also indirectly responsible for the Yuuzhan Vong War, as the Vong's desperation in using organics to drive out both the Silentium and Abominor species led them to eventually become conquerors. Similarly, their technophobia had its roots from the same conflict."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20060304054059\/starwars\/images\/thumb\/c\/cc\/Heep1.jpg\/200px-Heep1.jpg","caption":"The Great Heep"},{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20060710190009\/starwars\/images\/thumb\/d\/d1\/Gh3.jpg\/200px-Gh3.jpg","caption":"An Abominor."}]},{"title":"Behind the scenes","level":2,"content":[{"type":"paragraph","text":"It was strongly implied that the war between the Silentium and the Abominor were the source of the Yuuzhan Vong's technophobia, suggesting that they were the race which invaded Yuuzhan'tar in the past. This link was finally made into canon in the Official Blog article The Droids Re-Animated, Part 2, by Rich Handley and Abel G. Peña on July 5th, 2013."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: Droids—\"The Great Heep\"","elements":[]},{"text":"The New Jedi Order: The Unifying Force","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":"Galactic Phrase Book & Travel Guide","elements":[]},{"text":"The New Essential Guide to Droids","elements":[]},{"text":"The Complete Star Wars Encyclopedia","elements":[]},{"text":" \"The Droids Re-Animated, Part 2,\" The Official Star Wars Blog","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" \"Endnotes for The New Essential Guide to Droids: PART 1 of 3\" – Continuity, Criticisms, and Captain Panaka, Daniel Wallace's StarWars.com Blog","elements":[]},{"text":" \"Endnotes for The New Essential Guide to Droids: PART 3 OF 3\" – Continuity, Criticisms, and Captain Panaka, Daniel Wallace's StarWars.com Blog","elements":[]}]}],"images":[]}]}