{"sections":[{"title":"Morley","level":1,"content":[{"type":"paragraph","text":"Morley was a male Anacondan scavenger who lived on Lotho Minor and was a servant to Darth Maul."}],"images":[{"src":"http:\/\/img4.wikia.nocookie.net\/__cb20140430180744\/starwars\/images\/8\/8d\/Eras-legends.png"}]},{"title":"Biography","level":2,"content":[{"type":"paragraph","text":"Morley lived on the junk-covered world of Lotho Minor and served Darth Maul. After Savage Opress arrived, he said that he would help him navigate his way to find his brother for a price, which changed to free when Savage choked Morley. After a short talk, Opress said that his brother looked like him, Morley mentioned an aggressive man with horns, but quickly clarified that he was only a myth. Later, they ran through a field of Fire-breathers and a brief battle with Junkers. After this, they had arrived at a hut, in an attempt to escape the acid rain that frequently occurred on Lotho Minor."},{"type":"paragraph","text":"In the hut, which Savage had thought would be where his brother had been living, he found only Junker corpses. Then, Morley betrayed him and threw him down the chute, and cackled as he bragged that he would get the leftovers of the presumably soon to be dead Savage Opress. Savage Opress found Darth Maul, but he was a cyborg in terrible-condition. When Morley came down the chute for his leftovers of supposed dead Opress, Savage Opress blamed his brother's condition on him and choked him to death. He then threw Morley's corpse into a fire out of anger."}],"images":[{"src":"http:\/\/img2.wikia.nocookie.net\/__cb20130609220504\/starwars\/images\/thumb\/c\/c8\/MorleyAndOpress-Brothers.png\/250px-MorleyAndOpress-Brothers.png","caption":"Morley and Savage Opress"}]},{"title":"Behind the scenes","level":2,"content":[],"images":[]},{"title":"Conflicting Death","level":3,"content":[{"type":"paragraph","text":"In Star Wars: The Wrath of Darth Maul, Morley's role and death are presented much differently than in The Clone Wars television series. In this story, Morley does not double-cross Savage and leads him into the cave where Maul resides. Maul regards Morley as a scavenger and that he should have kept his distance from him, then leaps down on top of him from the ceiling of the cavern and crushes him to death with his mechanical apparatus. A retcon for these conflicting events may not even be possible. According to the trivia gallery for Brothers, this was actually originally scripted in the episode, but was changed to Opress killing him in revenge."},{"type":"paragraph","text":"Morley's animation and mouth movement were intended to be a homage to creatures being animated as hand puppets back when films were first being developed."}],"images":[]},{"title":"Appearances","level":2,"content":[{"type":"list","elements":[{"text":"Star Wars: The Wrath of Darth Maul","elements":[]},{"text":"Star Wars: The Clone Wars – \"Brothers\"","elements":[]},{"text":"Star Wars: The Clone Wars: The Sith Hunters","elements":[]},{"text":"Star Wars: The Clone Wars – \"Revival\"","elements":[]}]}],"images":[]},{"title":"Sources","level":2,"content":[{"type":"list","elements":[{"text":" Brothers Trivia on StarWars.com","elements":[]},{"text":" \"Drawing from the Imagination: Mythological Creatures in Star Wars, Part 1,\" The Official Star Wars Blog","elements":[]},{"text":" Morley in the Encyclopedia","elements":[]},{"text":" Darth Maul in the Encyclopedia","elements":[]}]}],"images":[]},{"title":"External links","level":2,"content":[{"type":"list","elements":[{"text":" \"Drawing from the Imagination: Mythological Creatures in Star Wars, Part 1,\" The Official Star Wars Blog","elements":[]}]}],"images":[]}]}